pub const NULL: u32 = 0;
pub type UINT = ::std::os::raw::c_uint;
pub type MTAPIRES = UINT;
pub type UINT64 = ::std::os::raw::c_ulonglong;
pub type PUINT64 = *mut ::std::os::raw::c_ulonglong;
pub type WCHAR = u16;
pub type LPCWSTR = *const WCHAR;
pub type PCWSTR = *const WCHAR;
pub type INT = ::std::os::raw::c_int;
pub type PUINT = *mut ::std::os::raw::c_uint;
pub type INT8 = ::std::os::raw::c_schar;
pub type PINT8 = *mut ::std::os::raw::c_schar;
pub type INT16 = ::std::os::raw::c_short;
pub type PINT16 = *mut ::std::os::raw::c_short;
pub type INT32 = ::std::os::raw::c_int;
pub type PINT32 = *mut ::std::os::raw::c_int;
pub type INT64 = ::std::os::raw::c_longlong;
pub type PINT64 = *mut ::std::os::raw::c_longlong;
pub type UINT8 = ::std::os::raw::c_uchar;
pub type PUINT8 = *mut ::std::os::raw::c_uchar;
pub type UINT16 = ::std::os::raw::c_ushort;
pub type PUINT16 = *mut ::std::os::raw::c_ushort;
pub type UINT32 = ::std::os::raw::c_uint;
pub type PUINT32 = *mut ::std::os::raw::c_uint;
pub type MTAPISTR = [u16; 260usize];
pub type DWORD = ::std::os::raw::c_ulong;
pub type COLORREF = DWORD;
pub type USHORT = ::std::os::raw::c_ushort;
pub type UCHAR = ::std::os::raw::c_uchar;
pub type MTSortFunctionPtr = ::std::option::Option<
    unsafe extern "C" fn(
        left: *const ::std::os::raw::c_void,
        right: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type LPCVOID = *const ::std::os::raw::c_void;
pub type LPVOID = *mut ::std::os::raw::c_void;
pub type SHORT = ::std::os::raw::c_short;
pub type NWPSTR = *mut WCHAR;
pub type LPWSTR = *mut WCHAR;
pub type PWSTR = *mut WCHAR;
pub type ULONG = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_addr {
    pub u: in6_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in6_addr__bindgen_ty_1 {
    pub Byte: [UCHAR; 16usize],
    pub Word: [USHORT; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in6_addr__bindgen_ty_1"][::std::mem::size_of::<in6_addr__bindgen_ty_1>() - 16usize];
    ["Alignment of in6_addr__bindgen_ty_1"]
        [::std::mem::align_of::<in6_addr__bindgen_ty_1>() - 2usize];
    ["Offset of field: in6_addr__bindgen_ty_1::Byte"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, Byte) - 0usize];
    ["Offset of field: in6_addr__bindgen_ty_1::Word"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, Word) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in6_addr"][::std::mem::size_of::<in6_addr>() - 16usize];
    ["Alignment of in6_addr"][::std::mem::align_of::<in6_addr>() - 2usize];
    ["Offset of field: in6_addr::u"][::std::mem::offset_of!(in6_addr, u) - 0usize];
};
pub type IN6_ADDR = in6_addr;
pub const EnMTAPIRetcode_MT_RET_OK: EnMTAPIRetcode = 0;
pub const EnMTAPIRetcode_MT_RET_OK_NONE: EnMTAPIRetcode = 1;
pub const EnMTAPIRetcode_MT_RET_ERROR: EnMTAPIRetcode = 2;
pub const EnMTAPIRetcode_MT_RET_ERR_PARAMS: EnMTAPIRetcode = 3;
pub const EnMTAPIRetcode_MT_RET_ERR_DATA: EnMTAPIRetcode = 4;
pub const EnMTAPIRetcode_MT_RET_ERR_DISK: EnMTAPIRetcode = 5;
pub const EnMTAPIRetcode_MT_RET_ERR_MEM: EnMTAPIRetcode = 6;
pub const EnMTAPIRetcode_MT_RET_ERR_NETWORK: EnMTAPIRetcode = 7;
pub const EnMTAPIRetcode_MT_RET_ERR_PERMISSIONS: EnMTAPIRetcode = 8;
pub const EnMTAPIRetcode_MT_RET_ERR_TIMEOUT: EnMTAPIRetcode = 9;
pub const EnMTAPIRetcode_MT_RET_ERR_CONNECTION: EnMTAPIRetcode = 10;
pub const EnMTAPIRetcode_MT_RET_ERR_NOSERVICE: EnMTAPIRetcode = 11;
pub const EnMTAPIRetcode_MT_RET_ERR_FREQUENT: EnMTAPIRetcode = 12;
pub const EnMTAPIRetcode_MT_RET_ERR_NOTFOUND: EnMTAPIRetcode = 13;
pub const EnMTAPIRetcode_MT_RET_ERR_PARTIAL: EnMTAPIRetcode = 14;
pub const EnMTAPIRetcode_MT_RET_ERR_SHUTDOWN: EnMTAPIRetcode = 15;
pub const EnMTAPIRetcode_MT_RET_ERR_CANCEL: EnMTAPIRetcode = 16;
pub const EnMTAPIRetcode_MT_RET_ERR_DUPLICATE: EnMTAPIRetcode = 17;
pub const EnMTAPIRetcode_MT_RET_AUTH_CLIENT_INVALID: EnMTAPIRetcode = 1000;
pub const EnMTAPIRetcode_MT_RET_AUTH_ACCOUNT_INVALID: EnMTAPIRetcode = 1001;
pub const EnMTAPIRetcode_MT_RET_AUTH_ACCOUNT_DISABLED: EnMTAPIRetcode = 1002;
pub const EnMTAPIRetcode_MT_RET_AUTH_ADVANCED: EnMTAPIRetcode = 1003;
pub const EnMTAPIRetcode_MT_RET_AUTH_CERTIFICATE: EnMTAPIRetcode = 1004;
pub const EnMTAPIRetcode_MT_RET_AUTH_CERTIFICATE_BAD: EnMTAPIRetcode = 1005;
pub const EnMTAPIRetcode_MT_RET_AUTH_NOTCONFIRMED: EnMTAPIRetcode = 1006;
pub const EnMTAPIRetcode_MT_RET_AUTH_SERVER_INTERNAL: EnMTAPIRetcode = 1007;
pub const EnMTAPIRetcode_MT_RET_AUTH_SERVER_BAD: EnMTAPIRetcode = 1008;
pub const EnMTAPIRetcode_MT_RET_AUTH_UPDATE_ONLY: EnMTAPIRetcode = 1009;
pub const EnMTAPIRetcode_MT_RET_AUTH_CLIENT_OLD: EnMTAPIRetcode = 1010;
pub const EnMTAPIRetcode_MT_RET_AUTH_MANAGER_NOCONFIG: EnMTAPIRetcode = 1011;
pub const EnMTAPIRetcode_MT_RET_AUTH_MANAGER_IPBLOCK: EnMTAPIRetcode = 1012;
pub const EnMTAPIRetcode_MT_RET_AUTH_GROUP_INVALID: EnMTAPIRetcode = 1013;
pub const EnMTAPIRetcode_MT_RET_AUTH_CA_DISABLED: EnMTAPIRetcode = 1014;
pub const EnMTAPIRetcode_MT_RET_AUTH_INVALID_ID: EnMTAPIRetcode = 1015;
pub const EnMTAPIRetcode_MT_RET_AUTH_INVALID_IP: EnMTAPIRetcode = 1016;
pub const EnMTAPIRetcode_MT_RET_AUTH_INVALID_TYPE: EnMTAPIRetcode = 1017;
pub const EnMTAPIRetcode_MT_RET_AUTH_SERVER_BUSY: EnMTAPIRetcode = 1018;
pub const EnMTAPIRetcode_MT_RET_AUTH_SERVER_CERT: EnMTAPIRetcode = 1019;
pub const EnMTAPIRetcode_MT_RET_AUTH_ACCOUNT_UNKNOWN: EnMTAPIRetcode = 1020;
pub const EnMTAPIRetcode_MT_RET_AUTH_SERVER_OLD: EnMTAPIRetcode = 1021;
pub const EnMTAPIRetcode_MT_RET_AUTH_SERVER_LIMIT: EnMTAPIRetcode = 1022;
pub const EnMTAPIRetcode_MT_RET_AUTH_MOBILE_DISABLED: EnMTAPIRetcode = 1023;
pub const EnMTAPIRetcode_MT_RET_AUTH_MANAGER_TYPE: EnMTAPIRetcode = 1024;
pub const EnMTAPIRetcode_MT_RET_AUTH_DEMO_DISABLED: EnMTAPIRetcode = 1025;
pub const EnMTAPIRetcode_MT_RET_AUTH_RESET_PASSWORD: EnMTAPIRetcode = 1026;
pub const EnMTAPIRetcode_MT_RET_AUTH_OTP_INVALID: EnMTAPIRetcode = 1027;
pub const EnMTAPIRetcode_MT_RET_AUTH_OTP_NEED_SECRET: EnMTAPIRetcode = 1028;
pub const EnMTAPIRetcode_MT_RET_AUTH_MIGRATION_MT4: EnMTAPIRetcode = 1029;
pub const EnMTAPIRetcode_MT_RET_AUTH_MIGRATION_MT5: EnMTAPIRetcode = 1030;
pub const EnMTAPIRetcode_MT_RET_AUTH_INVALID_VERIFY: EnMTAPIRetcode = 1031;
pub const EnMTAPIRetcode_MT_RET_AUTH_VERIFY_BAD_EMAIL: EnMTAPIRetcode = 1032;
pub const EnMTAPIRetcode_MT_RET_AUTH_VERIFY_BAD_PHONE: EnMTAPIRetcode = 1033;
pub const EnMTAPIRetcode_MT_RET_AUTH_API_DISABLED: EnMTAPIRetcode = 1034;
pub const EnMTAPIRetcode_MT_RET_CFG_LAST_ADMIN: EnMTAPIRetcode = 2000;
pub const EnMTAPIRetcode_MT_RET_CFG_LAST_ADMIN_GROUP: EnMTAPIRetcode = 2001;
pub const EnMTAPIRetcode_MT_RET_CFG_NOT_EMPTY: EnMTAPIRetcode = 2003;
pub const EnMTAPIRetcode_MT_RET_CFG_INVALID_RANGE: EnMTAPIRetcode = 2004;
pub const EnMTAPIRetcode_MT_RET_CFG_NOT_MANAGER_LOGIN: EnMTAPIRetcode = 2005;
pub const EnMTAPIRetcode_MT_RET_CFG_BUILTIN: EnMTAPIRetcode = 2006;
pub const EnMTAPIRetcode_MT_RET_CFG_DUPLICATE: EnMTAPIRetcode = 2007;
pub const EnMTAPIRetcode_MT_RET_CFG_LIMIT_REACHED: EnMTAPIRetcode = 2008;
pub const EnMTAPIRetcode_MT_RET_CFG_NO_ACCESS_TO_MAIN: EnMTAPIRetcode = 2009;
pub const EnMTAPIRetcode_MT_RET_CFG_DEALER_ID_EXIST: EnMTAPIRetcode = 2010;
pub const EnMTAPIRetcode_MT_RET_CFG_BIND_ADDR_EXIST: EnMTAPIRetcode = 2011;
pub const EnMTAPIRetcode_MT_RET_CFG_WORKING_TRADE: EnMTAPIRetcode = 2012;
pub const EnMTAPIRetcode_MT_RET_CFG_GATEWAY_NAME_EXIST: EnMTAPIRetcode = 2013;
pub const EnMTAPIRetcode_MT_RET_CFG_SWITCH_TO_BACKUP: EnMTAPIRetcode = 2014;
pub const EnMTAPIRetcode_MT_RET_CFG_NO_BACKUP_MODULE: EnMTAPIRetcode = 2015;
pub const EnMTAPIRetcode_MT_RET_CFG_NO_TRADE_MODULE: EnMTAPIRetcode = 2016;
pub const EnMTAPIRetcode_MT_RET_CFG_NO_HISTORY_MODULE: EnMTAPIRetcode = 2017;
pub const EnMTAPIRetcode_MT_RET_CFG_ANOTHER_SWITCH: EnMTAPIRetcode = 2018;
pub const EnMTAPIRetcode_MT_RET_CFG_NO_LICENSE_FILE: EnMTAPIRetcode = 2019;
pub const EnMTAPIRetcode_MT_RET_CFG_GATEWAY_LOGIN_EXIST: EnMTAPIRetcode = 2020;
pub const EnMTAPIRetcode_MT_RET_USR_LAST_ADMIN: EnMTAPIRetcode = 3001;
pub const EnMTAPIRetcode_MT_RET_USR_LOGIN_EXHAUSTED: EnMTAPIRetcode = 3002;
pub const EnMTAPIRetcode_MT_RET_USR_LOGIN_PROHIBITED: EnMTAPIRetcode = 3003;
pub const EnMTAPIRetcode_MT_RET_USR_LOGIN_EXIST: EnMTAPIRetcode = 3004;
pub const EnMTAPIRetcode_MT_RET_USR_SUICIDE: EnMTAPIRetcode = 3005;
pub const EnMTAPIRetcode_MT_RET_USR_INVALID_PASSWORD: EnMTAPIRetcode = 3006;
pub const EnMTAPIRetcode_MT_RET_USR_LIMIT_REACHED: EnMTAPIRetcode = 3007;
pub const EnMTAPIRetcode_MT_RET_USR_HAS_TRADES: EnMTAPIRetcode = 3008;
pub const EnMTAPIRetcode_MT_RET_USR_DIFFERENT_SERVERS: EnMTAPIRetcode = 3009;
pub const EnMTAPIRetcode_MT_RET_USR_DIFFERENT_CURRENCY: EnMTAPIRetcode = 3010;
pub const EnMTAPIRetcode_MT_RET_USR_IMPORT_BALANCE: EnMTAPIRetcode = 3011;
pub const EnMTAPIRetcode_MT_RET_USR_IMPORT_GROUP: EnMTAPIRetcode = 3012;
pub const EnMTAPIRetcode_MT_RET_USR_ACCOUNT_EXIST: EnMTAPIRetcode = 3013;
pub const EnMTAPIRetcode_MT_RET_USR_IMPORT_ACCOUNT: EnMTAPIRetcode = 3014;
pub const EnMTAPIRetcode_MT_RET_USR_IMPORT_POSITIONS: EnMTAPIRetcode = 3015;
pub const EnMTAPIRetcode_MT_RET_USR_IMPORT_ORDERS: EnMTAPIRetcode = 3016;
pub const EnMTAPIRetcode_MT_RET_USR_IMPORT_DEALS: EnMTAPIRetcode = 3017;
pub const EnMTAPIRetcode_MT_RET_USR_IMPORT_HISTORY: EnMTAPIRetcode = 3018;
pub const EnMTAPIRetcode_MT_RET_USR_API_LIMIT_REACHED: EnMTAPIRetcode = 3019;
pub const EnMTAPIRetcode_MT_RET_TRADE_LIMIT_REACHED: EnMTAPIRetcode = 4001;
pub const EnMTAPIRetcode_MT_RET_TRADE_ORDER_EXIST: EnMTAPIRetcode = 4002;
pub const EnMTAPIRetcode_MT_RET_TRADE_ORDER_EXHAUSTED: EnMTAPIRetcode = 4003;
pub const EnMTAPIRetcode_MT_RET_TRADE_DEAL_EXHAUSTED: EnMTAPIRetcode = 4004;
pub const EnMTAPIRetcode_MT_RET_TRADE_MAX_MONEY: EnMTAPIRetcode = 4005;
pub const EnMTAPIRetcode_MT_RET_TRADE_DEAL_EXIST: EnMTAPIRetcode = 4006;
pub const EnMTAPIRetcode_MT_RET_TRADE_ORDER_PROHIBITED: EnMTAPIRetcode = 4007;
pub const EnMTAPIRetcode_MT_RET_TRADE_DEAL_PROHIBITED: EnMTAPIRetcode = 4008;
pub const EnMTAPIRetcode_MT_RET_TRADE_SPLIT_VOLUME: EnMTAPIRetcode = 4009;
pub const EnMTAPIRetcode_MT_RET_REPORT_SNAPSHOT: EnMTAPIRetcode = 5001;
pub const EnMTAPIRetcode_MT_RET_REPORT_NOTSUPPORTED: EnMTAPIRetcode = 5002;
pub const EnMTAPIRetcode_MT_RET_REPORT_NODATA: EnMTAPIRetcode = 5003;
pub const EnMTAPIRetcode_MT_RET_REPORT_TEMPLATE_BAD: EnMTAPIRetcode = 5004;
pub const EnMTAPIRetcode_MT_RET_REPORT_TEMPLATE_END: EnMTAPIRetcode = 5005;
pub const EnMTAPIRetcode_MT_RET_REPORT_INVALID_ROW: EnMTAPIRetcode = 5006;
pub const EnMTAPIRetcode_MT_RET_REPORT_LIMIT_REPEAT: EnMTAPIRetcode = 5007;
pub const EnMTAPIRetcode_MT_RET_REPORT_LIMIT_REPORT: EnMTAPIRetcode = 5008;
pub const EnMTAPIRetcode_MT_RET_HST_SYMBOL_NOTFOUND: EnMTAPIRetcode = 6001;
pub const EnMTAPIRetcode_MT_RET_REQUEST_INWAY: EnMTAPIRetcode = 10001;
pub const EnMTAPIRetcode_MT_RET_REQUEST_ACCEPTED: EnMTAPIRetcode = 10002;
pub const EnMTAPIRetcode_MT_RET_REQUEST_PROCESS: EnMTAPIRetcode = 10003;
pub const EnMTAPIRetcode_MT_RET_REQUEST_REQUOTE: EnMTAPIRetcode = 10004;
pub const EnMTAPIRetcode_MT_RET_REQUEST_PRICES: EnMTAPIRetcode = 10005;
pub const EnMTAPIRetcode_MT_RET_REQUEST_REJECT: EnMTAPIRetcode = 10006;
pub const EnMTAPIRetcode_MT_RET_REQUEST_CANCEL: EnMTAPIRetcode = 10007;
pub const EnMTAPIRetcode_MT_RET_REQUEST_PLACED: EnMTAPIRetcode = 10008;
pub const EnMTAPIRetcode_MT_RET_REQUEST_DONE: EnMTAPIRetcode = 10009;
pub const EnMTAPIRetcode_MT_RET_REQUEST_DONE_PARTIAL: EnMTAPIRetcode = 10010;
pub const EnMTAPIRetcode_MT_RET_REQUEST_ERROR: EnMTAPIRetcode = 10011;
pub const EnMTAPIRetcode_MT_RET_REQUEST_TIMEOUT: EnMTAPIRetcode = 10012;
pub const EnMTAPIRetcode_MT_RET_REQUEST_INVALID: EnMTAPIRetcode = 10013;
pub const EnMTAPIRetcode_MT_RET_REQUEST_INVALID_VOLUME: EnMTAPIRetcode = 10014;
pub const EnMTAPIRetcode_MT_RET_REQUEST_INVALID_PRICE: EnMTAPIRetcode = 10015;
pub const EnMTAPIRetcode_MT_RET_REQUEST_INVALID_STOPS: EnMTAPIRetcode = 10016;
pub const EnMTAPIRetcode_MT_RET_REQUEST_TRADE_DISABLED: EnMTAPIRetcode = 10017;
pub const EnMTAPIRetcode_MT_RET_REQUEST_MARKET_CLOSED: EnMTAPIRetcode = 10018;
pub const EnMTAPIRetcode_MT_RET_REQUEST_NO_MONEY: EnMTAPIRetcode = 10019;
pub const EnMTAPIRetcode_MT_RET_REQUEST_PRICE_CHANGED: EnMTAPIRetcode = 10020;
pub const EnMTAPIRetcode_MT_RET_REQUEST_PRICE_OFF: EnMTAPIRetcode = 10021;
pub const EnMTAPIRetcode_MT_RET_REQUEST_INVALID_EXP: EnMTAPIRetcode = 10022;
pub const EnMTAPIRetcode_MT_RET_REQUEST_ORDER_CHANGED: EnMTAPIRetcode = 10023;
pub const EnMTAPIRetcode_MT_RET_REQUEST_TOO_MANY: EnMTAPIRetcode = 10024;
pub const EnMTAPIRetcode_MT_RET_REQUEST_NO_CHANGES: EnMTAPIRetcode = 10025;
pub const EnMTAPIRetcode_MT_RET_REQUEST_AT_DISABLED_SERVER: EnMTAPIRetcode = 10026;
pub const EnMTAPIRetcode_MT_RET_REQUEST_AT_DISABLED_CLIENT: EnMTAPIRetcode = 10027;
pub const EnMTAPIRetcode_MT_RET_REQUEST_LOCKED: EnMTAPIRetcode = 10028;
pub const EnMTAPIRetcode_MT_RET_REQUEST_FROZEN: EnMTAPIRetcode = 10029;
pub const EnMTAPIRetcode_MT_RET_REQUEST_INVALID_FILL: EnMTAPIRetcode = 10030;
pub const EnMTAPIRetcode_MT_RET_REQUEST_CONNECTION: EnMTAPIRetcode = 10031;
pub const EnMTAPIRetcode_MT_RET_REQUEST_ONLY_REAL: EnMTAPIRetcode = 10032;
pub const EnMTAPIRetcode_MT_RET_REQUEST_LIMIT_ORDERS: EnMTAPIRetcode = 10033;
pub const EnMTAPIRetcode_MT_RET_REQUEST_LIMIT_VOLUME: EnMTAPIRetcode = 10034;
pub const EnMTAPIRetcode_MT_RET_REQUEST_INVALID_ORDER: EnMTAPIRetcode = 10035;
pub const EnMTAPIRetcode_MT_RET_REQUEST_POSITION_CLOSED: EnMTAPIRetcode = 10036;
pub const EnMTAPIRetcode_MT_RET_REQUEST_EXECUTION_SKIPPED: EnMTAPIRetcode = 10037;
pub const EnMTAPIRetcode_MT_RET_REQUEST_INVALID_CLOSE_VOLUME: EnMTAPIRetcode = 10038;
pub const EnMTAPIRetcode_MT_RET_REQUEST_CLOSE_ORDER_EXIST: EnMTAPIRetcode = 10039;
pub const EnMTAPIRetcode_MT_RET_REQUEST_LIMIT_POSITIONS: EnMTAPIRetcode = 10040;
pub const EnMTAPIRetcode_MT_RET_REQUEST_REJECT_CANCEL: EnMTAPIRetcode = 10041;
pub const EnMTAPIRetcode_MT_RET_REQUEST_LONG_ONLY: EnMTAPIRetcode = 10042;
pub const EnMTAPIRetcode_MT_RET_REQUEST_SHORT_ONLY: EnMTAPIRetcode = 10043;
pub const EnMTAPIRetcode_MT_RET_REQUEST_CLOSE_ONLY: EnMTAPIRetcode = 10044;
pub const EnMTAPIRetcode_MT_RET_REQUEST_PROHIBITED_BY_FIFO: EnMTAPIRetcode = 10045;
pub const EnMTAPIRetcode_MT_RET_REQUEST_HEDGE_PROHIBITED: EnMTAPIRetcode = 10046;
pub const EnMTAPIRetcode_MT_RET_REQUEST_RETURN: EnMTAPIRetcode = 11000;
pub const EnMTAPIRetcode_MT_RET_REQUEST_DONE_CANCEL: EnMTAPIRetcode = 11001;
pub const EnMTAPIRetcode_MT_RET_REQUEST_REQUOTE_RETURN: EnMTAPIRetcode = 11002;
pub const EnMTAPIRetcode_MT_RET_ERR_NOTIMPLEMENT: EnMTAPIRetcode = 12000;
pub const EnMTAPIRetcode_MT_RET_ERR_NOTMAIN: EnMTAPIRetcode = 12001;
pub const EnMTAPIRetcode_MT_RET_ERR_NOTSUPPORTED: EnMTAPIRetcode = 12002;
pub const EnMTAPIRetcode_MT_RET_ERR_DEADLOCK: EnMTAPIRetcode = 12003;
pub const EnMTAPIRetcode_MT_RET_ERR_LOCKED: EnMTAPIRetcode = 12004;
pub const EnMTAPIRetcode_MT_RET_MESSENGER_INVALID_PHONE: EnMTAPIRetcode = 14000;
pub const EnMTAPIRetcode_MT_RET_MESSENGER_NOT_MOBILE: EnMTAPIRetcode = 14001;
pub const EnMTAPIRetcode_MT_RET_SUBS_NOT_FOUND: EnMTAPIRetcode = 15000;
pub const EnMTAPIRetcode_MT_RET_SUBS_NOT_FOUND_CFG: EnMTAPIRetcode = 15001;
pub const EnMTAPIRetcode_MT_RET_SUBS_NOT_FOUND_USER: EnMTAPIRetcode = 15002;
pub const EnMTAPIRetcode_MT_RET_SUBS_DISABLED: EnMTAPIRetcode = 15003;
pub const EnMTAPIRetcode_MT_RET_SUBS_PERMISSION_USER: EnMTAPIRetcode = 15004;
pub const EnMTAPIRetcode_MT_RET_SUBS_PERMISSION_SUBSCRIBE: EnMTAPIRetcode = 15005;
pub const EnMTAPIRetcode_MT_RET_SUBS_PERMISSION_UNSUBSCRIBE: EnMTAPIRetcode = 15006;
pub const EnMTAPIRetcode_MT_RET_SUBS_REAL_ONLY: EnMTAPIRetcode = 15007;
pub type EnMTAPIRetcode = ::std::os::raw::c_int;
#[repr(C)]
pub struct IMTDatasetColumn__bindgen_vtable {
    pub IMTDatasetColumn_Release: unsafe extern "C" fn(this: *mut IMTDatasetColumn),
    pub IMTDatasetColumn_Assign: unsafe extern "C" fn(
        this: *mut IMTDatasetColumn,
        column: *const IMTDatasetColumn,
    ) -> MTAPIRES,
    pub IMTDatasetColumn_Clear: unsafe extern "C" fn(this: *mut IMTDatasetColumn) -> MTAPIRES,
    pub IMTDatasetColumn_Name1:
        unsafe extern "C" fn(this: *mut IMTDatasetColumn, name: LPCWSTR) -> MTAPIRES,
    pub IMTDatasetColumn_Name: unsafe extern "C" fn(this: *const IMTDatasetColumn) -> LPCWSTR,
    pub IMTDatasetColumn_ColumnID1:
        unsafe extern "C" fn(this: *mut IMTDatasetColumn, column_id: UINT) -> MTAPIRES,
    pub IMTDatasetColumn_ColumnID: unsafe extern "C" fn(this: *const IMTDatasetColumn) -> UINT,
    pub IMTDatasetColumn_Type1:
        unsafe extern "C" fn(this: *mut IMTDatasetColumn, type_: UINT) -> MTAPIRES,
    pub IMTDatasetColumn_Type: unsafe extern "C" fn(this: *const IMTDatasetColumn) -> UINT,
    pub IMTDatasetColumn_Width1:
        unsafe extern "C" fn(this: *mut IMTDatasetColumn, width: UINT) -> MTAPIRES,
    pub IMTDatasetColumn_Width: unsafe extern "C" fn(this: *const IMTDatasetColumn) -> UINT,
    pub IMTDatasetColumn_WidthMax1:
        unsafe extern "C" fn(this: *mut IMTDatasetColumn, width_max: UINT) -> MTAPIRES,
    pub IMTDatasetColumn_WidthMax: unsafe extern "C" fn(this: *const IMTDatasetColumn) -> UINT,
    pub IMTDatasetColumn_Digits1:
        unsafe extern "C" fn(this: *mut IMTDatasetColumn, digits: UINT) -> MTAPIRES,
    pub IMTDatasetColumn_Digits: unsafe extern "C" fn(this: *const IMTDatasetColumn) -> UINT,
    pub IMTDatasetColumn_DigitsColumn1:
        unsafe extern "C" fn(this: *mut IMTDatasetColumn, column_id: UINT) -> MTAPIRES,
    pub IMTDatasetColumn_DigitsColumn: unsafe extern "C" fn(this: *const IMTDatasetColumn) -> UINT,
    pub IMTDatasetColumn_Flags1:
        unsafe extern "C" fn(this: *mut IMTDatasetColumn, flags: UINT64) -> MTAPIRES,
    pub IMTDatasetColumn_Flags: unsafe extern "C" fn(this: *const IMTDatasetColumn) -> UINT64,
    pub IMTDatasetColumn_Offset1:
        unsafe extern "C" fn(this: *mut IMTDatasetColumn, offset: UINT) -> MTAPIRES,
    pub IMTDatasetColumn_Offset: unsafe extern "C" fn(this: *const IMTDatasetColumn) -> UINT,
    pub IMTDatasetColumn_Size1:
        unsafe extern "C" fn(this: *mut IMTDatasetColumn, size: UINT) -> MTAPIRES,
    pub IMTDatasetColumn_Size: unsafe extern "C" fn(this: *const IMTDatasetColumn) -> UINT,

    pub IMTDatasetColumn_Color1:
        unsafe extern "C" fn(this: *mut IMTDatasetColumn, color: UINT) -> MTAPIRES,
    pub IMTDatasetColumn_Color: unsafe extern "C" fn(this: *const IMTDatasetColumn) -> UINT,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTDatasetColumn {
    pub vtable_: *const IMTDatasetColumn__bindgen_vtable,
}
pub const IMTDatasetColumn_EnType_TYPE_INT8: IMTDatasetColumn_EnType = 0;
pub const IMTDatasetColumn_EnType_TYPE_UINT8: IMTDatasetColumn_EnType = 1;
pub const IMTDatasetColumn_EnType_TYPE_INT16: IMTDatasetColumn_EnType = 2;
pub const IMTDatasetColumn_EnType_TYPE_UINT16: IMTDatasetColumn_EnType = 3;
pub const IMTDatasetColumn_EnType_TYPE_INT32: IMTDatasetColumn_EnType = 4;
pub const IMTDatasetColumn_EnType_TYPE_UINT32: IMTDatasetColumn_EnType = 5;
pub const IMTDatasetColumn_EnType_TYPE_INT64: IMTDatasetColumn_EnType = 6;
pub const IMTDatasetColumn_EnType_TYPE_UINT64: IMTDatasetColumn_EnType = 7;
pub const IMTDatasetColumn_EnType_TYPE_DOUBLE: IMTDatasetColumn_EnType = 8;
pub const IMTDatasetColumn_EnType_TYPE_MONEY: IMTDatasetColumn_EnType = 9;
pub const IMTDatasetColumn_EnType_TYPE_STRING: IMTDatasetColumn_EnType = 10;
pub const IMTDatasetColumn_EnType_TYPE_DATE: IMTDatasetColumn_EnType = 11;
pub const IMTDatasetColumn_EnType_TYPE_TIME: IMTDatasetColumn_EnType = 12;
pub const IMTDatasetColumn_EnType_TYPE_DATETIME: IMTDatasetColumn_EnType = 13;
pub const IMTDatasetColumn_EnType_TYPE_TIME_MSC: IMTDatasetColumn_EnType = 14;
pub const IMTDatasetColumn_EnType_TYPE_DATETIME_MSC: IMTDatasetColumn_EnType = 15;
pub const IMTDatasetColumn_EnType_TYPE_PRICE: IMTDatasetColumn_EnType = 100;
pub const IMTDatasetColumn_EnType_TYPE_PRICES: IMTDatasetColumn_EnType = 101;
pub const IMTDatasetColumn_EnType_TYPE_PRICE_POSITION: IMTDatasetColumn_EnType = 102;
pub const IMTDatasetColumn_EnType_TYPE_VOLUME: IMTDatasetColumn_EnType = 200;
pub const IMTDatasetColumn_EnType_TYPE_VOLUME_ORDER: IMTDatasetColumn_EnType = 201;
pub const IMTDatasetColumn_EnType_TYPE_VOLUME_EXT: IMTDatasetColumn_EnType = 202;
pub const IMTDatasetColumn_EnType_TYPE_VOLUME_ORDER_EXT: IMTDatasetColumn_EnType = 203;
pub const IMTDatasetColumn_EnType_TYPE_POSITION_TYPE: IMTDatasetColumn_EnType = 300;
pub const IMTDatasetColumn_EnType_TYPE_ORDER_TYPE: IMTDatasetColumn_EnType = 400;
pub const IMTDatasetColumn_EnType_TYPE_ORDER_TYPE_TIME: IMTDatasetColumn_EnType = 401;
pub const IMTDatasetColumn_EnType_TYPE_ORDER_TYPE_REASON: IMTDatasetColumn_EnType = 402;
pub const IMTDatasetColumn_EnType_TYPE_ORDER_STATUS: IMTDatasetColumn_EnType = 403;
pub const IMTDatasetColumn_EnType_TYPE_ORDER_FILLING: IMTDatasetColumn_EnType = 404;
pub const IMTDatasetColumn_EnType_TYPE_DEAL_ACTION: IMTDatasetColumn_EnType = 500;
pub const IMTDatasetColumn_EnType_TYPE_DEAL_ENTRY: IMTDatasetColumn_EnType = 501;
pub const IMTDatasetColumn_EnType_TYPE_USER_LOGIN: IMTDatasetColumn_EnType = 600;
pub const IMTDatasetColumn_EnType_TYPE_USER_LEVERAGE: IMTDatasetColumn_EnType = 601;
pub const IMTDatasetColumn_EnType_TYPE_CLIENT_ID: IMTDatasetColumn_EnType = 700;
pub const IMTDatasetColumn_EnType_TYPE_FIRST: IMTDatasetColumn_EnType = 0;
pub const IMTDatasetColumn_EnType_TYPE_LAST: IMTDatasetColumn_EnType = 700;
pub type IMTDatasetColumn_EnType = ::std::os::raw::c_int;
pub const IMTDatasetColumn_EnFlags_FLAG_NONE: IMTDatasetColumn_EnFlags = 0;
pub const IMTDatasetColumn_EnFlags_FLAG_PRIMARY: IMTDatasetColumn_EnFlags = 1;
pub const IMTDatasetColumn_EnFlags_FLAG_HIDDEN_VIEW: IMTDatasetColumn_EnFlags = 2;
pub const IMTDatasetColumn_EnFlags_FLAG_HIDDEN_SAVE: IMTDatasetColumn_EnFlags = 4;
pub const IMTDatasetColumn_EnFlags_FLAG_HIDDEN: IMTDatasetColumn_EnFlags = 6;
pub const IMTDatasetColumn_EnFlags_FLAG_LEFT: IMTDatasetColumn_EnFlags = 8;
pub const IMTDatasetColumn_EnFlags_FLAG_RIGHT: IMTDatasetColumn_EnFlags = 16;
pub const IMTDatasetColumn_EnFlags_FLAG_CENTER: IMTDatasetColumn_EnFlags = 24;
pub const IMTDatasetColumn_EnFlags_FLAG_SORT_DEFAULT: IMTDatasetColumn_EnFlags = 256;
pub const IMTDatasetColumn_EnFlags_FLAG_ALL: IMTDatasetColumn_EnFlags = 287;
pub type IMTDatasetColumn_EnFlags = ::std::os::raw::c_int;
pub const IMTDatasetColumn_EnColumnColor_COLUMN_COLOR_AUTO: IMTDatasetColumn_EnColumnColor = -1;
pub type IMTDatasetColumn_EnColumnColor = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTDatasetColumn"][::std::mem::size_of::<IMTDatasetColumn>() - 8usize];
    ["Alignment of IMTDatasetColumn"][::std::mem::align_of::<IMTDatasetColumn>() - 8usize];
};
#[repr(C)]
pub struct IMTDatasetSummary__bindgen_vtable {
    pub IMTDatasetSummary_Release: unsafe extern "C" fn(this: *mut IMTDatasetSummary),
    pub IMTDatasetSummary_Assign: unsafe extern "C" fn(
        this: *mut IMTDatasetSummary,
        summary: *const IMTDatasetSummary,
    ) -> MTAPIRES,
    pub IMTDatasetSummary_Clear: unsafe extern "C" fn(this: *mut IMTDatasetSummary) -> MTAPIRES,
    pub IMTDatasetSummary_ColumnID1:
        unsafe extern "C" fn(this: *mut IMTDatasetSummary, column_id: UINT) -> MTAPIRES,
    pub IMTDatasetSummary_ColumnID: unsafe extern "C" fn(this: *const IMTDatasetSummary) -> UINT,
    pub IMTDatasetSummary_Line1:
        unsafe extern "C" fn(this: *mut IMTDatasetSummary, line: UINT) -> MTAPIRES,
    pub IMTDatasetSummary_Line: unsafe extern "C" fn(this: *const IMTDatasetSummary) -> UINT,
    pub IMTDatasetSummary_MergeColumn1:
        unsafe extern "C" fn(this: *mut IMTDatasetSummary, column_id: UINT) -> MTAPIRES,
    pub IMTDatasetSummary_MergeColumn: unsafe extern "C" fn(this: *const IMTDatasetSummary) -> UINT,
    pub IMTDatasetSummary_Color1:
        unsafe extern "C" fn(this: *mut IMTDatasetSummary, color: UINT) -> MTAPIRES,
    pub IMTDatasetSummary_Color: unsafe extern "C" fn(this: *const IMTDatasetSummary) -> UINT,
    pub IMTDatasetSummary_Flags1:
        unsafe extern "C" fn(this: *mut IMTDatasetSummary, flags: UINT64) -> MTAPIRES,
    pub IMTDatasetSummary_Flags: unsafe extern "C" fn(this: *const IMTDatasetSummary) -> UINT64,
    pub IMTDatasetSummary_Type: unsafe extern "C" fn(this: *const IMTDatasetSummary) -> UINT,
    pub IMTDatasetSummary_Digits1:
        unsafe extern "C" fn(this: *mut IMTDatasetSummary, digits: UINT) -> MTAPIRES,
    pub IMTDatasetSummary_Digits: unsafe extern "C" fn(this: *const IMTDatasetSummary) -> UINT,
    pub IMTDatasetSummary_ValueInt1:
        unsafe extern "C" fn(this: *mut IMTDatasetSummary, value: INT64) -> MTAPIRES,
    pub IMTDatasetSummary_ValueInt: unsafe extern "C" fn(this: *const IMTDatasetSummary) -> INT64,
    pub IMTDatasetSummary_ValueUInt1:
        unsafe extern "C" fn(this: *mut IMTDatasetSummary, value: UINT64) -> MTAPIRES,
    pub IMTDatasetSummary_ValueUInt: unsafe extern "C" fn(this: *const IMTDatasetSummary) -> UINT64,
    pub IMTDatasetSummary_ValueDouble1:
        unsafe extern "C" fn(this: *mut IMTDatasetSummary, value: f64) -> MTAPIRES,
    pub IMTDatasetSummary_ValueDouble: unsafe extern "C" fn(this: *const IMTDatasetSummary) -> f64,
    pub IMTDatasetSummary_ValueMoney1:
        unsafe extern "C" fn(this: *mut IMTDatasetSummary, value: f64) -> MTAPIRES,
    pub IMTDatasetSummary_ValueMoney: unsafe extern "C" fn(this: *const IMTDatasetSummary) -> f64,
    pub IMTDatasetSummary_ValueString1:
        unsafe extern "C" fn(this: *mut IMTDatasetSummary, value: LPCWSTR) -> MTAPIRES,
    pub IMTDatasetSummary_ValueString:
        unsafe extern "C" fn(this: *const IMTDatasetSummary) -> LPCWSTR,
    pub IMTDatasetSummary_ValueDate1:
        unsafe extern "C" fn(this: *mut IMTDatasetSummary, value: INT64) -> MTAPIRES,
    pub IMTDatasetSummary_ValueDate: unsafe extern "C" fn(this: *const IMTDatasetSummary) -> INT64,
    pub IMTDatasetSummary_ValueTime1:
        unsafe extern "C" fn(this: *mut IMTDatasetSummary, value: INT64) -> MTAPIRES,
    pub IMTDatasetSummary_ValueTime: unsafe extern "C" fn(this: *const IMTDatasetSummary) -> INT64,
    pub IMTDatasetSummary_ValueDateTime1:
        unsafe extern "C" fn(this: *mut IMTDatasetSummary, value: INT64) -> MTAPIRES,
    pub IMTDatasetSummary_ValueDateTime:
        unsafe extern "C" fn(this: *const IMTDatasetSummary) -> INT64,
        pub IMTDatasetSummary_ValuePrice1:
        unsafe extern "C" fn(this: *mut IMTDatasetSummary, value: f64) -> MTAPIRES,
    pub IMTDatasetSummary_ValuePrice: unsafe extern "C" fn(this: *const IMTDatasetSummary) -> f64,
    pub IMTDatasetSummary_ValuePricesBid:
        unsafe extern "C" fn(this: *const IMTDatasetSummary) -> f64,
    pub IMTDatasetSummary_ValuePricesAsk:
        unsafe extern "C" fn(this: *const IMTDatasetSummary) -> f64,
    pub IMTDatasetSummary_ValuePrices: unsafe extern "C" fn(
        this: *mut IMTDatasetSummary,
        value_bid: f64,
        value_ask: f64,
    ) -> MTAPIRES,
    pub IMTDatasetSummary_ValueVolume2: unsafe extern "C" fn(
        this: *mut IMTDatasetSummary,
        value_initial: UINT64,
        value_current: UINT64,
    ) -> MTAPIRES,
    pub IMTDatasetSummary_ValueVolume1:
        unsafe extern "C" fn(this: *mut IMTDatasetSummary, value: UINT64) -> MTAPIRES,
    pub IMTDatasetSummary_ValueVolume:
        unsafe extern "C" fn(this: *const IMTDatasetSummary) -> UINT64,
    pub IMTDatasetSummary_ValueVolumeInitial:
        unsafe extern "C" fn(this: *const IMTDatasetSummary) -> UINT64,
    pub IMTDatasetSummary_ValueVolumeCurrent:
        unsafe extern "C" fn(this: *const IMTDatasetSummary) -> UINT64,
    pub IMTDatasetSummary_ValueVolumeExt1:
        unsafe extern "C" fn(this: *mut IMTDatasetSummary, value: UINT64) -> MTAPIRES,
    pub IMTDatasetSummary_ValueVolumeExt:
        unsafe extern "C" fn(this: *const IMTDatasetSummary) -> UINT64,
    pub IMTDatasetSummary_ValueVolumeExtInitial:
        unsafe extern "C" fn(this: *const IMTDatasetSummary) -> UINT64,
    pub IMTDatasetSummary_ValueVolumeExtCurrent:
        unsafe extern "C" fn(this: *const IMTDatasetSummary) -> UINT64,
    pub IMTDatasetSummary_ValueVolumeExt2: unsafe extern "C" fn(
        this: *mut IMTDatasetSummary,
        value_initial: UINT64,
        value_current: UINT64,
    ) -> MTAPIRES,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTDatasetSummary {
    pub vtable_: *const IMTDatasetSummary__bindgen_vtable,
}
pub const IMTDatasetSummary_EnType_TYPE_INT: IMTDatasetSummary_EnType = 0;
pub const IMTDatasetSummary_EnType_TYPE_UINT: IMTDatasetSummary_EnType = 1;
pub const IMTDatasetSummary_EnType_TYPE_DOUBLE: IMTDatasetSummary_EnType = 2;
pub const IMTDatasetSummary_EnType_TYPE_MONEY: IMTDatasetSummary_EnType = 3;
pub const IMTDatasetSummary_EnType_TYPE_STRING: IMTDatasetSummary_EnType = 4;
pub const IMTDatasetSummary_EnType_TYPE_DATE: IMTDatasetSummary_EnType = 5;
pub const IMTDatasetSummary_EnType_TYPE_TIME: IMTDatasetSummary_EnType = 6;
pub const IMTDatasetSummary_EnType_TYPE_DATETIME: IMTDatasetSummary_EnType = 7;
pub const IMTDatasetSummary_EnType_TYPE_PRICE: IMTDatasetSummary_EnType = 100;
pub const IMTDatasetSummary_EnType_TYPE_PRICES: IMTDatasetSummary_EnType = 101;
pub const IMTDatasetSummary_EnType_TYPE_VOLUME: IMTDatasetSummary_EnType = 200;
pub const IMTDatasetSummary_EnType_TYPE_VOLUME_ORDER: IMTDatasetSummary_EnType = 201;
pub const IMTDatasetSummary_EnType_TYPE_VOLUME_EXT: IMTDatasetSummary_EnType = 202;
pub const IMTDatasetSummary_EnType_TYPE_VOLUME_ORDER_EXT: IMTDatasetSummary_EnType = 203;
pub const IMTDatasetSummary_EnType_TYPE_FIRST: IMTDatasetSummary_EnType = 0;
pub const IMTDatasetSummary_EnType_TYPE_LAST: IMTDatasetSummary_EnType = 203;
pub type IMTDatasetSummary_EnType = ::std::os::raw::c_int;
pub const IMTDatasetSummary_EnFlags_FLAG_NONE: IMTDatasetSummary_EnFlags = 0;
pub type IMTDatasetSummary_EnFlags = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTDatasetSummary"][::std::mem::size_of::<IMTDatasetSummary>() - 8usize];
    ["Alignment of IMTDatasetSummary"][::std::mem::align_of::<IMTDatasetSummary>() - 8usize];
};
#[repr(C)]
pub struct IMTDataset__bindgen_vtable {
    pub IMTDataset_Assign:
        unsafe extern "C" fn(this: *mut IMTDataset, data: *const IMTDataset) -> MTAPIRES,
    pub IMTDataset_Clear: unsafe extern "C" fn(this: *mut IMTDataset) -> MTAPIRES,
    pub IMTDataset_Flags1: unsafe extern "C" fn(this: *mut IMTDataset, flags: UINT64) -> MTAPIRES,
    pub IMTDataset_Flags: unsafe extern "C" fn(this: *const IMTDataset) -> UINT64,
    pub IMTDataset_Reserved1: unsafe extern "C" fn(this: *mut IMTDataset) -> MTAPIRES,
    pub IMTDataset_Reserved2: unsafe extern "C" fn(this: *mut IMTDataset) -> MTAPIRES,
    pub IMTDataset_Reserved3: unsafe extern "C" fn(this: *mut IMTDataset) -> MTAPIRES,
    pub IMTDataset_Reserved4: unsafe extern "C" fn(this: *mut IMTDataset) -> MTAPIRES,
    pub IMTDataset_ColumnCreate:
        unsafe extern "C" fn(this: *mut IMTDataset) -> *mut IMTDatasetColumn,
    pub IMTDataset_ColumnClear: unsafe extern "C" fn(this: *mut IMTDataset) -> MTAPIRES,
    pub IMTDataset_ColumnAdd:
        unsafe extern "C" fn(this: *mut IMTDataset, column: *const IMTDatasetColumn) -> MTAPIRES,
    pub IMTDataset_ColumnDelete: unsafe extern "C" fn(this: *mut IMTDataset, pos: UINT) -> MTAPIRES,
    pub IMTDataset_ColumnTotal: unsafe extern "C" fn(this: *const IMTDataset) -> UINT,
    pub IMTDataset_ColumnSize: unsafe extern "C" fn(this: *const IMTDataset) -> UINT,
    pub IMTDataset_ColumnNext: unsafe extern "C" fn(
        this: *mut IMTDataset,
        pos: UINT,
        column: *mut IMTDatasetColumn,
    ) -> MTAPIRES,
    pub IMTDataset_ColumnReserved1: unsafe extern "C" fn(this: *mut IMTDataset) -> MTAPIRES,
    pub IMTDataset_ColumnReserved2: unsafe extern "C" fn(this: *mut IMTDataset) -> MTAPIRES,
    pub IMTDataset_RowClear: unsafe extern "C" fn(this: *mut IMTDataset) -> MTAPIRES,
    pub IMTDataset_RowWrite: unsafe extern "C" fn(
        this: *mut IMTDataset,
        data: *const ::std::os::raw::c_void,
        size: UINT,
    ) -> MTAPIRES,
    pub IMTDataset_RowTotal: unsafe extern "C" fn(this: *const IMTDataset) -> UINT,
    pub IMTDataset_RowRead: unsafe extern "C" fn(
        this: *const IMTDataset,
        pos: UINT,
        data: *mut ::std::os::raw::c_void,
        size: UINT,
    ) -> MTAPIRES,
    pub IMTDataset_RowReserved2: unsafe extern "C" fn(this: *mut IMTDataset) -> MTAPIRES,
    pub IMTDataset_SummaryCreate:
        unsafe extern "C" fn(this: *mut IMTDataset) -> *mut IMTDatasetSummary,
    pub IMTDataset_SummaryClear: unsafe extern "C" fn(this: *mut IMTDataset) -> MTAPIRES,
    pub IMTDataset_SummaryAdd:
        unsafe extern "C" fn(this: *mut IMTDataset, summary: *const IMTDatasetSummary) -> MTAPIRES,
    pub IMTDataset_SummaryDelete:
        unsafe extern "C" fn(this: *mut IMTDataset, pos: UINT) -> MTAPIRES,
    pub IMTDataset_SummaryNext: unsafe extern "C" fn(
        this: *mut IMTDataset,
        pos: UINT,
        summary: *mut IMTDatasetSummary,
    ) -> MTAPIRES,
    pub IMTDataset_SummaryTotal: unsafe extern "C" fn(this: *const IMTDataset) -> UINT,
    pub IMTDataset_SummaryReserved1: unsafe extern "C" fn(this: *mut IMTDataset) -> MTAPIRES,
    pub IMTDataset_SummaryReserved2: unsafe extern "C" fn(this: *mut IMTDataset) -> MTAPIRES,
    pub IMTDataset_Release: unsafe extern "C" fn(this: *mut IMTDataset),
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTDataset {
    pub vtable_: *const IMTDataset__bindgen_vtable,
}
pub const IMTDataset_EnDataSetFlags_DATASET_FLAG_NONE: IMTDataset_EnDataSetFlags = 0;
pub type IMTDataset_EnDataSetFlags = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTDataset"][::std::mem::size_of::<IMTDataset>() - 8usize];
    ["Alignment of IMTDataset"][::std::mem::align_of::<IMTDataset>() - 8usize];
};
#[repr(C)]
pub struct IMTDatasetField__bindgen_vtable {
    pub IMTDatasetField_Release: unsafe extern "C" fn(this: *mut IMTDatasetField),
    pub IMTDatasetField_Assign:
        unsafe extern "C" fn(this: *mut IMTDatasetField, field: *const IMTDatasetField) -> MTAPIRES,
    pub IMTDatasetField_Clear: unsafe extern "C" fn(this: *mut IMTDatasetField) -> MTAPIRES,
    pub IMTDatasetField_Id1: unsafe extern "C" fn(this: *mut IMTDatasetField, id: UINT) -> MTAPIRES,
    pub IMTDatasetField_Id: unsafe extern "C" fn(this: *const IMTDatasetField) -> UINT,
    pub IMTDatasetField_Type: unsafe extern "C" fn(this: *const IMTDatasetField) -> UINT,
    pub IMTDatasetField_Offset1:
        unsafe extern "C" fn(this: *mut IMTDatasetField, offset: UINT) -> MTAPIRES,
    pub IMTDatasetField_Offset: unsafe extern "C" fn(this: *const IMTDatasetField) -> UINT,
    pub IMTDatasetField_Size1:
        unsafe extern "C" fn(this: *mut IMTDatasetField, size: UINT) -> MTAPIRES,
    pub IMTDatasetField_Size: unsafe extern "C" fn(this: *const IMTDatasetField) -> UINT,
    pub IMTDatasetField_Flags1:
        unsafe extern "C" fn(this: *mut IMTDatasetField, flags: UINT64) -> MTAPIRES,
    pub IMTDatasetField_Flags: unsafe extern "C" fn(this: *const IMTDatasetField) -> UINT64,
    pub IMTDatasetField_Reserved1: unsafe extern "C" fn(this: *mut IMTDatasetField) -> MTAPIRES,
    pub IMTDatasetField_Reserved2: unsafe extern "C" fn(this: *mut IMTDatasetField) -> MTAPIRES,
    pub IMTDatasetField_Reserved3: unsafe extern "C" fn(this: *mut IMTDatasetField) -> MTAPIRES,
    pub IMTDatasetField_Reserved4: unsafe extern "C" fn(this: *mut IMTDatasetField) -> MTAPIRES,
    pub IMTDatasetField_WhereAddInt:
        unsafe extern "C" fn(this: *mut IMTDatasetField, value: INT64) -> MTAPIRES,
    pub IMTDatasetField_WhereAddIntArray: unsafe extern "C" fn(
        this: *mut IMTDatasetField,
        values: *const INT64,
        values_total: UINT,
    ) -> MTAPIRES,
    pub IMTDatasetField_WhereAddUInt:
        unsafe extern "C" fn(this: *mut IMTDatasetField, value: UINT64) -> MTAPIRES,
    pub IMTDatasetField_WhereAddUIntArray: unsafe extern "C" fn(
        this: *mut IMTDatasetField,
        values: *const UINT64,
        values_total: UINT,
    ) -> MTAPIRES,
    pub IMTDatasetField_WhereAddDouble:
        unsafe extern "C" fn(this: *mut IMTDatasetField, value: f64) -> MTAPIRES,
    pub IMTDatasetField_WhereAddDoubleArray: unsafe extern "C" fn(
        this: *mut IMTDatasetField,
        values: *const f64,
        values_total: UINT,
    ) -> MTAPIRES,
    pub IMTDatasetField_WhereAddString:
        unsafe extern "C" fn(this: *mut IMTDatasetField, value: LPCWSTR) -> MTAPIRES,
    pub IMTDatasetField_WhereAddStringArray: unsafe extern "C" fn(
        this: *mut IMTDatasetField,
        values: *mut LPCWSTR,
        values_total: UINT,
    ) -> MTAPIRES,
    pub IMTDatasetField_WhereUIntSet: unsafe extern "C" fn(
        this: *mut IMTDatasetField,
        values: *const UINT64,
        values_total: UINT,
    ) -> MTAPIRES,
    pub IMTDatasetField_WhereReserved1:
        unsafe extern "C" fn(this: *mut IMTDatasetField) -> MTAPIRES,
    pub IMTDatasetField_WhereReserved2:
        unsafe extern "C" fn(this: *mut IMTDatasetField) -> MTAPIRES,
    pub IMTDatasetField_WhereReserved3:
        unsafe extern "C" fn(this: *mut IMTDatasetField) -> MTAPIRES,
    pub IMTDatasetField_BetweenInt:
        unsafe extern "C" fn(this: *mut IMTDatasetField, from: INT64, to: INT64) -> MTAPIRES,
    pub IMTDatasetField_BetweenUInt:
        unsafe extern "C" fn(this: *mut IMTDatasetField, from: UINT64, to: UINT64) -> MTAPIRES,
    pub IMTDatasetField_BetweenDouble:
        unsafe extern "C" fn(this: *mut IMTDatasetField, from: f64, to: f64) -> MTAPIRES,
    pub IMTDatasetField_BetweenReserved1:
        unsafe extern "C" fn(this: *mut IMTDatasetField) -> MTAPIRES,
    pub IMTDatasetField_BetweenReserved2:
        unsafe extern "C" fn(this: *mut IMTDatasetField) -> MTAPIRES,
    pub IMTDatasetField_BetweenReserved3:
        unsafe extern "C" fn(this: *mut IMTDatasetField) -> MTAPIRES,
    pub IMTDatasetField_BetweenReserved4:
        unsafe extern "C" fn(this: *mut IMTDatasetField) -> MTAPIRES,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTDatasetField {
    pub vtable_: *const IMTDatasetField__bindgen_vtable,
}
pub const IMTDatasetField_EnFieldType_TYPE_NONE: IMTDatasetField_EnFieldType = 0;
pub const IMTDatasetField_EnFieldType_TYPE_INT: IMTDatasetField_EnFieldType = 1;
pub const IMTDatasetField_EnFieldType_TYPE_UINT: IMTDatasetField_EnFieldType = 2;
pub const IMTDatasetField_EnFieldType_TYPE_DOUBLE: IMTDatasetField_EnFieldType = 3;
pub const IMTDatasetField_EnFieldType_TYPE_STRING: IMTDatasetField_EnFieldType = 4;
pub const IMTDatasetField_EnFieldType_TYPE_FIRST: IMTDatasetField_EnFieldType = 0;
pub const IMTDatasetField_EnFieldType_TYPE_LAST: IMTDatasetField_EnFieldType = 4;
pub type IMTDatasetField_EnFieldType = ::std::os::raw::c_int;
pub const IMTDatasetField_EnFieldId_FIELD_USER_LOGIN: IMTDatasetField_EnFieldId = 1;
pub const IMTDatasetField_EnFieldId_FIELD_USER_GROUP: IMTDatasetField_EnFieldId = 2;
pub const IMTDatasetField_EnFieldId_FIELD_USER_CERT_SERIAL_NUMBER: IMTDatasetField_EnFieldId = 3;
pub const IMTDatasetField_EnFieldId_FIELD_USER_RIGHTS: IMTDatasetField_EnFieldId = 4;
pub const IMTDatasetField_EnFieldId_FIELD_USER_REGISTRATION: IMTDatasetField_EnFieldId = 5;
pub const IMTDatasetField_EnFieldId_FIELD_USER_LAST_ACCESS: IMTDatasetField_EnFieldId = 6;
pub const IMTDatasetField_EnFieldId_FIELD_USER_NAME: IMTDatasetField_EnFieldId = 7;
pub const IMTDatasetField_EnFieldId_FIELD_USER_COMPANY: IMTDatasetField_EnFieldId = 8;
pub const IMTDatasetField_EnFieldId_FIELD_USER_ACCOUNT: IMTDatasetField_EnFieldId = 9;
pub const IMTDatasetField_EnFieldId_FIELD_USER_COUNTRY: IMTDatasetField_EnFieldId = 10;
pub const IMTDatasetField_EnFieldId_FIELD_USER_LANGUAGE: IMTDatasetField_EnFieldId = 11;
pub const IMTDatasetField_EnFieldId_FIELD_USER_CITY: IMTDatasetField_EnFieldId = 12;
pub const IMTDatasetField_EnFieldId_FIELD_USER_STATE: IMTDatasetField_EnFieldId = 13;
pub const IMTDatasetField_EnFieldId_FIELD_USER_ZIP_CODE: IMTDatasetField_EnFieldId = 14;
pub const IMTDatasetField_EnFieldId_FIELD_USER_ADDRESS: IMTDatasetField_EnFieldId = 15;
pub const IMTDatasetField_EnFieldId_FIELD_USER_PHONE: IMTDatasetField_EnFieldId = 16;
pub const IMTDatasetField_EnFieldId_FIELD_USER_EMAIL: IMTDatasetField_EnFieldId = 17;
pub const IMTDatasetField_EnFieldId_FIELD_USER_ID: IMTDatasetField_EnFieldId = 18;
pub const IMTDatasetField_EnFieldId_FIELD_USER_STATUS: IMTDatasetField_EnFieldId = 19;
pub const IMTDatasetField_EnFieldId_FIELD_USER_COMMENT: IMTDatasetField_EnFieldId = 20;
pub const IMTDatasetField_EnFieldId_FIELD_USER_COLOR: IMTDatasetField_EnFieldId = 21;
pub const IMTDatasetField_EnFieldId_FIELD_USER_PHONE_PASSWORD: IMTDatasetField_EnFieldId = 22;
pub const IMTDatasetField_EnFieldId_FIELD_USER_LEVERAGE: IMTDatasetField_EnFieldId = 23;
pub const IMTDatasetField_EnFieldId_FIELD_USER_AGENT: IMTDatasetField_EnFieldId = 24;
pub const IMTDatasetField_EnFieldId_FIELD_USER_BALANCE: IMTDatasetField_EnFieldId = 25;
pub const IMTDatasetField_EnFieldId_FIELD_USER_CREDIT: IMTDatasetField_EnFieldId = 26;
pub const IMTDatasetField_EnFieldId_FIELD_USER_INTEREST_RATE: IMTDatasetField_EnFieldId = 27;
pub const IMTDatasetField_EnFieldId_FIELD_USER_COMMISSION_DAILY: IMTDatasetField_EnFieldId = 28;
pub const IMTDatasetField_EnFieldId_FIELD_USER_COMMISSION_MONTHLY: IMTDatasetField_EnFieldId = 29;
pub const IMTDatasetField_EnFieldId_FIELD_USER_COMMISSION_AGENT_DAILY: IMTDatasetField_EnFieldId =
    30;
pub const IMTDatasetField_EnFieldId_FIELD_USER_COMMISSION_AGENT_MONTHLY: IMTDatasetField_EnFieldId =
    31;
pub const IMTDatasetField_EnFieldId_FIELD_USER_BALANCE_PREV_DAY: IMTDatasetField_EnFieldId = 32;
pub const IMTDatasetField_EnFieldId_FIELD_USER_BALANCE_PREV_MONTH: IMTDatasetField_EnFieldId = 33;
pub const IMTDatasetField_EnFieldId_FIELD_USER_EQUITY_PREV_DAY: IMTDatasetField_EnFieldId = 34;
pub const IMTDatasetField_EnFieldId_FIELD_USER_EQUITY_PREV_MONTH: IMTDatasetField_EnFieldId = 35;
pub const IMTDatasetField_EnFieldId_FIELD_USER_LAST_PASS_CHANGE: IMTDatasetField_EnFieldId = 36;
pub const IMTDatasetField_EnFieldId_FIELD_USER_MQID: IMTDatasetField_EnFieldId = 37;
pub const IMTDatasetField_EnFieldId_FIELD_USER_LEAD_CAMPAIGN: IMTDatasetField_EnFieldId = 38;
pub const IMTDatasetField_EnFieldId_FIELD_USER_LEAD_SOURCE: IMTDatasetField_EnFieldId = 39;
pub const IMTDatasetField_EnFieldId_FIELD_USER_CLIENT_ID: IMTDatasetField_EnFieldId = 40;
pub const IMTDatasetField_EnFieldId_FIELD_USER_FIRST_NAME: IMTDatasetField_EnFieldId = 41;
pub const IMTDatasetField_EnFieldId_FIELD_USER_LAST_NAME: IMTDatasetField_EnFieldId = 42;
pub const IMTDatasetField_EnFieldId_FIELD_USER_MIDDLE_NAME: IMTDatasetField_EnFieldId = 43;
pub const IMTDatasetField_EnFieldId_FIELD_USER_FIRST: IMTDatasetField_EnFieldId = 1;
pub const IMTDatasetField_EnFieldId_FIELD_USER_LAST: IMTDatasetField_EnFieldId = 43;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_ID: IMTDatasetField_EnFieldId = 1001;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_CREATED_TIME: IMTDatasetField_EnFieldId = 1002;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_CREATED_BY: IMTDatasetField_EnFieldId = 1003;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_MODIFIED_TIME: IMTDatasetField_EnFieldId = 1004;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_MODIFIED_BY: IMTDatasetField_EnFieldId = 1005;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_TYPE: IMTDatasetField_EnFieldId = 1006;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_STATUS: IMTDatasetField_EnFieldId = 1007;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_ASSIGNED_MANAGER: IMTDatasetField_EnFieldId = 1008;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_COMMENT: IMTDatasetField_EnFieldId = 1009;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_COMPLIANCE_APPROVED_BY: IMTDatasetField_EnFieldId =
    1010;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_COMPLIANCE_CLIENT_CATEGORY:
    IMTDatasetField_EnFieldId = 1011;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_COMPLIANCE_TIME_APPROVAL:
    IMTDatasetField_EnFieldId = 1012;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_COMPLIANCE_TIME_TERMINATION:
    IMTDatasetField_EnFieldId = 1013;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_LEAD_CAMPAIGN: IMTDatasetField_EnFieldId = 1014;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_LEAD_SOURCE: IMTDatasetField_EnFieldId = 1015;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_INTRODUCER: IMTDatasetField_EnFieldId = 1016;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_PERSON_TITLE: IMTDatasetField_EnFieldId = 1017;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_PERSON_NAME: IMTDatasetField_EnFieldId = 1018;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_PERSON_MIDDLE_NAME: IMTDatasetField_EnFieldId =
    1019;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_PERSON_LAST_NAME: IMTDatasetField_EnFieldId = 1020;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_PERSON_BIRTH_DATE: IMTDatasetField_EnFieldId =
    1021;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_PERSON_CITIZENSHIP: IMTDatasetField_EnFieldId =
    1022;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_PERSON_GENDER: IMTDatasetField_EnFieldId = 1023;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_PERSON_TAX_ID: IMTDatasetField_EnFieldId = 1024;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_PERSON_DOCUMENT_TYPE: IMTDatasetField_EnFieldId =
    1025;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_PERSON_DOCUMENT_NUMBER: IMTDatasetField_EnFieldId =
    1026;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_PERSON_DOCUMENT_DATE: IMTDatasetField_EnFieldId =
    1027;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_PERSON_DOCUMENT_EXTRA: IMTDatasetField_EnFieldId =
    1028;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_PERSON_EMPLOYMENT: IMTDatasetField_EnFieldId =
    1029;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_PERSON_INDUSTRY: IMTDatasetField_EnFieldId = 1030;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_PERSON_EDUCATION: IMTDatasetField_EnFieldId = 1031;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_PERSON_WEALTH_SOURCE: IMTDatasetField_EnFieldId =
    1032;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_PERSON_ANNUAL_INCOME: IMTDatasetField_EnFieldId =
    1033;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_PERSON_NET_WORTH: IMTDatasetField_EnFieldId = 1034;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_PERSON_ANNUAL_DEPOSIT: IMTDatasetField_EnFieldId =
    1035;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_COMPANY_NAME: IMTDatasetField_EnFieldId = 1036;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_COMPANY_REG_NUMBER: IMTDatasetField_EnFieldId =
    1037;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_COMPANY_REG_DATE: IMTDatasetField_EnFieldId = 1038;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_COMPANY_REG_AUTHORITY: IMTDatasetField_EnFieldId =
    1039;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_COMPANY_VAT: IMTDatasetField_EnFieldId = 1040;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_COMPANY_LEI: IMTDatasetField_EnFieldId = 1041;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_COMPANY_LICENSE_NUMBER: IMTDatasetField_EnFieldId =
    1042;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_COMPANY_LICENSE_AUTHORITY:
    IMTDatasetField_EnFieldId = 1043;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_COMPANY_COUNTRY: IMTDatasetField_EnFieldId = 1044;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_COMPANY_ADDRESS: IMTDatasetField_EnFieldId = 1045;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_COMPANY_WEBSITE: IMTDatasetField_EnFieldId = 1046;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_CONTACT_PREFERRED: IMTDatasetField_EnFieldId =
    1047;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_CONTACT_LANGUAGE: IMTDatasetField_EnFieldId = 1048;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_CONTACT_EMAIL: IMTDatasetField_EnFieldId = 1049;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_CONTACT_PHONE: IMTDatasetField_EnFieldId = 1050;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_CONTACT_MESSENGERS: IMTDatasetField_EnFieldId =
    1051;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_CONTACT_SOCIALNETWORKS: IMTDatasetField_EnFieldId =
    1052;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_CONTACT_LAST_DATE: IMTDatasetField_EnFieldId =
    1053;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_ADDRESS_COUNTRY: IMTDatasetField_EnFieldId = 1054;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_ADDRESS_POSTCODE: IMTDatasetField_EnFieldId = 1055;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_ADDRESS_STREET: IMTDatasetField_EnFieldId = 1056;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_ADDRESS_STATE: IMTDatasetField_EnFieldId = 1057;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_ADDRESS_CITY: IMTDatasetField_EnFieldId = 1058;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_EXPERIENCE_FX: IMTDatasetField_EnFieldId = 1059;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_EXPERIENCE_CFD: IMTDatasetField_EnFieldId = 1060;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_EXPERIENCE_FUTURES: IMTDatasetField_EnFieldId =
    1061;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_EXPERIENCE_STOCKS: IMTDatasetField_EnFieldId =
    1062;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_FIRST: IMTDatasetField_EnFieldId = 1001;
pub const IMTDatasetField_EnFieldId_FIELD_CLIENT_LAST: IMTDatasetField_EnFieldId = 1062;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_DEAL: IMTDatasetField_EnFieldId = 2001;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_EXTERNAL_ID: IMTDatasetField_EnFieldId = 2002;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_LOGIN: IMTDatasetField_EnFieldId = 2003;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_DEALER: IMTDatasetField_EnFieldId = 2004;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_ORDER: IMTDatasetField_EnFieldId = 2005;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_ACTION: IMTDatasetField_EnFieldId = 2006;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_ENTRY: IMTDatasetField_EnFieldId = 2007;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_DIGITS: IMTDatasetField_EnFieldId = 2008;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_DIGITS_CURRENCY: IMTDatasetField_EnFieldId = 2009;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_CONTRACT_SIZE: IMTDatasetField_EnFieldId = 2010;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_TIME: IMTDatasetField_EnFieldId = 2011;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_SYMBOL: IMTDatasetField_EnFieldId = 2012;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_PRICE: IMTDatasetField_EnFieldId = 2013;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_VOLUME_EXT: IMTDatasetField_EnFieldId = 2014;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_PROFIT: IMTDatasetField_EnFieldId = 2015;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_STORAGE: IMTDatasetField_EnFieldId = 2016;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_COMMISSION: IMTDatasetField_EnFieldId = 2017;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_RATE_PROFIT: IMTDatasetField_EnFieldId = 2018;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_RATE_MARGIN: IMTDatasetField_EnFieldId = 2019;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_EXPERT_ID: IMTDatasetField_EnFieldId = 2020;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_POSITION_ID: IMTDatasetField_EnFieldId = 2021;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_COMMENT: IMTDatasetField_EnFieldId = 2022;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_PROFIT_RAW: IMTDatasetField_EnFieldId = 2023;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_PRICE_POSITION: IMTDatasetField_EnFieldId = 2024;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_VOLUME_CLOSED_EXT: IMTDatasetField_EnFieldId = 2025;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_TICK_VALUE: IMTDatasetField_EnFieldId = 2026;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_TICK_SIZE: IMTDatasetField_EnFieldId = 2027;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_FLAGS: IMTDatasetField_EnFieldId = 2028;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_TIME_MSC: IMTDatasetField_EnFieldId = 2029;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_REASON: IMTDatasetField_EnFieldId = 2030;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_GATEWAY: IMTDatasetField_EnFieldId = 2031;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_PRICE_GATEWAY: IMTDatasetField_EnFieldId = 2032;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_MODIFICATION_FLAGS: IMTDatasetField_EnFieldId = 2033;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_PRICE_SL: IMTDatasetField_EnFieldId = 2034;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_PRICE_TP: IMTDatasetField_EnFieldId = 2035;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_FEE: IMTDatasetField_EnFieldId = 2036;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_VALUE: IMTDatasetField_EnFieldId = 2037;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_FIRST: IMTDatasetField_EnFieldId = 2001;
pub const IMTDatasetField_EnFieldId_FIELD_DEAL_LAST: IMTDatasetField_EnFieldId = 2037;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_ORDER: IMTDatasetField_EnFieldId = 3001;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_EXTERNAL_ID: IMTDatasetField_EnFieldId = 3002;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_LOGIN: IMTDatasetField_EnFieldId = 3003;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_DEALER: IMTDatasetField_EnFieldId = 3004;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_SYMBOL: IMTDatasetField_EnFieldId = 3005;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_TIME_SETUP: IMTDatasetField_EnFieldId = 3006;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_TIME_EXPIRATION: IMTDatasetField_EnFieldId = 3007;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_TIME_DONE: IMTDatasetField_EnFieldId = 3008;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_TYPE: IMTDatasetField_EnFieldId = 3009;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_TYPE_FILL: IMTDatasetField_EnFieldId = 3010;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_TYPE_TIME: IMTDatasetField_EnFieldId = 3011;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_TYPE_REASON: IMTDatasetField_EnFieldId = 3012;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_PRICE_ORDER: IMTDatasetField_EnFieldId = 3013;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_PRICE_TRIGGER: IMTDatasetField_EnFieldId = 3014;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_PRICE_CURRENT: IMTDatasetField_EnFieldId = 3015;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_PRICE_SL: IMTDatasetField_EnFieldId = 3016;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_PRICE_TP: IMTDatasetField_EnFieldId = 3017;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_VOLUME_INITIAL: IMTDatasetField_EnFieldId = 3018;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_VOLUME_CURRENT: IMTDatasetField_EnFieldId = 3019;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_STATE: IMTDatasetField_EnFieldId = 3020;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_EXPERT_ID: IMTDatasetField_EnFieldId = 3021;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_POSITION_ID: IMTDatasetField_EnFieldId = 3022;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_COMMENT: IMTDatasetField_EnFieldId = 3023;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_CONTRACT_SIZE: IMTDatasetField_EnFieldId = 3024;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_DIGITS: IMTDatasetField_EnFieldId = 3025;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_DIGITS_CURRENCY: IMTDatasetField_EnFieldId = 3026;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_POSITION_BY_ID: IMTDatasetField_EnFieldId = 3027;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_MARGIN_RATE: IMTDatasetField_EnFieldId = 3028;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_TIME_SETUP_MSC: IMTDatasetField_EnFieldId = 3029;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_TIME_DONE_MSC: IMTDatasetField_EnFieldId = 3030;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_MODIFICATION_FLAGS: IMTDatasetField_EnFieldId =
    3031;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_ACTIVATION_MODE: IMTDatasetField_EnFieldId = 3032;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_ACTIVATION_TIME: IMTDatasetField_EnFieldId = 3033;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_ACTIVATION_PRICE: IMTDatasetField_EnFieldId = 3034;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_ACTIVATION_FLAGS: IMTDatasetField_EnFieldId = 3035;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_GROUP: IMTDatasetField_EnFieldId = 3036;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_FIRST: IMTDatasetField_EnFieldId = 3001;
pub const IMTDatasetField_EnFieldId_FIELD_ORDER_LAST: IMTDatasetField_EnFieldId = 3036;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_DATE_TIME: IMTDatasetField_EnFieldId = 4001;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_DATE_TIME_PREV: IMTDatasetField_EnFieldId = 4002;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_LOGIN: IMTDatasetField_EnFieldId = 4003;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_NAME: IMTDatasetField_EnFieldId = 4004;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_GROUP: IMTDatasetField_EnFieldId = 4005;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_CURRENCY: IMTDatasetField_EnFieldId = 4006;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_DIGITS_CURRENCY: IMTDatasetField_EnFieldId = 4007;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_COMPANY: IMTDatasetField_EnFieldId = 4008;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_EMAIL: IMTDatasetField_EnFieldId = 4009;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_BALANCE: IMTDatasetField_EnFieldId = 4010;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_CREDIT: IMTDatasetField_EnFieldId = 4011;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_INTEREST_RATE: IMTDatasetField_EnFieldId = 4012;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_COMMISSION_DAILY: IMTDatasetField_EnFieldId = 4013;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_COMMISSION_MONTHLY: IMTDatasetField_EnFieldId =
    4014;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_AGENT_DAILY: IMTDatasetField_EnFieldId = 4015;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_AGENT_MONTHLY: IMTDatasetField_EnFieldId = 4016;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_BALANCE_PREV_DAY: IMTDatasetField_EnFieldId = 4017;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_BALANCE_PREV_MONTH: IMTDatasetField_EnFieldId =
    4018;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_EQUITY_PREV_DAY: IMTDatasetField_EnFieldId = 4019;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_EQUITY_PREV_MONTH: IMTDatasetField_EnFieldId = 4020;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_MARGIN: IMTDatasetField_EnFieldId = 4021;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_MARGIN_FREE: IMTDatasetField_EnFieldId = 4022;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_MARGIN_LEVEL: IMTDatasetField_EnFieldId = 4023;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_MARGIN_LEVERAGE: IMTDatasetField_EnFieldId = 4024;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_PROFIT: IMTDatasetField_EnFieldId = 4025;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_PROFIT_STORAGE: IMTDatasetField_EnFieldId = 4026;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_PROFIT_COMMISSION: IMTDatasetField_EnFieldId = 4027;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_PROFIT_EQUITY: IMTDatasetField_EnFieldId = 4028;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_DAILY_PROFIT: IMTDatasetField_EnFieldId = 4029;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_DAILY_BALANCE: IMTDatasetField_EnFieldId = 4030;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_DAILY_CREDIT: IMTDatasetField_EnFieldId = 4031;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_DAILY_CHARGE: IMTDatasetField_EnFieldId = 4032;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_DAILY_CORRECTION: IMTDatasetField_EnFieldId = 4033;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_DAILY_BONUS: IMTDatasetField_EnFieldId = 4034;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_DAILY_STORAGE: IMTDatasetField_EnFieldId = 4035;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_DAILY_COMM_INSTANT: IMTDatasetField_EnFieldId =
    4036;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_DAILY_COMM_ROUND: IMTDatasetField_EnFieldId = 4037;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_DAILY_AGENT: IMTDatasetField_EnFieldId = 4038;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_DAILY_INTEREST: IMTDatasetField_EnFieldId = 4039;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_PROFIT_ASSETS: IMTDatasetField_EnFieldId = 4040;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_PROFIT_LIABILITIES: IMTDatasetField_EnFieldId =
    4041;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_FIRST: IMTDatasetField_EnFieldId = 4001;
pub const IMTDatasetField_EnFieldId_FIELD_DAILY_LAST: IMTDatasetField_EnFieldId = 4041;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_LOGIN: IMTDatasetField_EnFieldId = 5001;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_SYMBOL: IMTDatasetField_EnFieldId = 5002;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_ACTION: IMTDatasetField_EnFieldId = 5003;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_DIGITS: IMTDatasetField_EnFieldId = 5004;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_DIGITS_CURRENCY: IMTDatasetField_EnFieldId =
    5005;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_CONTRACT_SIZE: IMTDatasetField_EnFieldId = 5006;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_TIME_CREATE: IMTDatasetField_EnFieldId = 5007;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_TIME_UPDATE: IMTDatasetField_EnFieldId = 5008;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_PRICE_OPEN: IMTDatasetField_EnFieldId = 5009;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_PRICE_CURRENT: IMTDatasetField_EnFieldId = 5010;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_PRICE_SL: IMTDatasetField_EnFieldId = 5011;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_PRICE_TP: IMTDatasetField_EnFieldId = 5012;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_VOLUME: IMTDatasetField_EnFieldId = 5013;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_PROFIT: IMTDatasetField_EnFieldId = 5014;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_STORAGE: IMTDatasetField_EnFieldId = 5015;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_RATE_PROFIT: IMTDatasetField_EnFieldId = 5016;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_RATE_MARGIN: IMTDatasetField_EnFieldId = 5017;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_EXPERT_ID: IMTDatasetField_EnFieldId = 5018;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_EXPERT_POSITION_ID: IMTDatasetField_EnFieldId =
    5019;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_COMMENT: IMTDatasetField_EnFieldId = 5020;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_ACTIVATION_MODE: IMTDatasetField_EnFieldId =
    5021;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_ACTIVATION_TIME: IMTDatasetField_EnFieldId =
    5022;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_ACTIVATION_PRICE: IMTDatasetField_EnFieldId =
    5023;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_ACTIVATION_FLAGS: IMTDatasetField_EnFieldId =
    5024;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_TIME_CREATE_MSC: IMTDatasetField_EnFieldId =
    5025;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_TIME_UPDATE_MSC: IMTDatasetField_EnFieldId =
    5026;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_DEALER: IMTDatasetField_EnFieldId = 5027;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_POSITION: IMTDatasetField_EnFieldId = 5028;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_EXTERNAL_ID: IMTDatasetField_EnFieldId = 5029;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_MODIFICATION_FLAGS: IMTDatasetField_EnFieldId =
    5030;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_REASON: IMTDatasetField_EnFieldId = 5031;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_VOLUME_EXT: IMTDatasetField_EnFieldId = 5032;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_GROUP: IMTDatasetField_EnFieldId = 5033;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_FIRST: IMTDatasetField_EnFieldId = 5001;
pub const IMTDatasetField_EnFieldId_FIELD_POSITION_LAST: IMTDatasetField_EnFieldId = 5033;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_LOGIN: IMTDatasetField_EnFieldId = 6001;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_GROUP: IMTDatasetField_EnFieldId = 6002;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_CURRENCY_DIGITS: IMTDatasetField_EnFieldId = 6003;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_BALANCE: IMTDatasetField_EnFieldId = 6004;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_CREDIT: IMTDatasetField_EnFieldId = 6005;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_MARGIN: IMTDatasetField_EnFieldId = 6006;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_MARGIN_FREE: IMTDatasetField_EnFieldId = 6007;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_MARGIN_LEVEL: IMTDatasetField_EnFieldId = 6008;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_MARGIN_LEVERAGE: IMTDatasetField_EnFieldId = 6009;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_MARGIN_INITIAL: IMTDatasetField_EnFieldId = 6010;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_MARGIN_MAINTENANCE: IMTDatasetField_EnFieldId =
    6011;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_PROFIT: IMTDatasetField_EnFieldId = 6012;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_STORAGE: IMTDatasetField_EnFieldId = 6013;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_COMMISSION: IMTDatasetField_EnFieldId = 6014;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_FLOATING: IMTDatasetField_EnFieldId = 6015;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_EQUITY: IMTDatasetField_EnFieldId = 6016;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_BLOCKED_COMMISSION: IMTDatasetField_EnFieldId =
    6017;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_BLOCKED_PROFIT: IMTDatasetField_EnFieldId = 6018;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_ASSETS: IMTDatasetField_EnFieldId = 6019;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_LIABILITIES: IMTDatasetField_EnFieldId = 6020;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_STOP_OUT_ACTIVATION: IMTDatasetField_EnFieldId =
    6021;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_STOP_OUT_TIME: IMTDatasetField_EnFieldId = 6022;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_STOP_OUT_LEVEL: IMTDatasetField_EnFieldId = 6023;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_STOP_OUT_EQUITY: IMTDatasetField_EnFieldId = 6024;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_STOP_OUT_MARGIN: IMTDatasetField_EnFieldId = 6025;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_FIRST: IMTDatasetField_EnFieldId = 6001;
pub const IMTDatasetField_EnFieldId_FIELD_ACCOUNT_LAST: IMTDatasetField_EnFieldId = 6020;
pub const IMTDatasetField_EnFieldId_FIELD_FIRST: IMTDatasetField_EnFieldId = 1;
pub const IMTDatasetField_EnFieldId_FIELD_LAST: IMTDatasetField_EnFieldId = 6020;
pub type IMTDatasetField_EnFieldId = ::std::os::raw::c_int;
pub const IMTDatasetField_EnFieldFlags_FLAG_NONE: IMTDatasetField_EnFieldFlags = 0;
pub const IMTDatasetField_EnFieldFlags_FLAG_SELECT: IMTDatasetField_EnFieldFlags = 1;
pub const IMTDatasetField_EnFieldFlags_FLAG_DEFAULT: IMTDatasetField_EnFieldFlags = 1;
pub const IMTDatasetField_EnFieldFlags_FLAG_ALL: IMTDatasetField_EnFieldFlags = 1;
pub type IMTDatasetField_EnFieldFlags = ::std::os::raw::c_int;
pub const IMTDatasetField_EnGender_GENDER_UNSPECIFIED: IMTDatasetField_EnGender = 0;
pub const IMTDatasetField_EnGender_GENDER_MALE: IMTDatasetField_EnGender = 1;
pub const IMTDatasetField_EnGender_GENDER_FEMALE: IMTDatasetField_EnGender = 2;
pub const IMTDatasetField_EnGender_GENDER_FIRST: IMTDatasetField_EnGender = 0;
pub const IMTDatasetField_EnGender_GENDER_LAST: IMTDatasetField_EnGender = 2;
pub type IMTDatasetField_EnGender = ::std::os::raw::c_int;
pub const IMTDatasetField_EnClientType_CLIENT_TYPE_UNDEFINED: IMTDatasetField_EnClientType = 0;
pub const IMTDatasetField_EnClientType_CLIENT_TYPE_INDIVIDUAL: IMTDatasetField_EnClientType = 1;
pub const IMTDatasetField_EnClientType_CLIENT_TYPE_CORPORATE: IMTDatasetField_EnClientType = 2;
pub const IMTDatasetField_EnClientType_CLIENT_TYPE_FUND: IMTDatasetField_EnClientType = 3;
pub const IMTDatasetField_EnClientType_CLIENT_TYPE_FIRST: IMTDatasetField_EnClientType = 0;
pub const IMTDatasetField_EnClientType_CLIENT_TYPE_LAST: IMTDatasetField_EnClientType = 3;
pub type IMTDatasetField_EnClientType = ::std::os::raw::c_int;
pub const IMTDatasetField_EnClientStatus_CLIENT_STATUS_UNREGISTERED:
    IMTDatasetField_EnClientStatus = 0;
pub const IMTDatasetField_EnClientStatus_CLIENT_STATUS_REGISTERED: IMTDatasetField_EnClientStatus =
    100;
pub const IMTDatasetField_EnClientStatus_CLIENT_STATUS_NOTINTERESTED:
    IMTDatasetField_EnClientStatus = 200;
pub const IMTDatasetField_EnClientStatus_CLIENT_STATUS_APPLICATION_INCOMPLETED:
    IMTDatasetField_EnClientStatus = 300;
pub const IMTDatasetField_EnClientStatus_CLIENT_STATUS_APPLICATION_COMPLETED:
    IMTDatasetField_EnClientStatus = 400;
pub const IMTDatasetField_EnClientStatus_CLIENT_STATUS_APPLICATION_INFORMATION:
    IMTDatasetField_EnClientStatus = 500;
pub const IMTDatasetField_EnClientStatus_CLIENT_STATUS_APPLICATION_REJECTED:
    IMTDatasetField_EnClientStatus = 600;
pub const IMTDatasetField_EnClientStatus_CLIENT_STATUS_APPROVED: IMTDatasetField_EnClientStatus =
    700;
pub const IMTDatasetField_EnClientStatus_CLIENT_STATUS_FUNDED: IMTDatasetField_EnClientStatus = 800;
pub const IMTDatasetField_EnClientStatus_CLIENT_STATUS_ACTIVE: IMTDatasetField_EnClientStatus = 900;
pub const IMTDatasetField_EnClientStatus_CLIENT_STATUS_INACTIVE: IMTDatasetField_EnClientStatus =
    1000;
pub const IMTDatasetField_EnClientStatus_CLIENT_STATUS_SUSPENDED: IMTDatasetField_EnClientStatus =
    1100;
pub const IMTDatasetField_EnClientStatus_CLIENT_STATUS_CLOSED: IMTDatasetField_EnClientStatus =
    1200;
pub const IMTDatasetField_EnClientStatus_CLIENT_STATUS_TERMINATED: IMTDatasetField_EnClientStatus =
    1300;
pub const IMTDatasetField_EnClientStatus_CLIENT_STATUS_FIRST: IMTDatasetField_EnClientStatus = 0;
pub const IMTDatasetField_EnClientStatus_CLIENT_STATUS_LAST: IMTDatasetField_EnClientStatus = 1300;
pub type IMTDatasetField_EnClientStatus = ::std::os::raw::c_int;
pub const IMTDatasetField_EnEmployment_EMPLOY_UNEMPLOYED: IMTDatasetField_EnEmployment = 0;
pub const IMTDatasetField_EnEmployment_EMPLOY_EMPLOYED: IMTDatasetField_EnEmployment = 1;
pub const IMTDatasetField_EnEmployment_EMPLOY_SELF_EMPLOYED: IMTDatasetField_EnEmployment = 2;
pub const IMTDatasetField_EnEmployment_EMPLOY_RETIRED: IMTDatasetField_EnEmployment = 3;
pub const IMTDatasetField_EnEmployment_EMPLOY_STUDENT: IMTDatasetField_EnEmployment = 4;
pub const IMTDatasetField_EnEmployment_EMPLOY_OTHER: IMTDatasetField_EnEmployment = 5;
pub const IMTDatasetField_EnEmployment_EMPLOY_FIRST: IMTDatasetField_EnEmployment = 0;
pub const IMTDatasetField_EnEmployment_EMPLOY_LAST: IMTDatasetField_EnEmployment = 5;
pub type IMTDatasetField_EnEmployment = ::std::os::raw::c_int;
pub const IMTDatasetField_EnEmploymentIndustry_INDUSTRY_NONE: IMTDatasetField_EnEmploymentIndustry =
    0;
pub const IMTDatasetField_EnEmploymentIndustry_INDUSTRY_AGRICULTURE:
    IMTDatasetField_EnEmploymentIndustry = 1;
pub const IMTDatasetField_EnEmploymentIndustry_INDUSTRY_CONSTRUCTION:
    IMTDatasetField_EnEmploymentIndustry = 2;
pub const IMTDatasetField_EnEmploymentIndustry_INDUSTRY_MANAGEMENT:
    IMTDatasetField_EnEmploymentIndustry = 3;
pub const IMTDatasetField_EnEmploymentIndustry_INDUSTRY_COMMUNICATION:
    IMTDatasetField_EnEmploymentIndustry = 4;
pub const IMTDatasetField_EnEmploymentIndustry_INDUSTRY_EDUCATION:
    IMTDatasetField_EnEmploymentIndustry = 5;
pub const IMTDatasetField_EnEmploymentIndustry_INDUSTRY_GOVERNMENT:
    IMTDatasetField_EnEmploymentIndustry = 6;
pub const IMTDatasetField_EnEmploymentIndustry_INDUSTRY_HEALTHCARE:
    IMTDatasetField_EnEmploymentIndustry = 7;
pub const IMTDatasetField_EnEmploymentIndustry_INDUSTRY_TOURISM:
    IMTDatasetField_EnEmploymentIndustry = 8;
pub const IMTDatasetField_EnEmploymentIndustry_INDUSTRY_IT: IMTDatasetField_EnEmploymentIndustry =
    9;
pub const IMTDatasetField_EnEmploymentIndustry_INDUSTRY_SECURITY:
    IMTDatasetField_EnEmploymentIndustry = 10;
pub const IMTDatasetField_EnEmploymentIndustry_INDUSTRY_MANUFACTURING:
    IMTDatasetField_EnEmploymentIndustry = 11;
pub const IMTDatasetField_EnEmploymentIndustry_INDUSTRY_MARKETING:
    IMTDatasetField_EnEmploymentIndustry = 12;
pub const IMTDatasetField_EnEmploymentIndustry_INDUSTRY_SCIENCE:
    IMTDatasetField_EnEmploymentIndustry = 13;
pub const IMTDatasetField_EnEmploymentIndustry_INDUSTRY_ENGINEERING:
    IMTDatasetField_EnEmploymentIndustry = 14;
pub const IMTDatasetField_EnEmploymentIndustry_INDUSTRY_TRANSPORT:
    IMTDatasetField_EnEmploymentIndustry = 15;
pub const IMTDatasetField_EnEmploymentIndustry_INDUSTRY_OTHER:
    IMTDatasetField_EnEmploymentIndustry = 16;
pub const IMTDatasetField_EnEmploymentIndustry_INDUSTRY_FIRST:
    IMTDatasetField_EnEmploymentIndustry = 1;
pub const IMTDatasetField_EnEmploymentIndustry_INDUSTRY_LAST: IMTDatasetField_EnEmploymentIndustry =
    16;
pub type IMTDatasetField_EnEmploymentIndustry = ::std::os::raw::c_int;
pub const IMTDatasetField_EnEducationLevel_EDUCATION_LEVEL_NONE: IMTDatasetField_EnEducationLevel =
    0;
pub const IMTDatasetField_EnEducationLevel_EDUCATION_LEVEL_HIGH_SCHOOL:
    IMTDatasetField_EnEducationLevel = 1;
pub const IMTDatasetField_EnEducationLevel_EDUCATION_LEVEL_BACHELOR:
    IMTDatasetField_EnEducationLevel = 2;
pub const IMTDatasetField_EnEducationLevel_EDUCATION_LEVEL_MASTER:
    IMTDatasetField_EnEducationLevel = 3;
pub const IMTDatasetField_EnEducationLevel_EDUCATION_LEVEL_PHD: IMTDatasetField_EnEducationLevel =
    4;
pub const IMTDatasetField_EnEducationLevel_EDUCATION_LEVEL_OTHER: IMTDatasetField_EnEducationLevel =
    5;
pub const IMTDatasetField_EnEducationLevel_EDUCATION_LEVEL_FIRST: IMTDatasetField_EnEducationLevel =
    0;
pub const IMTDatasetField_EnEducationLevel_EDUCATION_LEVEL_LAST: IMTDatasetField_EnEducationLevel =
    5;
pub type IMTDatasetField_EnEducationLevel = ::std::os::raw::c_int;
pub const IMTDatasetField_EnWealthSource_WEALTH_SOURCE_EMPLOYMENT: IMTDatasetField_EnWealthSource =
    0;
pub const IMTDatasetField_EnWealthSource_WEALTH_SOURCE_SAVINGS: IMTDatasetField_EnWealthSource = 1;
pub const IMTDatasetField_EnWealthSource_WEALTH_SOURCE_INHERITANCE: IMTDatasetField_EnWealthSource =
    2;
pub const IMTDatasetField_EnWealthSource_WEALTH_SOURCE_OTHER: IMTDatasetField_EnWealthSource = 3;
pub const IMTDatasetField_EnWealthSource_WEALTH_SOURCE_FIRST: IMTDatasetField_EnWealthSource = 0;
pub const IMTDatasetField_EnWealthSource_WEALTH_SOURCE_LAST: IMTDatasetField_EnWealthSource = 3;
pub type IMTDatasetField_EnWealthSource = ::std::os::raw::c_int;
pub const IMTDatasetField_EnPreferredCommunication_PREFERRED_COMMUNICATION_UNDEFINED:
    IMTDatasetField_EnPreferredCommunication = 0;
pub const IMTDatasetField_EnPreferredCommunication_PREFERRED_COMMUNICATION_EMAIL:
    IMTDatasetField_EnPreferredCommunication = 1;
pub const IMTDatasetField_EnPreferredCommunication_PREFERRED_COMMUNICATION_PHONE:
    IMTDatasetField_EnPreferredCommunication = 2;
pub const IMTDatasetField_EnPreferredCommunication_PREFERRED_COMMUNICATION_PHONE_SMS:
    IMTDatasetField_EnPreferredCommunication = 3;
pub const IMTDatasetField_EnPreferredCommunication_PREFERRED_COMMUNICATION_MESSENGER:
    IMTDatasetField_EnPreferredCommunication = 4;
pub const IMTDatasetField_EnPreferredCommunication_PREFERRED_COMMUNICATION_FIRST:
    IMTDatasetField_EnPreferredCommunication = 0;
pub const IMTDatasetField_EnPreferredCommunication_PREFERRED_COMMUNICATION_LAST:
    IMTDatasetField_EnPreferredCommunication = 4;
pub type IMTDatasetField_EnPreferredCommunication = ::std::os::raw::c_int;
pub const IMTDatasetField_EnTradingExperience_EXPERIENCE_LESS_1_YEAR:
    IMTDatasetField_EnTradingExperience = 0;
pub const IMTDatasetField_EnTradingExperience_EXPERIENCE_1_3_YEAR:
    IMTDatasetField_EnTradingExperience = 1;
pub const IMTDatasetField_EnTradingExperience_EXPERIENCE_ABOVE_3_YEAR:
    IMTDatasetField_EnTradingExperience = 2;
pub const IMTDatasetField_EnTradingExperience_EXPERIENCE_FIRST:
    IMTDatasetField_EnTradingExperience = 0;
pub const IMTDatasetField_EnTradingExperience_EXPERIENCE_LAST: IMTDatasetField_EnTradingExperience =
    2;
pub type IMTDatasetField_EnTradingExperience = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTDatasetField"][::std::mem::size_of::<IMTDatasetField>() - 8usize];
    ["Alignment of IMTDatasetField"][::std::mem::align_of::<IMTDatasetField>() - 8usize];
};
#[repr(C)]
pub struct IMTDatasetRequest__bindgen_vtable {
    pub IMTDatasetRequest_Release: unsafe extern "C" fn(this: *mut IMTDatasetRequest),
    pub IMTDatasetRequest_Assign: unsafe extern "C" fn(
        this: *mut IMTDatasetRequest,
        request: *const IMTDatasetRequest,
    ) -> MTAPIRES,
    pub IMTDatasetRequest_Clear: unsafe extern "C" fn(this: *mut IMTDatasetRequest) -> MTAPIRES,
    pub IMTDatasetRequest_Reserved1: unsafe extern "C" fn(this: *mut IMTDatasetRequest) -> MTAPIRES,
    pub IMTDatasetRequest_Reserved2: unsafe extern "C" fn(this: *mut IMTDatasetRequest) -> MTAPIRES,
    pub IMTDatasetRequest_Reserved3: unsafe extern "C" fn(this: *mut IMTDatasetRequest) -> MTAPIRES,
    pub IMTDatasetRequest_Reserved4: unsafe extern "C" fn(this: *mut IMTDatasetRequest) -> MTAPIRES,
    pub IMTDatasetRequest_FieldCreate:
        unsafe extern "C" fn(this: *mut IMTDatasetRequest) -> *mut IMTDatasetField,
    pub IMTDatasetRequest_FieldAdd: unsafe extern "C" fn(
        this: *mut IMTDatasetRequest,
        field: *const IMTDatasetField,
    ) -> MTAPIRES,
    pub IMTDatasetRequest_FieldUpdate: unsafe extern "C" fn(
        this: *mut IMTDatasetRequest,
        pos: UINT,
        field: *const IMTDatasetField,
    ) -> MTAPIRES,
    pub IMTDatasetRequest_FieldDelete:
        unsafe extern "C" fn(this: *mut IMTDatasetRequest, pos: UINT) -> MTAPIRES,
    pub IMTDatasetRequest_FieldClear:
        unsafe extern "C" fn(this: *mut IMTDatasetRequest) -> MTAPIRES,
    pub IMTDatasetRequest_FieldShift: unsafe extern "C" fn(
        this: *mut IMTDatasetRequest,
        pos: UINT,
        shift: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTDatasetRequest_FieldTotal: unsafe extern "C" fn(this: *const IMTDatasetRequest) -> UINT,
    pub IMTDatasetRequest_FieldNext: unsafe extern "C" fn(
        this: *const IMTDatasetRequest,
        pos: UINT,
        field: *mut IMTDatasetField,
    ) -> MTAPIRES,
    pub IMTDatasetRequest_FieldCreateReference:
        unsafe extern "C" fn(this: *mut IMTDatasetRequest, pos: UINT) -> *mut IMTDatasetField,
    pub IMTDatasetRequest_FieldReserved1:
        unsafe extern "C" fn(this: *mut IMTDatasetRequest) -> MTAPIRES,
    pub IMTDatasetRequest_FieldReserved2:
        unsafe extern "C" fn(this: *mut IMTDatasetRequest) -> MTAPIRES,
    pub IMTDatasetRequest_FieldReserved3:
        unsafe extern "C" fn(this: *mut IMTDatasetRequest) -> MTAPIRES,
    pub IMTDatasetRequest_RowLimit1:
        unsafe extern "C" fn(this: *mut IMTDatasetRequest, rows: UINT) -> MTAPIRES,
    pub IMTDatasetRequest_RowLimit: unsafe extern "C" fn(this: *const IMTDatasetRequest) -> UINT,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTDatasetRequest {
    pub vtable_: *const IMTDatasetRequest__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTDatasetRequest"][::std::mem::size_of::<IMTDatasetRequest>() - 8usize];
    ["Alignment of IMTDatasetRequest"][::std::mem::align_of::<IMTDatasetRequest>() - 8usize];
};
#[repr(C)]
pub struct IMTConAddressRange__bindgen_vtable {
    pub IMTConAddressRange_Release: unsafe extern "C" fn(this: *mut IMTConAddressRange),
    pub IMTConAddressRange_Assign: unsafe extern "C" fn(
        this: *mut IMTConAddressRange,
        range: *const IMTConAddressRange,
    ) -> MTAPIRES,
    pub IMTConAddressRange_Clear: unsafe extern "C" fn(this: *mut IMTConAddressRange) -> MTAPIRES,
    pub IMTConAddressRange_From1:
        unsafe extern "C" fn(this: *mut IMTConAddressRange, name: LPCWSTR) -> MTAPIRES,
    pub IMTConAddressRange_From: unsafe extern "C" fn(this: *const IMTConAddressRange) -> LPCWSTR,
    pub IMTConAddressRange_To1:
        unsafe extern "C" fn(this: *mut IMTConAddressRange, value: LPCWSTR) -> MTAPIRES,
    pub IMTConAddressRange_To: unsafe extern "C" fn(this: *const IMTConAddressRange) -> LPCWSTR,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConAddressRange {
    pub vtable_: *const IMTConAddressRange__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConAddressRange"][::std::mem::size_of::<IMTConAddressRange>() - 8usize];
    ["Alignment of IMTConAddressRange"][::std::mem::align_of::<IMTConAddressRange>() - 8usize];
};
#[repr(C)]
pub struct IMTConServerAntiDDoS__bindgen_vtable {
    pub IMTConServerAntiDDoS_Release: unsafe extern "C" fn(this: *mut IMTConServerAntiDDoS),
    pub IMTConServerAntiDDoS_Assign: unsafe extern "C" fn(
        this: *mut IMTConServerAntiDDoS,
        param: *const IMTConServerAntiDDoS,
    ) -> MTAPIRES,
    pub IMTConServerAntiDDoS_Clear:
        unsafe extern "C" fn(this: *mut IMTConServerAntiDDoS) -> MTAPIRES,
    pub IMTConServerAntiDDoS_Priority1:
        unsafe extern "C" fn(this: *mut IMTConServerAntiDDoS, priority: UINT) -> MTAPIRES,
    pub IMTConServerAntiDDoS_Priority:
        unsafe extern "C" fn(this: *const IMTConServerAntiDDoS) -> UINT,
    pub IMTConServerAntiDDoS_AccessMask1:
        unsafe extern "C" fn(this: *mut IMTConServerAntiDDoS, mask: UINT) -> MTAPIRES,
    pub IMTConServerAntiDDoS_AccessMask:
        unsafe extern "C" fn(this: *const IMTConServerAntiDDoS) -> UINT,
    pub IMTConServerAntiDDoS_PointsAdd:
        unsafe extern "C" fn(this: *mut IMTConServerAntiDDoS, path: LPCWSTR) -> MTAPIRES,
    pub IMTConServerAntiDDoS_PointsUpdate: unsafe extern "C" fn(
        this: *mut IMTConServerAntiDDoS,
        pos: UINT,
        address: LPCWSTR,
    ) -> MTAPIRES,
    pub IMTConServerAntiDDoS_PointsDelete:
        unsafe extern "C" fn(this: *mut IMTConServerAntiDDoS, pos: UINT) -> MTAPIRES,
    pub IMTConServerAntiDDoS_PointsClear:
        unsafe extern "C" fn(this: *mut IMTConServerAntiDDoS) -> MTAPIRES,
    pub IMTConServerAntiDDoS_PointsShift: unsafe extern "C" fn(
        this: *mut IMTConServerAntiDDoS,
        pos: UINT,
        shift: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTConServerAntiDDoS_PointsTotal:
        unsafe extern "C" fn(this: *const IMTConServerAntiDDoS) -> UINT,
    pub IMTConServerAntiDDoS_PointsNext:
        unsafe extern "C" fn(this: *const IMTConServerAntiDDoS, pos: UINT) -> LPCWSTR,
    pub IMTConServerAntiDDoS_ServersAdd:
        unsafe extern "C" fn(this: *mut IMTConServerAntiDDoS, server_id: UINT64) -> MTAPIRES,
    pub IMTConServerAntiDDoS_ServersUpdate: unsafe extern "C" fn(
        this: *mut IMTConServerAntiDDoS,
        pos: UINT,
        server_id: UINT64,
    ) -> MTAPIRES,
    pub IMTConServerAntiDDoS_ServersDelete:
        unsafe extern "C" fn(this: *mut IMTConServerAntiDDoS, pos: UINT) -> MTAPIRES,
    pub IMTConServerAntiDDoS_ServersClear:
        unsafe extern "C" fn(this: *mut IMTConServerAntiDDoS) -> MTAPIRES,
    pub IMTConServerAntiDDoS_ServersShift: unsafe extern "C" fn(
        this: *mut IMTConServerAntiDDoS,
        pos: UINT,
        shift: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTConServerAntiDDoS_ServersTotal:
        unsafe extern "C" fn(this: *const IMTConServerAntiDDoS) -> UINT,
    pub IMTConServerAntiDDoS_ServersNext:
        unsafe extern "C" fn(this: *const IMTConServerAntiDDoS, pos: UINT) -> UINT64,
    pub IMTConServerAntiDDoS_SourcesAdd: unsafe extern "C" fn(
        this: *mut IMTConServerAntiDDoS,
        range: *mut IMTConAddressRange,
    ) -> MTAPIRES,
    pub IMTConServerAntiDDoS_SourcesUpdate: unsafe extern "C" fn(
        this: *mut IMTConServerAntiDDoS,
        pos: UINT,
        range: *const IMTConAddressRange,
    ) -> MTAPIRES,
    pub IMTConServerAntiDDoS_SourcesDelete:
        unsafe extern "C" fn(this: *mut IMTConServerAntiDDoS, pos: UINT) -> MTAPIRES,
    pub IMTConServerAntiDDoS_SourcesShift: unsafe extern "C" fn(
        this: *mut IMTConServerAntiDDoS,
        pos: UINT,
        shift: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTConServerAntiDDoS_SourcesTotal:
        unsafe extern "C" fn(this: *const IMTConServerAntiDDoS) -> UINT,
    pub IMTConServerAntiDDoS_SourcesNext: unsafe extern "C" fn(
        this: *const IMTConServerAntiDDoS,
        pos: UINT,
        access: *mut IMTConAddressRange,
    ) -> MTAPIRES,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConServerAntiDDoS {
    pub vtable_: *const IMTConServerAntiDDoS__bindgen_vtable,
}
pub const IMTConServerAntiDDoS_EnAccessMask_ACCESS_ALLOW_CLIENT: IMTConServerAntiDDoS_EnAccessMask =
    1;
pub const IMTConServerAntiDDoS_EnAccessMask_ACCESS_ALLOW_MANAGER:
    IMTConServerAntiDDoS_EnAccessMask = 2;
pub const IMTConServerAntiDDoS_EnAccessMask_ACCESS_ALLOW_ADMIN: IMTConServerAntiDDoS_EnAccessMask =
    4;
pub const IMTConServerAntiDDoS_EnAccessMask_ACCESS_ALLOW_CLIENT_API:
    IMTConServerAntiDDoS_EnAccessMask = 8;
pub const IMTConServerAntiDDoS_EnAccessMask_ACCESS_ALLOW_MANAGER_API:
    IMTConServerAntiDDoS_EnAccessMask = 16;
pub const IMTConServerAntiDDoS_EnAccessMask_ACCESS_ALLOW_WEB_API:
    IMTConServerAntiDDoS_EnAccessMask = 32;
pub const IMTConServerAntiDDoS_EnAccessMask_ACCESS_ALLOW_NONE: IMTConServerAntiDDoS_EnAccessMask =
    0;
pub const IMTConServerAntiDDoS_EnAccessMask_ACCESS_ALLOW_ALL: IMTConServerAntiDDoS_EnAccessMask =
    63;
pub type IMTConServerAntiDDoS_EnAccessMask = ::std::os::raw::c_int;
pub const IMTConServerAntiDDoS_EnServerPriority_PRIORITY_HIGHEST:
    IMTConServerAntiDDoS_EnServerPriority = 0;
pub const IMTConServerAntiDDoS_EnServerPriority_PRIORITY_LOWEST:
    IMTConServerAntiDDoS_EnServerPriority = 15;
pub const IMTConServerAntiDDoS_EnServerPriority_PRIORITY_IDLE:
    IMTConServerAntiDDoS_EnServerPriority = 255;
pub const IMTConServerAntiDDoS_EnServerPriority_PRIORITY_FIRST:
    IMTConServerAntiDDoS_EnServerPriority = 0;
pub const IMTConServerAntiDDoS_EnServerPriority_PRIORITY_LAST:
    IMTConServerAntiDDoS_EnServerPriority = 255;
pub type IMTConServerAntiDDoS_EnServerPriority = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConServerAntiDDoS"][::std::mem::size_of::<IMTConServerAntiDDoS>() - 8usize];
    ["Alignment of IMTConServerAntiDDoS"][::std::mem::align_of::<IMTConServerAntiDDoS>() - 8usize];
};
#[repr(C)]
pub struct IMTConServerBackup__bindgen_vtable {
    pub IMTConServerBackup_Release: unsafe extern "C" fn(this: *mut IMTConServerBackup),
    pub IMTConServerBackup_Assign: unsafe extern "C" fn(
        this: *mut IMTConServerBackup,
        param: *const IMTConServerBackup,
    ) -> MTAPIRES,
    pub IMTConServerBackup_Clear: unsafe extern "C" fn(this: *mut IMTConServerBackup) -> MTAPIRES,
    pub IMTConServerBackup_MasterServer1:
        unsafe extern "C" fn(this: *mut IMTConServerBackup, id: UINT64) -> MTAPIRES,
    pub IMTConServerBackup_MasterServer:
        unsafe extern "C" fn(this: *const IMTConServerBackup) -> UINT64,
    pub IMTConServerBackup_BackupPath1:
        unsafe extern "C" fn(this: *mut IMTConServerBackup, path: LPCWSTR) -> MTAPIRES,
    pub IMTConServerBackup_BackupPath:
        unsafe extern "C" fn(this: *const IMTConServerBackup) -> LPCWSTR,
    pub IMTConServerBackup_BackupFullTime1:
        unsafe extern "C" fn(this: *mut IMTConServerBackup, time: UINT) -> MTAPIRES,
    pub IMTConServerBackup_BackupFullTime:
        unsafe extern "C" fn(this: *const IMTConServerBackup) -> UINT,
    pub IMTConServerBackup_BackupPeriod1:
        unsafe extern "C" fn(this: *mut IMTConServerBackup, period: UINT) -> MTAPIRES,
    pub IMTConServerBackup_BackupPeriod:
        unsafe extern "C" fn(this: *const IMTConServerBackup) -> UINT,
    pub IMTConServerBackup_BackupTTL1:
        unsafe extern "C" fn(this: *mut IMTConServerBackup, period: UINT) -> MTAPIRES,
    pub IMTConServerBackup_BackupTTL: unsafe extern "C" fn(this: *const IMTConServerBackup) -> UINT,
    pub IMTConServerBackup_BackupFlags1:
        unsafe extern "C" fn(this: *mut IMTConServerBackup, flags: UINT64) -> MTAPIRES,
    pub IMTConServerBackup_BackupFlags:
        unsafe extern "C" fn(this: *const IMTConServerBackup) -> UINT64,
    pub IMTConServerBackup_SQLExportMode1:
        unsafe extern "C" fn(this: *mut IMTConServerBackup, mode: UINT) -> MTAPIRES,
    pub IMTConServerBackup_SQLExportMode:
        unsafe extern "C" fn(this: *const IMTConServerBackup) -> UINT,
    pub IMTConServerBackup_SQLExportFlags1:
        unsafe extern "C" fn(this: *mut IMTConServerBackup, flags: UINT64) -> MTAPIRES,
    pub IMTConServerBackup_SQLExportFlags:
        unsafe extern "C" fn(this: *const IMTConServerBackup) -> UINT64,
    pub IMTConServerBackup_SQLExportPeriod1:
        unsafe extern "C" fn(this: *mut IMTConServerBackup, period: UINT) -> MTAPIRES,
    pub IMTConServerBackup_SQLExportPeriod:
        unsafe extern "C" fn(this: *const IMTConServerBackup) -> UINT,
    pub IMTConServerBackup_SQLExportServer1:
        unsafe extern "C" fn(this: *mut IMTConServerBackup, server: LPCWSTR) -> MTAPIRES,
    pub IMTConServerBackup_SQLExportServer:
        unsafe extern "C" fn(this: *const IMTConServerBackup) -> LPCWSTR,
    pub IMTConServerBackup_SQLExportLogin1:
        unsafe extern "C" fn(this: *mut IMTConServerBackup, login: LPCWSTR) -> MTAPIRES,
    pub IMTConServerBackup_SQLExportLogin:
        unsafe extern "C" fn(this: *const IMTConServerBackup) -> LPCWSTR,
    pub IMTConServerBackup_SQLExportPassword1:
        unsafe extern "C" fn(this: *mut IMTConServerBackup, password: LPCWSTR) -> MTAPIRES,
    pub IMTConServerBackup_SQLExportPassword:
        unsafe extern "C" fn(this: *const IMTConServerBackup) -> LPCWSTR,
    pub IMTConServerBackup_SQLExportFolder1:
        unsafe extern "C" fn(this: *mut IMTConServerBackup, folder: LPCWSTR) -> MTAPIRES,
    pub IMTConServerBackup_SQLExportFolder:
        unsafe extern "C" fn(this: *const IMTConServerBackup) -> LPCWSTR,
    pub IMTConServerBackup_BackupLastSync:
        unsafe extern "C" fn(this: *const IMTConServerBackup) -> INT64,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConServerBackup {
    pub vtable_: *const IMTConServerBackup__bindgen_vtable,
}
pub const IMTConServerBackup_EnBackupFlags_FLAG_ENABLE_BACKUPS: IMTConServerBackup_EnBackupFlags =
    1;
pub const IMTConServerBackup_EnBackupFlags_FLAG_ENABLE_TICKS: IMTConServerBackup_EnBackupFlags = 2;
pub const IMTConServerBackup_EnBackupFlags_FLAG_ENABLE_FAILOVER: IMTConServerBackup_EnBackupFlags =
    4;
pub const IMTConServerBackup_EnBackupFlags_FLAG_ENABLE_LOGS: IMTConServerBackup_EnBackupFlags = 8;
pub type IMTConServerBackup_EnBackupFlags = ::std::os::raw::c_int;
pub const IMTConServerBackup_EnBackupPeriod_BACKUP_DISABLED: IMTConServerBackup_EnBackupPeriod = 0;
pub const IMTConServerBackup_EnBackupPeriod_BACKUP_15MINUTES: IMTConServerBackup_EnBackupPeriod = 1;
pub const IMTConServerBackup_EnBackupPeriod_BACKUP_30MINUTES: IMTConServerBackup_EnBackupPeriod = 2;
pub const IMTConServerBackup_EnBackupPeriod_BACKUP_1HOUR: IMTConServerBackup_EnBackupPeriod = 3;
pub const IMTConServerBackup_EnBackupPeriod_BACKUP_4HOURS: IMTConServerBackup_EnBackupPeriod = 4;
pub const IMTConServerBackup_EnBackupPeriod_BACKUP_1DAY: IMTConServerBackup_EnBackupPeriod = 5;
pub const IMTConServerBackup_EnBackupPeriod_BACKUP_FIRST: IMTConServerBackup_EnBackupPeriod = 0;
pub const IMTConServerBackup_EnBackupPeriod_BACKUP_LAST: IMTConServerBackup_EnBackupPeriod = 5;
pub type IMTConServerBackup_EnBackupPeriod = ::std::os::raw::c_int;
pub const IMTConServerBackup_EnBackupTTL_BACKUP_TTL_1DAY: IMTConServerBackup_EnBackupTTL = 1;
pub const IMTConServerBackup_EnBackupTTL_BACKUP_TTL_3DAYS: IMTConServerBackup_EnBackupTTL = 2;
pub const IMTConServerBackup_EnBackupTTL_BACKUP_TTL_1WEEK: IMTConServerBackup_EnBackupTTL = 3;
pub const IMTConServerBackup_EnBackupTTL_BACKUP_TTL_1MONTH: IMTConServerBackup_EnBackupTTL = 4;
pub const IMTConServerBackup_EnBackupTTL_BACKUP_TTL_3MONTHS: IMTConServerBackup_EnBackupTTL = 5;
pub const IMTConServerBackup_EnBackupTTL_BACKUP_TTL_6MONTHS: IMTConServerBackup_EnBackupTTL = 6;
pub const IMTConServerBackup_EnBackupTTL_BACKUP_TTL_FIRST: IMTConServerBackup_EnBackupTTL = 1;
pub const IMTConServerBackup_EnBackupTTL_BACKUP_TTL_LAST: IMTConServerBackup_EnBackupTTL = 6;
pub type IMTConServerBackup_EnBackupTTL = ::std::os::raw::c_int;
pub const IMTConServerBackup_EnSQLExportMode_SQL_MODE_NONE: IMTConServerBackup_EnSQLExportMode = 0;
pub const IMTConServerBackup_EnSQLExportMode_SQL_MODE_MSSQL: IMTConServerBackup_EnSQLExportMode = 1;
pub const IMTConServerBackup_EnSQLExportMode_SQL_MODE_FIREBIRD: IMTConServerBackup_EnSQLExportMode =
    2;
pub const IMTConServerBackup_EnSQLExportMode_SQL_MODE_MYSQL: IMTConServerBackup_EnSQLExportMode = 3;
pub const IMTConServerBackup_EnSQLExportMode_SQL_MODE_ORACLE: IMTConServerBackup_EnSQLExportMode =
    4;
pub const IMTConServerBackup_EnSQLExportMode_SQL_MODE_POSTGRESQL:
    IMTConServerBackup_EnSQLExportMode = 5;
pub const IMTConServerBackup_EnSQLExportMode_SQL_MODE_FIRST: IMTConServerBackup_EnSQLExportMode = 0;
pub const IMTConServerBackup_EnSQLExportMode_SQL_MODE_LAST: IMTConServerBackup_EnSQLExportMode = 5;
pub type IMTConServerBackup_EnSQLExportMode = ::std::os::raw::c_int;
pub const IMTConServerBackup_EnSQLExportFlags_SQL_FLAG_NONE: IMTConServerBackup_EnSQLExportFlags =
    0;
pub const IMTConServerBackup_EnSQLExportFlags_SQL_FLAG_PARTITIONS:
    IMTConServerBackup_EnSQLExportFlags = 1;
pub const IMTConServerBackup_EnSQLExportFlags_SQL_FLAG_SKIP_DEMO:
    IMTConServerBackup_EnSQLExportFlags = 2;
pub const IMTConServerBackup_EnSQLExportFlags_SQL_FLAG_ALL: IMTConServerBackup_EnSQLExportFlags = 3;
pub type IMTConServerBackup_EnSQLExportFlags = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConServerBackup"][::std::mem::size_of::<IMTConServerBackup>() - 8usize];
    ["Alignment of IMTConServerBackup"][::std::mem::align_of::<IMTConServerBackup>() - 8usize];
};
#[repr(C)]
pub struct IMTConServerAccess__bindgen_vtable {
    pub IMTConServerAccess_Release: unsafe extern "C" fn(this: *mut IMTConServerAccess),
    pub IMTConServerAccess_Assign: unsafe extern "C" fn(
        this: *mut IMTConServerAccess,
        param: *const IMTConServerAccess,
    ) -> MTAPIRES,
    pub IMTConServerAccess_Clear: unsafe extern "C" fn(this: *mut IMTConServerAccess) -> MTAPIRES,
    pub IMTConServerAccess_Priority1:
        unsafe extern "C" fn(this: *mut IMTConServerAccess, priority: UINT) -> MTAPIRES,
    pub IMTConServerAccess_Priority: unsafe extern "C" fn(this: *const IMTConServerAccess) -> UINT,
    pub IMTConServerAccess_AccessMask1:
        unsafe extern "C" fn(this: *mut IMTConServerAccess, mask: UINT) -> MTAPIRES,
    pub IMTConServerAccess_PriorityCurrent:
        unsafe extern "C" fn(this: *const IMTConServerAccess) -> UINT,
    pub IMTConServerAccess_AccessMask:
        unsafe extern "C" fn(this: *const IMTConServerAccess) -> UINT,
    pub IMTConServerAccess_NewsMax1:
        unsafe extern "C" fn(this: *mut IMTConServerAccess, news_max: UINT) -> MTAPIRES,
    pub IMTConServerAccess_NewsMax: unsafe extern "C" fn(this: *const IMTConServerAccess) -> UINT,
    pub IMTConServerAccess_AntifloodEnabled1:
        unsafe extern "C" fn(this: *mut IMTConServerAccess, enabled: UINT) -> MTAPIRES,
    pub IMTConServerAccess_AntifloodEnabled:
        unsafe extern "C" fn(this: *const IMTConServerAccess) -> UINT,
    pub IMTConServerAccess_AntifloodConnects1:
        unsafe extern "C" fn(this: *mut IMTConServerAccess, connects: UINT) -> MTAPIRES,
    pub IMTConServerAccess_AntifloodConnects:
        unsafe extern "C" fn(this: *const IMTConServerAccess) -> UINT,
    pub IMTConServerAccess_AntifloodErrors1:
        unsafe extern "C" fn(this: *mut IMTConServerAccess, errors: UINT) -> MTAPIRES,
    pub IMTConServerAccess_AntifloodErrors:
        unsafe extern "C" fn(this: *const IMTConServerAccess) -> UINT,
    pub IMTConServerAccess_PointsAdd:
        unsafe extern "C" fn(this: *mut IMTConServerAccess, path: LPCWSTR) -> MTAPIRES,
    pub IMTConServerAccess_PointsUpdate: unsafe extern "C" fn(
        this: *mut IMTConServerAccess,
        pos: UINT,
        address: LPCWSTR,
    ) -> MTAPIRES,
    pub IMTConServerAccess_PointsDelete:
        unsafe extern "C" fn(this: *mut IMTConServerAccess, pos: UINT) -> MTAPIRES,
    pub IMTConServerAccess_PointsClear:
        unsafe extern "C" fn(this: *mut IMTConServerAccess) -> MTAPIRES,
    pub IMTConServerAccess_PointsShift: unsafe extern "C" fn(
        this: *mut IMTConServerAccess,
        pos: UINT,
        shift: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTConServerAccess_PointsTotal:
        unsafe extern "C" fn(this: *const IMTConServerAccess) -> UINT,
    pub IMTConServerAccess_PointsNext:
        unsafe extern "C" fn(this: *const IMTConServerAccess, pos: UINT) -> LPCWSTR,
    pub IMTConServerAccess_BindingsAdd:
        unsafe extern "C" fn(this: *mut IMTConServerAccess, path: LPCWSTR) -> MTAPIRES,
    pub IMTConServerAccess_BindingsUpdate: unsafe extern "C" fn(
        this: *mut IMTConServerAccess,
        pos: UINT,
        address: LPCWSTR,
    ) -> MTAPIRES,
    pub IMTConServerAccess_BindingsDelete:
        unsafe extern "C" fn(this: *mut IMTConServerAccess, pos: UINT) -> MTAPIRES,
    pub IMTConServerAccess_BindingsClear:
        unsafe extern "C" fn(this: *mut IMTConServerAccess) -> MTAPIRES,
    pub IMTConServerAccess_BindingsShift: unsafe extern "C" fn(
        this: *mut IMTConServerAccess,
        pos: UINT,
        shift: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTConServerAccess_BindingsTotal:
        unsafe extern "C" fn(this: *const IMTConServerAccess) -> UINT,
    pub IMTConServerAccess_BindingsNext:
        unsafe extern "C" fn(this: *const IMTConServerAccess, pos: UINT) -> LPCWSTR,
    pub IMTConServerAccess_ServersAdd:
        unsafe extern "C" fn(this: *mut IMTConServerAccess, server_id: UINT64) -> MTAPIRES,
    pub IMTConServerAccess_ServersUpdate: unsafe extern "C" fn(
        this: *mut IMTConServerAccess,
        pos: UINT,
        server_id: UINT64,
    ) -> MTAPIRES,
    pub IMTConServerAccess_ServersDelete:
        unsafe extern "C" fn(this: *mut IMTConServerAccess, pos: UINT) -> MTAPIRES,
    pub IMTConServerAccess_ServersClear:
        unsafe extern "C" fn(this: *mut IMTConServerAccess) -> MTAPIRES,
    pub IMTConServerAccess_ServersShift: unsafe extern "C" fn(
        this: *mut IMTConServerAccess,
        pos: UINT,
        shift: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTConServerAccess_ServersTotal:
        unsafe extern "C" fn(this: *const IMTConServerAccess) -> UINT,
    pub IMTConServerAccess_ServersNext:
        unsafe extern "C" fn(this: *const IMTConServerAccess, pos: UINT) -> UINT64,
    pub IMTConServerAccess_AccessFlags1:
        unsafe extern "C" fn(this: *mut IMTConServerAccess, flags: UINT) -> MTAPIRES,
    pub IMTConServerAccess_AccessFlags:
        unsafe extern "C" fn(this: *const IMTConServerAccess) -> UINT,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConServerAccess {
    pub vtable_: *const IMTConServerAccess__bindgen_vtable,
}
pub const IMTConServerAccess_EnAccessMask_ACCESS_ALLOW_CLIENT: IMTConServerAccess_EnAccessMask = 1;
pub const IMTConServerAccess_EnAccessMask_ACCESS_ALLOW_MANAGER: IMTConServerAccess_EnAccessMask = 2;
pub const IMTConServerAccess_EnAccessMask_ACCESS_ALLOW_ADMIN: IMTConServerAccess_EnAccessMask = 4;
pub const IMTConServerAccess_EnAccessMask_ACCESS_ALLOW_RESERVED: IMTConServerAccess_EnAccessMask =
    8;
pub const IMTConServerAccess_EnAccessMask_ACCESS_ALLOW_MANAGER_API:
    IMTConServerAccess_EnAccessMask = 16;
pub const IMTConServerAccess_EnAccessMask_ACCESS_ALLOW_WEB_API: IMTConServerAccess_EnAccessMask =
    32;
pub const IMTConServerAccess_EnAccessMask_ACCESS_ALLOW_NONE: IMTConServerAccess_EnAccessMask = 0;
pub const IMTConServerAccess_EnAccessMask_ACCESS_ALLOW_ALL: IMTConServerAccess_EnAccessMask = 63;
pub type IMTConServerAccess_EnAccessMask = ::std::os::raw::c_int;
pub const IMTConServerAccess_EnAccessFlags_ACCESS_FLAGS_INVISIBLE:
    IMTConServerAccess_EnAccessFlags = 1;
pub const IMTConServerAccess_EnAccessFlags_ACCESS_FLAGS_NONE: IMTConServerAccess_EnAccessFlags = 0;
pub const IMTConServerAccess_EnAccessFlags_ACCESS_FLAGS_ALL: IMTConServerAccess_EnAccessFlags = 1;
pub type IMTConServerAccess_EnAccessFlags = ::std::os::raw::c_int;
pub const IMTConServerAccess_EnServerPriority_PRIORITY_HIGHEST:
    IMTConServerAccess_EnServerPriority = 0;
pub const IMTConServerAccess_EnServerPriority_PRIORITY_LOWEST: IMTConServerAccess_EnServerPriority =
    15;
pub const IMTConServerAccess_EnServerPriority_PRIORITY_IDLE: IMTConServerAccess_EnServerPriority =
    255;
pub const IMTConServerAccess_EnServerPriority_PRIORITY_FIRST: IMTConServerAccess_EnServerPriority =
    0;
pub const IMTConServerAccess_EnServerPriority_PRIORITY_LAST: IMTConServerAccess_EnServerPriority =
    255;
pub type IMTConServerAccess_EnServerPriority = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConServerAccess"][::std::mem::size_of::<IMTConServerAccess>() - 8usize];
    ["Alignment of IMTConServerAccess"][::std::mem::align_of::<IMTConServerAccess>() - 8usize];
};
#[repr(C)]
pub struct IMTConServerHistory__bindgen_vtable {
    pub IMTConServerHistory_Release: unsafe extern "C" fn(this: *mut IMTConServerHistory),
    pub IMTConServerHistory_Assign: unsafe extern "C" fn(
        this: *mut IMTConServerHistory,
        param: *const IMTConServerHistory,
    ) -> MTAPIRES,
    pub IMTConServerHistory_Clear: unsafe extern "C" fn(this: *mut IMTConServerHistory) -> MTAPIRES,
    pub IMTConServerHistory_DatafeedsTimeout1:
        unsafe extern "C" fn(this: *mut IMTConServerHistory, timeout: UINT) -> MTAPIRES,
    pub IMTConServerHistory_DatafeedsTimeout:
        unsafe extern "C" fn(this: *const IMTConServerHistory) -> UINT,
    pub IMTConServerHistory_NewsMax1:
        unsafe extern "C" fn(this: *mut IMTConServerHistory, news_max: UINT) -> MTAPIRES,
    pub IMTConServerHistory_NewsMax: unsafe extern "C" fn(this: *const IMTConServerHistory) -> UINT,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConServerHistory {
    pub vtable_: *const IMTConServerHistory__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConServerHistory"][::std::mem::size_of::<IMTConServerHistory>() - 8usize];
    ["Alignment of IMTConServerHistory"][::std::mem::align_of::<IMTConServerHistory>() - 8usize];
};
#[repr(C)]
pub struct IMTConServerRange__bindgen_vtable {
    pub IMTConServerRange_Release: unsafe extern "C" fn(this: *mut IMTConServerRange),
    pub IMTConServerRange_Assign: unsafe extern "C" fn(
        this: *mut IMTConServerRange,
        param: *const IMTConServerRange,
    ) -> MTAPIRES,
    pub IMTConServerRange_Clear: unsafe extern "C" fn(this: *mut IMTConServerRange) -> MTAPIRES,
    pub IMTConServerRange_From1:
        unsafe extern "C" fn(this: *mut IMTConServerRange, from: UINT64) -> MTAPIRES,
    pub IMTConServerRange_From: unsafe extern "C" fn(this: *const IMTConServerRange) -> UINT64,
    pub IMTConServerRange_To1:
        unsafe extern "C" fn(this: *mut IMTConServerRange, to: UINT64) -> MTAPIRES,
    pub IMTConServerRange_To: unsafe extern "C" fn(this: *const IMTConServerRange) -> UINT64,
    pub IMTConServerRange_UsedFrom: unsafe extern "C" fn(this: *const IMTConServerRange) -> UINT64,
    pub IMTConServerRange_UsedTo: unsafe extern "C" fn(this: *const IMTConServerRange) -> UINT64,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConServerRange {
    pub vtable_: *const IMTConServerRange__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConServerRange"][::std::mem::size_of::<IMTConServerRange>() - 8usize];
    ["Alignment of IMTConServerRange"][::std::mem::align_of::<IMTConServerRange>() - 8usize];
};
#[repr(C)]
pub struct IMTConServerTrade__bindgen_vtable {
    pub IMTConServerTrade_Release: unsafe extern "C" fn(this: *mut IMTConServerTrade),
    pub IMTConServerTrade_Assign: unsafe extern "C" fn(
        this: *mut IMTConServerTrade,
        param: *const IMTConServerTrade,
    ) -> MTAPIRES,
    pub IMTConServerTrade_Clear: unsafe extern "C" fn(this: *mut IMTConServerTrade) -> MTAPIRES,
    pub IMTConServerTrade_DemoMode1:
        unsafe extern "C" fn(this: *mut IMTConServerTrade, mode: UINT) -> MTAPIRES,
    pub IMTConServerTrade_DemoMode: unsafe extern "C" fn(this: *const IMTConServerTrade) -> UINT,
    pub IMTConServerTrade_DemoPeriod1:
        unsafe extern "C" fn(this: *mut IMTConServerTrade, period: UINT) -> MTAPIRES,
    pub IMTConServerTrade_DemoPeriod: unsafe extern "C" fn(this: *const IMTConServerTrade) -> UINT,
    pub IMTConServerTrade_OvernightMode1:
        unsafe extern "C" fn(this: *mut IMTConServerTrade, mode: UINT) -> MTAPIRES,
    pub IMTConServerTrade_OvernightMode:
        unsafe extern "C" fn(this: *const IMTConServerTrade) -> UINT,
    pub IMTConServerTrade_OvernightTime1:
        unsafe extern "C" fn(this: *mut IMTConServerTrade, time: UINT) -> MTAPIRES,
    pub IMTConServerTrade_OvernightTime:
        unsafe extern "C" fn(this: *const IMTConServerTrade) -> UINT,
    pub IMTConServerTrade_OvernightTimeLast:
        unsafe extern "C" fn(this: *const IMTConServerTrade) -> INT64,
    pub IMTConServerTrade_OvernightTimePrev:
        unsafe extern "C" fn(this: *const IMTConServerTrade) -> INT64,
    pub IMTConServerTrade_OvermonthMode1:
        unsafe extern "C" fn(this: *mut IMTConServerTrade, mode: UINT) -> MTAPIRES,
    pub IMTConServerTrade_OvermonthMode:
        unsafe extern "C" fn(this: *const IMTConServerTrade) -> UINT,
    pub IMTConServerTrade_OvermonthTimeLast:
        unsafe extern "C" fn(this: *const IMTConServerTrade) -> INT64,
    pub IMTConServerTrade_OvermonthTimePrev:
        unsafe extern "C" fn(this: *const IMTConServerTrade) -> INT64,
    pub IMTConServerTrade_LoginsRangeAdd: unsafe extern "C" fn(
        this: *mut IMTConServerTrade,
        range: *mut IMTConServerRange,
    ) -> MTAPIRES,
    pub IMTConServerTrade_LoginsRangeUpdate: unsafe extern "C" fn(
        this: *mut IMTConServerTrade,
        pos: UINT,
        range: *const IMTConServerRange,
    ) -> MTAPIRES,
    pub IMTConServerTrade_LoginsRangeDelete:
        unsafe extern "C" fn(this: *mut IMTConServerTrade, pos: UINT) -> MTAPIRES,
    pub IMTConServerTrade_LoginsRangeClear:
        unsafe extern "C" fn(this: *mut IMTConServerTrade) -> MTAPIRES,
    pub IMTConServerTrade_LoginsRangeShift: unsafe extern "C" fn(
        this: *mut IMTConServerTrade,
        pos: UINT,
        shift: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTConServerTrade_LoginsRangeTotal:
        unsafe extern "C" fn(this: *const IMTConServerTrade) -> UINT,
    pub IMTConServerTrade_LoginsRangeNext: unsafe extern "C" fn(
        this: *const IMTConServerTrade,
        pos: UINT,
        range: *mut IMTConServerRange,
    ) -> MTAPIRES,
    pub IMTConServerTrade_OrdersRangeAdd: unsafe extern "C" fn(
        this: *mut IMTConServerTrade,
        range: *mut IMTConServerRange,
    ) -> MTAPIRES,
    pub IMTConServerTrade_OrdersRangeUpdate: unsafe extern "C" fn(
        this: *mut IMTConServerTrade,
        pos: UINT,
        range: *const IMTConServerRange,
    ) -> MTAPIRES,
    pub IMTConServerTrade_OrdersRangeDelete:
        unsafe extern "C" fn(this: *mut IMTConServerTrade, pos: UINT) -> MTAPIRES,
    pub IMTConServerTrade_OrdersRangeClear:
        unsafe extern "C" fn(this: *mut IMTConServerTrade) -> MTAPIRES,
    pub IMTConServerTrade_OrdersRangeShift: unsafe extern "C" fn(
        this: *mut IMTConServerTrade,
        pos: UINT,
        shift: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTConServerTrade_OrdersRangeTotal:
        unsafe extern "C" fn(this: *const IMTConServerTrade) -> UINT,
    pub IMTConServerTrade_OrdersRangeNext: unsafe extern "C" fn(
        this: *const IMTConServerTrade,
        pos: UINT,
        range: *mut IMTConServerRange,
    ) -> MTAPIRES,
    pub IMTConServerTrade_DealsRangeAdd: unsafe extern "C" fn(
        this: *mut IMTConServerTrade,
        range: *mut IMTConServerRange,
    ) -> MTAPIRES,
    pub IMTConServerTrade_DealsRangeUpdate: unsafe extern "C" fn(
        this: *mut IMTConServerTrade,
        pos: UINT,
        range: *const IMTConServerRange,
    ) -> MTAPIRES,
    pub IMTConServerTrade_DealsRangeDelete:
        unsafe extern "C" fn(this: *mut IMTConServerTrade, pos: UINT) -> MTAPIRES,
    pub IMTConServerTrade_DealsRangeClear:
        unsafe extern "C" fn(this: *mut IMTConServerTrade) -> MTAPIRES,
    pub IMTConServerTrade_DealsRangeShift: unsafe extern "C" fn(
        this: *mut IMTConServerTrade,
        pos: UINT,
        shift: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTConServerTrade_DealsRangeTotal:
        unsafe extern "C" fn(this: *const IMTConServerTrade) -> UINT,
    pub IMTConServerTrade_DealsRangeNext: unsafe extern "C" fn(
        this: *const IMTConServerTrade,
        pos: UINT,
        range: *mut IMTConServerRange,
    ) -> MTAPIRES,
    pub IMTConServerTrade_TotalUsers: unsafe extern "C" fn(this: *const IMTConServerTrade) -> UINT,
    pub IMTConServerTrade_TotalUsersReal:
        unsafe extern "C" fn(this: *const IMTConServerTrade) -> UINT,
    pub IMTConServerTrade_TotalDeals: unsafe extern "C" fn(this: *const IMTConServerTrade) -> UINT,
    pub IMTConServerTrade_TotalOrders: unsafe extern "C" fn(this: *const IMTConServerTrade) -> UINT,
    pub IMTConServerTrade_TotalOrdersHistory:
        unsafe extern "C" fn(this: *const IMTConServerTrade) -> UINT,
    pub IMTConServerTrade_TotalPositions:
        unsafe extern "C" fn(this: *const IMTConServerTrade) -> UINT,
    pub IMTConServerTrade_OvernightDays1:
        unsafe extern "C" fn(this: *mut IMTConServerTrade, days: UINT) -> MTAPIRES,
    pub IMTConServerTrade_OvernightDays:
        unsafe extern "C" fn(this: *const IMTConServerTrade) -> UINT,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConServerTrade {
    pub vtable_: *const IMTConServerTrade__bindgen_vtable,
}
pub const IMTConServerTrade_EnDemoMode_DEMO_DISABLED: IMTConServerTrade_EnDemoMode = 0;
pub const IMTConServerTrade_EnDemoMode_DEMO_PROLONG: IMTConServerTrade_EnDemoMode = 1;
pub const IMTConServerTrade_EnDemoMode_DEMO_FIXED: IMTConServerTrade_EnDemoMode = 2;
pub const IMTConServerTrade_EnDemoMode_DEMO_FIRST: IMTConServerTrade_EnDemoMode = 0;
pub const IMTConServerTrade_EnDemoMode_DEMO_LAST: IMTConServerTrade_EnDemoMode = 2;
pub type IMTConServerTrade_EnDemoMode = ::std::os::raw::c_int;
pub const IMTConServerTrade_EnOvernightMode_OVERNIGHT_END_DAY: IMTConServerTrade_EnOvernightMode =
    0;
pub const IMTConServerTrade_EnOvernightMode_OVERNIGHT_START_DAY: IMTConServerTrade_EnOvernightMode =
    1;
pub const IMTConServerTrade_EnOvernightMode_OVERNIGHT_FIRST: IMTConServerTrade_EnOvernightMode = 0;
pub const IMTConServerTrade_EnOvernightMode_OVERNIGHT_LAST: IMTConServerTrade_EnOvernightMode = 1;
pub type IMTConServerTrade_EnOvernightMode = ::std::os::raw::c_int;
pub const IMTConServerTrade_EnOvermonthMode_OVERMONTH_LAST_DAY: IMTConServerTrade_EnOvermonthMode =
    0;
pub const IMTConServerTrade_EnOvermonthMode_OVERMONTH_FIRST_DAY: IMTConServerTrade_EnOvermonthMode =
    1;
pub const IMTConServerTrade_EnOvermonthMode_OVERMONTH_FIRST: IMTConServerTrade_EnOvermonthMode = 0;
pub const IMTConServerTrade_EnOvermonthMode_OVERMONTH_LAST: IMTConServerTrade_EnOvermonthMode = 1;
pub type IMTConServerTrade_EnOvermonthMode = ::std::os::raw::c_int;
pub const IMTConServerTrade_EnOvernightDays_OVERNIGHT_DAYS_SUN: IMTConServerTrade_EnOvernightDays =
    1;
pub const IMTConServerTrade_EnOvernightDays_OVERNIGHT_DAYS_MON: IMTConServerTrade_EnOvernightDays =
    2;
pub const IMTConServerTrade_EnOvernightDays_OVERNIGHT_DAYS_TUE: IMTConServerTrade_EnOvernightDays =
    4;
pub const IMTConServerTrade_EnOvernightDays_OVERNIGHT_DAYS_WED: IMTConServerTrade_EnOvernightDays =
    8;
pub const IMTConServerTrade_EnOvernightDays_OVERNIGHT_DAYS_THU: IMTConServerTrade_EnOvernightDays =
    16;
pub const IMTConServerTrade_EnOvernightDays_OVERNIGHT_DAYS_FRI: IMTConServerTrade_EnOvernightDays =
    32;
pub const IMTConServerTrade_EnOvernightDays_OVERNIGHT_DAYS_SAT: IMTConServerTrade_EnOvernightDays =
    64;
pub const IMTConServerTrade_EnOvernightDays_OVERNIGHT_DAYS_ROLLOVER_SUN:
    IMTConServerTrade_EnOvernightDays = 128;
pub const IMTConServerTrade_EnOvernightDays_OVERNIGHT_DAYS_ROLLOVER_MON:
    IMTConServerTrade_EnOvernightDays = 256;
pub const IMTConServerTrade_EnOvernightDays_OVERNIGHT_DAYS_ROLLOVER_TUE:
    IMTConServerTrade_EnOvernightDays = 512;
pub const IMTConServerTrade_EnOvernightDays_OVERNIGHT_DAYS_ROLLOVER_WED:
    IMTConServerTrade_EnOvernightDays = 1024;
pub const IMTConServerTrade_EnOvernightDays_OVERNIGHT_DAYS_ROLLOVER_THU:
    IMTConServerTrade_EnOvernightDays = 2048;
pub const IMTConServerTrade_EnOvernightDays_OVERNIGHT_DAYS_ROLLOVER_FRI:
    IMTConServerTrade_EnOvernightDays = 4096;
pub const IMTConServerTrade_EnOvernightDays_OVERNIGHT_DAYS_ROLLOVER_SAT:
    IMTConServerTrade_EnOvernightDays = 8192;
pub const IMTConServerTrade_EnOvernightDays_OVERNIGHT_DAYS_NONE: IMTConServerTrade_EnOvernightDays =
    0;
pub const IMTConServerTrade_EnOvernightDays_OVERNIGHT_DAYS_DEFAULT:
    IMTConServerTrade_EnOvernightDays = 7998;
pub const IMTConServerTrade_EnOvernightDays_OVERNIGHT_DAYS_ALL: IMTConServerTrade_EnOvernightDays =
    16383;
pub type IMTConServerTrade_EnOvernightDays = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConServerTrade"][::std::mem::size_of::<IMTConServerTrade>() - 8usize];
    ["Alignment of IMTConServerTrade"][::std::mem::align_of::<IMTConServerTrade>() - 8usize];
};
#[repr(C)]
pub struct IMTConClusterState__bindgen_vtable {
    pub IMTConClusterState_Release: unsafe extern "C" fn(this: *mut IMTConClusterState),
    pub IMTConClusterState_Assign: unsafe extern "C" fn(
        this: *mut IMTConClusterState,
        state: *const IMTConClusterState,
    ) -> MTAPIRES,
    pub IMTConClusterState_Clear: unsafe extern "C" fn(this: *mut IMTConClusterState) -> MTAPIRES,
    pub IMTConClusterState_Id: unsafe extern "C" fn(this: *const IMTConClusterState) -> UINT64,
    pub IMTConClusterState_Connected: unsafe extern "C" fn(this: *const IMTConClusterState) -> bool,
    pub IMTConClusterState_ConnectedAddress:
        unsafe extern "C" fn(this: *const IMTConClusterState) -> LPCWSTR,
    pub IMTConClusterState_ConnectedTime:
        unsafe extern "C" fn(this: *const IMTConClusterState) -> INT64,
    pub IMTConClusterState_StatsDay: unsafe extern "C" fn(this: *const IMTConClusterState) -> INT64,
    pub IMTConClusterState_StatsPing: unsafe extern "C" fn(this: *const IMTConClusterState) -> UINT,
    pub IMTConClusterState_StatsPingMin:
        unsafe extern "C" fn(this: *const IMTConClusterState) -> UINT,
    pub IMTConClusterState_StatsPingMax:
        unsafe extern "C" fn(this: *const IMTConClusterState) -> UINT,
    pub IMTConClusterState_StatsSpeed:
        unsafe extern "C" fn(this: *const IMTConClusterState) -> UINT,
    pub IMTConClusterState_StatsSpeedMin:
        unsafe extern "C" fn(this: *const IMTConClusterState) -> UINT,
    pub IMTConClusterState_StatsSpeedMax:
        unsafe extern "C" fn(this: *const IMTConClusterState) -> UINT,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConClusterState {
    pub vtable_: *const IMTConClusterState__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConClusterState"][::std::mem::size_of::<IMTConClusterState>() - 8usize];
    ["Alignment of IMTConClusterState"][::std::mem::align_of::<IMTConClusterState>() - 8usize];
};
#[repr(C)]
pub struct IMTConServer__bindgen_vtable {
    pub IMTConServer_Release: unsafe extern "C" fn(this: *mut IMTConServer),
    pub IMTConServer_Assign:
        unsafe extern "C" fn(this: *mut IMTConServer, param: *const IMTConServer) -> MTAPIRES,
    pub IMTConServer_Clear: unsafe extern "C" fn(this: *mut IMTConServer) -> MTAPIRES,
    pub IMTConServer_Type1: unsafe extern "C" fn(this: *mut IMTConServer, type_: UINT) -> MTAPIRES,
    pub IMTConServer_Type: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_Name1:
        unsafe extern "C" fn(this: *mut IMTConServer, name: LPCWSTR) -> MTAPIRES,
    pub IMTConServer_Name: unsafe extern "C" fn(this: *const IMTConServer) -> LPCWSTR,
    pub IMTConServer_Address1:
        unsafe extern "C" fn(this: *mut IMTConServer, name: LPCWSTR) -> MTAPIRES,
    pub IMTConServer_Address: unsafe extern "C" fn(this: *const IMTConServer) -> LPCWSTR,
    pub IMTConServer_Id1: unsafe extern "C" fn(this: *mut IMTConServer, id: UINT64) -> MTAPIRES,
    pub IMTConServer_Id: unsafe extern "C" fn(this: *const IMTConServer) -> UINT64,
    pub IMTConServer_Password:
        unsafe extern "C" fn(this: *mut IMTConServer, password: LPCWSTR) -> MTAPIRES,
    pub IMTConServer_PasswordCheck:
        unsafe extern "C" fn(this: *const IMTConServer, password: LPCWSTR) -> MTAPIRES,
    pub IMTConServer_ServiceTime1:
        unsafe extern "C" fn(this: *mut IMTConServer, stime: UINT) -> MTAPIRES,
    pub IMTConServer_ServiceTime: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_AdaptersCurrent1:
        unsafe extern "C" fn(this: *mut IMTConServer, current: LPCWSTR) -> MTAPIRES,
    pub IMTConServer_AdaptersCurrent: unsafe extern "C" fn(this: *const IMTConServer) -> LPCWSTR,
    pub IMTConServer_AdaptersTotal: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_AdaptersNext:
        unsafe extern "C" fn(this: *const IMTConServer, pos: UINT) -> LPCWSTR,
    pub IMTConServer_AddressTotal: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_AddressNext:
        unsafe extern "C" fn(this: *const IMTConServer, pos: UINT) -> UINT,
    pub IMTConServer_Version: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_Build: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_BuildDate: unsafe extern "C" fn(this: *const IMTConServer) -> LPCWSTR,
    pub IMTConServer_LastBootTime: unsafe extern "C" fn(this: *const IMTConServer) -> INT64,
    pub IMTConServer_Connected: unsafe extern "C" fn(this: *const IMTConServer) -> bool,
    pub IMTConServer_OS: unsafe extern "C" fn(this: *const IMTConServer) -> LPCWSTR,
    pub IMTConServer_CPU: unsafe extern "C" fn(this: *const IMTConServer) -> LPCWSTR,
    pub IMTConServer_CPUTotal: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_CPUUsageMax: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_CPUUsageCritical: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_MemoryTotal: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_MemoryFree: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_MemoryFreeMin: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_MemoryFreeCritical: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_HDDTotal: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_HDDFree: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_HDDFreeCritical: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_HDDFragments: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_HDDFragmentsCritical: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_HDDSpeedRead: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_HDDSpeedReadCritical: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_HDDSpeedWrite: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_HDDSpeedWriteCritical: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_ConnectsMax: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_ConnectsCritical: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_NetworkMax: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_NetworkCritical: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_TradeServer:
        unsafe extern "C" fn(this: *mut IMTConServer) -> *mut IMTConServerTrade,
    pub IMTConServer_HistoryServer:
        unsafe extern "C" fn(this: *mut IMTConServer) -> *mut IMTConServerHistory,
    pub IMTConServer_AccessServer:
        unsafe extern "C" fn(this: *mut IMTConServer) -> *mut IMTConServerAccess,
    pub IMTConServer_BackupServer:
        unsafe extern "C" fn(this: *mut IMTConServer) -> *mut IMTConServerBackup,
    pub IMTConServer_AntiDDoSServer:
        unsafe extern "C" fn(this: *mut IMTConServer) -> *mut IMTConServerAntiDDoS,
    pub IMTConServer_ReservedServer1:
        unsafe extern "C" fn(this: *mut IMTConServer) -> *mut ::std::os::raw::c_void,
    pub IMTConServer_ReservedServer2:
        unsafe extern "C" fn(this: *mut IMTConServer) -> *mut ::std::os::raw::c_void,
    pub IMTConServer_ReservedServer3:
        unsafe extern "C" fn(this: *mut IMTConServer) -> *mut ::std::os::raw::c_void,
    pub IMTConServer_ReservedServer4:
        unsafe extern "C" fn(this: *mut IMTConServer) -> *mut ::std::os::raw::c_void,
    pub IMTConServer_PointsAdd:
        unsafe extern "C" fn(this: *mut IMTConServer, path: LPCWSTR) -> MTAPIRES,
    pub IMTConServer_PointsUpdate:
        unsafe extern "C" fn(this: *mut IMTConServer, pos: UINT, address: LPCWSTR) -> MTAPIRES,
    pub IMTConServer_PointsDelete:
        unsafe extern "C" fn(this: *mut IMTConServer, pos: UINT) -> MTAPIRES,
    pub IMTConServer_PointsClear: unsafe extern "C" fn(this: *mut IMTConServer) -> MTAPIRES,
    pub IMTConServer_PointsShift: unsafe extern "C" fn(
        this: *mut IMTConServer,
        pos: UINT,
        shift: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTConServer_PointsTotal: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_PointsNext:
        unsafe extern "C" fn(this: *const IMTConServer, pos: UINT) -> LPCWSTR,
    pub IMTConServer_BindingsAdd:
        unsafe extern "C" fn(this: *mut IMTConServer, path: LPCWSTR) -> MTAPIRES,
    pub IMTConServer_BindingsUpdate:
        unsafe extern "C" fn(this: *mut IMTConServer, pos: UINT, address: LPCWSTR) -> MTAPIRES,
    pub IMTConServer_BindingsDelete:
        unsafe extern "C" fn(this: *mut IMTConServer, pos: UINT) -> MTAPIRES,
    pub IMTConServer_BindingsClear: unsafe extern "C" fn(this: *mut IMTConServer) -> MTAPIRES,
    pub IMTConServer_BindingsShift: unsafe extern "C" fn(
        this: *mut IMTConServer,
        pos: UINT,
        shift: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTConServer_BindingsTotal: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_BindingsNext:
        unsafe extern "C" fn(this: *const IMTConServer, pos: UINT) -> LPCWSTR,
    pub IMTConServer_FailoverMode1:
        unsafe extern "C" fn(this: *mut IMTConServer, mode: UINT) -> MTAPIRES,
    pub IMTConServer_FailoverMode: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_FailoverTimeout1:
        unsafe extern "C" fn(this: *mut IMTConServer, timeout: UINT) -> MTAPIRES,
    pub IMTConServer_FailoverTimeout: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_ClusterStateTotal: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_ClusterStateNext: unsafe extern "C" fn(
        this: *const IMTConServer,
        pos: UINT,
        state: *mut IMTConClusterState,
    ) -> MTAPIRES,
    pub IMTConServer_ClusterStateGet: unsafe extern "C" fn(
        this: *const IMTConServer,
        id: UINT64,
        state: *mut IMTConClusterState,
    ) -> MTAPIRES,
    pub IMTConServer_AddressIPv61:
        unsafe extern "C" fn(this: *mut IMTConServer, name: LPCWSTR) -> MTAPIRES,
    pub IMTConServer_AddressIPv6: unsafe extern "C" fn(this: *const IMTConServer) -> LPCWSTR,
    pub IMTConServer_AddressIPv6Total: unsafe extern "C" fn(this: *const IMTConServer) -> UINT,
    pub IMTConServer_AddressIPv6Next: unsafe extern "C" fn(
        this: *const IMTConServer,
        pos: UINT,
        address: *mut MTAPISTR,
    ) -> MTAPIRES,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConServer {
    pub vtable_: *const IMTConServer__bindgen_vtable,
    pub impl_ptr: *mut dyn crate::interfaces::con_server::MT5ConServer,
}
pub const IMTConServer_EnServerTypes_NET_MAIN_TRADE_SERVER: IMTConServer_EnServerTypes = 0;
pub const IMTConServer_EnServerTypes_NET_TRADE_SERVER: IMTConServer_EnServerTypes = 1;
pub const IMTConServer_EnServerTypes_NET_HISTORY_SERVER: IMTConServer_EnServerTypes = 2;
pub const IMTConServer_EnServerTypes_NET_ACCESS_SERVER: IMTConServer_EnServerTypes = 3;
pub const IMTConServer_EnServerTypes_NET_BACKUP_SERVER: IMTConServer_EnServerTypes = 4;
pub const IMTConServer_EnServerTypes_NET_OBSOLETE_SERVER_1: IMTConServer_EnServerTypes = 5;
pub const IMTConServer_EnServerTypes_NET_OBSOLETE_SERVER_2: IMTConServer_EnServerTypes = 6;
pub const IMTConServer_EnServerTypes_NET_ANTIDDOS_SERVER: IMTConServer_EnServerTypes = 7;
pub const IMTConServer_EnServerTypes_NET_SERVER_FIRST: IMTConServer_EnServerTypes = 0;
pub const IMTConServer_EnServerTypes_NET_SERVER_LAST: IMTConServer_EnServerTypes = 7;
pub type IMTConServer_EnServerTypes = ::std::os::raw::c_int;
pub const IMTConServer_EnFailoverModes_FAILOVER_MODE_DISABLED: IMTConServer_EnFailoverModes = 0;
pub const IMTConServer_EnFailoverModes_FAILOVER_MODE_BY_MOST: IMTConServer_EnFailoverModes = 1;
pub const IMTConServer_EnFailoverModes_FAILOVER_MODE_BY_ALL: IMTConServer_EnFailoverModes = 2;
pub const IMTConServer_EnFailoverModes_FAILOVER_MODE_FIRST: IMTConServer_EnFailoverModes = 0;
pub const IMTConServer_EnFailoverModes_FAILOVER_MODE_LAST: IMTConServer_EnFailoverModes = 2;
pub type IMTConServer_EnFailoverModes = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConServer"][::std::mem::size_of::<IMTConServer>() - 24usize];
    ["Alignment of IMTConServer"][::std::mem::align_of::<IMTConServer>() - 8usize];
};
#[repr(C)]
pub struct IMTConTime__bindgen_vtable {
    pub IMTConTime_Release: unsafe extern "C" fn(this: *mut IMTConTime),
    pub IMTConTime_Assign:
        unsafe extern "C" fn(this: *mut IMTConTime, param: *mut IMTConTime) -> MTAPIRES,
    pub IMTConTime_Clear: unsafe extern "C" fn(this: *mut IMTConTime) -> MTAPIRES,
    pub IMTConTime_Daylight1: unsafe extern "C" fn(this: *mut IMTConTime, enable: bool) -> MTAPIRES,
    pub IMTConTime_Daylight: unsafe extern "C" fn(this: *const IMTConTime) -> bool,
    pub IMTConTime_TimeZone1:
        unsafe extern "C" fn(this: *mut IMTConTime, zone: ::std::os::raw::c_int) -> MTAPIRES,
    pub IMTConTime_TimeZone: unsafe extern "C" fn(this: *const IMTConTime) -> ::std::os::raw::c_int,
    pub IMTConTime_TimeServer1:
        unsafe extern "C" fn(this: *mut IMTConTime, server: LPCWSTR) -> MTAPIRES,
    pub IMTConTime_TimeServer: unsafe extern "C" fn(this: *const IMTConTime) -> LPCWSTR,
    pub IMTConTime_TimeTableGet: unsafe extern "C" fn(
        this: *const IMTConTime,
        wday: UINT,
        hour: UINT,
        mode: *mut UINT,
    ) -> MTAPIRES,
    pub IMTConTime_TimeTableSet:
        unsafe extern "C" fn(this: *mut IMTConTime, wday: UINT, hour: UINT, mode: UINT) -> MTAPIRES,
    pub IMTConTime_DaylightState:
        unsafe extern "C" fn(this: *const IMTConTime) -> ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConTime {
    pub vtable_: *const IMTConTime__bindgen_vtable,
}
pub const IMTConTime_EnTimeTableMode_TIME_MODE_DISABLED: IMTConTime_EnTimeTableMode = 0;
pub const IMTConTime_EnTimeTableMode_TIME_MODE_ENABLED: IMTConTime_EnTimeTableMode = 1;
pub const IMTConTime_EnTimeTableMode_TIME_MODE_FIRST: IMTConTime_EnTimeTableMode = 0;
pub const IMTConTime_EnTimeTableMode_TIME_MODE_LAST: IMTConTime_EnTimeTableMode = 1;
pub type IMTConTime_EnTimeTableMode = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConTime"][::std::mem::size_of::<IMTConTime>() - 8usize];
    ["Alignment of IMTConTime"][::std::mem::align_of::<IMTConTime>() - 8usize];
};
#[repr(C)]
pub struct IMTConTimeSink__bindgen_vtable {}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMTConTimeSink {
    pub vtable_: *const IMTConTimeSink__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConTimeSink"][::std::mem::size_of::<IMTConTimeSink>() - 8usize];
    ["Alignment of IMTConTimeSink"][::std::mem::align_of::<IMTConTimeSink>() - 8usize];
};
#[repr(C)]
pub struct IMTConServerSink__bindgen_vtable {}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMTConServerSink {
    pub vtable_: *const IMTConServerSink__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConServerSink"][::std::mem::size_of::<IMTConServerSink>() - 8usize];
    ["Alignment of IMTConServerSink"][::std::mem::align_of::<IMTConServerSink>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct IMTConCommon__bindgen_vtable {
    pub IMTConCommon_Release: unsafe extern "C" fn(this: *mut IMTConCommon),
    pub IMTConCommon_Assign:
        unsafe extern "C" fn(this: *mut IMTConCommon, param: *const IMTConCommon) -> MTAPIRES,
    pub IMTConCommon_Clear: unsafe extern "C" fn(this: *mut IMTConCommon) -> MTAPIRES,
    pub IMTConCommon_Name1:
        unsafe extern "C" fn(this: *mut IMTConCommon, name: LPCWSTR) -> MTAPIRES,
    pub IMTConCommon_Name: unsafe extern "C" fn(this: *const IMTConCommon) -> LPCWSTR,
    pub IMTConCommon_NameFull: unsafe extern "C" fn(this: *const IMTConCommon) -> LPCWSTR,
    pub IMTConCommon_Owner: unsafe extern "C" fn(this: *const IMTConCommon) -> LPCWSTR,
    pub IMTConCommon_OwnerID: unsafe extern "C" fn(this: *const IMTConCommon) -> LPCWSTR,
    pub IMTConCommon_OwnerHost: unsafe extern "C" fn(this: *const IMTConCommon) -> LPCWSTR,
    pub IMTConCommon_OwnerEmail: unsafe extern "C" fn(this: *const IMTConCommon) -> LPCWSTR,
    pub IMTConCommon_Product: unsafe extern "C" fn(this: *const IMTConCommon) -> LPCWSTR,
    pub IMTConCommon_ExpirationLicense: unsafe extern "C" fn(this: *const IMTConCommon) -> INT64,
    pub IMTConCommon_ExpirationSupport: unsafe extern "C" fn(this: *const IMTConCommon) -> INT64,
    pub IMTConCommon_LimitTradeServers: unsafe extern "C" fn(this: *const IMTConCommon) -> UINT,
    pub IMTConCommon_LimitWebServers: unsafe extern "C" fn(this: *const IMTConCommon) -> UINT,
    pub IMTConCommon_LimitAccounts: unsafe extern "C" fn(this: *const IMTConCommon) -> UINT,
    pub IMTConCommon_LimitDeals: unsafe extern "C" fn(this: *const IMTConCommon) -> UINT,
    pub IMTConCommon_LimitGroups: unsafe extern "C" fn(this: *const IMTConCommon) -> UINT,
    pub IMTConCommon_LiveUpdateMode: unsafe extern "C" fn(this: *const IMTConCommon) -> UINT,
    pub IMTConCommon_LiveUpdateMode1:
        unsafe extern "C" fn(this: *mut IMTConCommon, mode: UINT) -> MTAPIRES,
    pub IMTConCommon_TotalUsers: unsafe extern "C" fn(this: *const IMTConCommon) -> UINT,
    pub IMTConCommon_TotalUsersReal: unsafe extern "C" fn(this: *const IMTConCommon) -> UINT,
    pub IMTConCommon_TotalDeals: unsafe extern "C" fn(this: *const IMTConCommon) -> UINT,
    pub IMTConCommon_TotalOrders: unsafe extern "C" fn(this: *const IMTConCommon) -> UINT,
    pub IMTConCommon_TotalOrdersHistory: unsafe extern "C" fn(this: *const IMTConCommon) -> UINT,
    pub IMTConCommon_TotalPositions: unsafe extern "C" fn(this: *const IMTConCommon) -> UINT,
    pub IMTConCommon_LimitSymbols: unsafe extern "C" fn(this: *const IMTConCommon) -> UINT,
    pub IMTConCommon_AccountURL1:
        unsafe extern "C" fn(this: *mut IMTConCommon, url: LPCWSTR) -> MTAPIRES,
    pub IMTConCommon_AccountURL: unsafe extern "C" fn(this: *const IMTConCommon) -> LPCWSTR,
    pub IMTConCommon_AccountDepositURL1:
        unsafe extern "C" fn(this: *mut IMTConCommon, url: LPCWSTR) -> MTAPIRES,
    pub IMTConCommon_AccountDepositURL: unsafe extern "C" fn(this: *const IMTConCommon) -> LPCWSTR,
    pub IMTConCommon_AccountWithdrawalURL1:
        unsafe extern "C" fn(this: *mut IMTConCommon, url: LPCWSTR) -> MTAPIRES,
    pub IMTConCommon_AccountWithdrawalURL:
        unsafe extern "C" fn(this: *const IMTConCommon) -> LPCWSTR,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConCommon {
    pub vtable_: *const IMTConCommon__bindgen_vtable,
    pub impl_ptr: *mut dyn crate::interfaces::con_common::MT5ConCommon,
}

pub const IMTConCommon_EnUpdateMode_UPDATE_DISABLE: IMTConCommon_EnUpdateMode = 0;
pub const IMTConCommon_EnUpdateMode_UPDATE_ENABLE: IMTConCommon_EnUpdateMode = 1;
pub const IMTConCommon_EnUpdateMode_UPDATE_ENABLE_BETA: IMTConCommon_EnUpdateMode = 2;
pub const IMTConCommon_EnUpdateMode_UPDATE_FIRST: IMTConCommon_EnUpdateMode = 0;
pub const IMTConCommon_EnUpdateMode_UPDATE_LAST: IMTConCommon_EnUpdateMode = 2;
pub type IMTConCommon_EnUpdateMode = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConCommon"][::std::mem::size_of::<IMTConCommon>() - 24usize];
    ["Alignment of IMTConCommon"][::std::mem::align_of::<IMTConCommon>() - 8usize];
};
#[repr(C)]
pub struct IMTConCommonSink__bindgen_vtable {
    // manually added
    pub IMTConCommonSink_OnCommonUpdate:
        unsafe extern "C" fn(this: *mut IMTConCommonSink, config: *const IMTConCommon),
    pub IMTConCommonSink_OnCommonSync:
        unsafe extern "C" fn(this: *mut IMTConCommonSink),
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMTConCommonSink {
    pub vtable_: *const IMTConCommonSink__bindgen_vtable
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConCommonSink"][::std::mem::size_of::<IMTConCommonSink>() - 8usize];
    ["Alignment of IMTConCommonSink"][::std::mem::align_of::<IMTConCommonSink>() - 8usize];
};
#[repr(C)]
pub struct IMTConParam__bindgen_vtable {
    pub IMTConParam_Release: unsafe extern "C" fn(this: *mut IMTConParam),
    pub IMTConParam_Assign:
        unsafe extern "C" fn(this: *mut IMTConParam, param: *const IMTConParam) -> MTAPIRES,
    pub IMTConParam_Clear: unsafe extern "C" fn(this: *mut IMTConParam) -> MTAPIRES,
    pub IMTConParam_Name1: unsafe extern "C" fn(this: *mut IMTConParam, name: LPCWSTR) -> MTAPIRES,
    pub IMTConParam_Name: unsafe extern "C" fn(this: *const IMTConParam) -> LPCWSTR,
    pub IMTConParam_Type1: unsafe extern "C" fn(this: *mut IMTConParam, type_: UINT) -> MTAPIRES,
    pub IMTConParam_Type: unsafe extern "C" fn(this: *const IMTConParam) -> UINT,
    pub IMTConParam_Value1:
        unsafe extern "C" fn(this: *mut IMTConParam, value: LPCWSTR) -> MTAPIRES,
    pub IMTConParam_Value: unsafe extern "C" fn(this: *const IMTConParam) -> LPCWSTR,
    pub IMTConParam_ValueString1:
        unsafe extern "C" fn(this: *mut IMTConParam, value: LPCWSTR) -> MTAPIRES,
    pub IMTConParam_ValueString: unsafe extern "C" fn(this: *const IMTConParam) -> LPCWSTR,
    pub IMTConParam_ValueInt1:
        unsafe extern "C" fn(this: *mut IMTConParam, value: INT64) -> MTAPIRES,
    pub IMTConParam_ValueInt: unsafe extern "C" fn(this: *const IMTConParam) -> INT64,
    pub IMTConParam_ValueFloat1:
        unsafe extern "C" fn(this: *mut IMTConParam, value: f64) -> MTAPIRES,
    pub IMTConParam_ValueFloat: unsafe extern "C" fn(this: *const IMTConParam) -> f64,
    pub IMTConParam_ValueTime1:
        unsafe extern "C" fn(this: *mut IMTConParam, value: INT64) -> MTAPIRES,
    pub IMTConParam_ValueTime: unsafe extern "C" fn(this: *const IMTConParam) -> INT64,
    pub IMTConParam_ValueDatetime1:
        unsafe extern "C" fn(this: *mut IMTConParam, value: INT64) -> MTAPIRES,
    pub IMTConParam_ValueDatetime: unsafe extern "C" fn(this: *const IMTConParam) -> INT64,
    pub IMTConParam_ValueGroups1:
        unsafe extern "C" fn(this: *mut IMTConParam, value: LPCWSTR) -> MTAPIRES,
    pub IMTConParam_ValueGroups: unsafe extern "C" fn(this: *const IMTConParam) -> LPCWSTR,
    pub IMTConParam_ValueSymbols1:
        unsafe extern "C" fn(this: *mut IMTConParam, value: LPCWSTR) -> MTAPIRES,
    pub IMTConParam_ValueSymbols: unsafe extern "C" fn(this: *const IMTConParam) -> LPCWSTR,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConParam {
    pub vtable_: *const IMTConParam__bindgen_vtable,
}
pub const IMTConParam_ParamType_TYPE_STRING: IMTConParam_ParamType = 0;
pub const IMTConParam_ParamType_TYPE_INT: IMTConParam_ParamType = 1;
pub const IMTConParam_ParamType_TYPE_FLOAT: IMTConParam_ParamType = 2;
pub const IMTConParam_ParamType_TYPE_TIME: IMTConParam_ParamType = 3;
pub const IMTConParam_ParamType_TYPE_DATE: IMTConParam_ParamType = 4;
pub const IMTConParam_ParamType_TYPE_DATETIME: IMTConParam_ParamType = 5;
pub const IMTConParam_ParamType_TYPE_GROUPS: IMTConParam_ParamType = 6;
pub const IMTConParam_ParamType_TYPE_SYMBOLS: IMTConParam_ParamType = 7;
pub const IMTConParam_ParamType_TYPE_FIRST: IMTConParam_ParamType = 0;
pub const IMTConParam_ParamType_TYPE_LAST: IMTConParam_ParamType = 7;
pub type IMTConParam_ParamType = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConParam"][::std::mem::size_of::<IMTConParam>() - 8usize];
    ["Alignment of IMTConParam"][::std::mem::align_of::<IMTConParam>() - 8usize];
};
#[repr(C)]
pub struct IMTConPluginModule__bindgen_vtable {
    pub IMTConPluginModule_Release: unsafe extern "C" fn(this: *mut IMTConPluginModule),
    pub IMTConPluginModule_Assign: unsafe extern "C" fn(
        this: *mut IMTConPluginModule,
        param: *const IMTConPluginModule,
    ) -> MTAPIRES,
    pub IMTConPluginModule_Clear: unsafe extern "C" fn(this: *mut IMTConPluginModule) -> MTAPIRES,
    pub IMTConPluginModule_Name: unsafe extern "C" fn(this: *const IMTConPluginModule) -> LPCWSTR,
    pub IMTConPluginModule_Vendor: unsafe extern "C" fn(this: *const IMTConPluginModule) -> LPCWSTR,
    pub IMTConPluginModule_Description:
        unsafe extern "C" fn(this: *const IMTConPluginModule) -> LPCWSTR,
    pub IMTConPluginModule_Module: unsafe extern "C" fn(this: *const IMTConPluginModule) -> LPCWSTR,
    pub IMTConPluginModule_Server: unsafe extern "C" fn(this: *const IMTConPluginModule) -> UINT64,
    pub IMTConPluginModule_Version: unsafe extern "C" fn(this: *const IMTConPluginModule) -> UINT,
    pub IMTConPluginModule_VersionAPI:
        unsafe extern "C" fn(this: *const IMTConPluginModule) -> UINT,
    pub IMTConPluginModule_ParameterTotal:
        unsafe extern "C" fn(this: *const IMTConPluginModule) -> UINT,
    pub IMTConPluginModule_ParameterNext: unsafe extern "C" fn(
        this: *const IMTConPluginModule,
        pos: UINT,
        param: *mut IMTConParam,
    ) -> MTAPIRES,
    pub IMTConPluginModule_ParameterGet: unsafe extern "C" fn(
        this: *const IMTConPluginModule,
        name: LPCWSTR,
        param: *mut IMTConParam,
    ) -> MTAPIRES,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConPluginModule {
    pub vtable_: *const IMTConPluginModule__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConPluginModule"][::std::mem::size_of::<IMTConPluginModule>() - 8usize];
    ["Alignment of IMTConPluginModule"][::std::mem::align_of::<IMTConPluginModule>() - 8usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct MTLogRecord {
    pub flags: UINT,
    pub code: INT,
    pub type_: UINT,
    pub datetime: INT64,
    pub source: [u16; 64usize],
    pub message: [u16; 512usize],
    pub datetime_msc: INT64,
    pub reserved: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MTLogRecord"][::std::mem::size_of::<MTLogRecord>() - 1188usize];
    ["Alignment of MTLogRecord"][::std::mem::align_of::<MTLogRecord>() - 1usize];
    ["Offset of field: MTLogRecord::flags"][::std::mem::offset_of!(MTLogRecord, flags) - 0usize];
    ["Offset of field: MTLogRecord::code"][::std::mem::offset_of!(MTLogRecord, code) - 4usize];
    ["Offset of field: MTLogRecord::type_"][::std::mem::offset_of!(MTLogRecord, type_) - 8usize];
    ["Offset of field: MTLogRecord::datetime"]
        [::std::mem::offset_of!(MTLogRecord, datetime) - 12usize];
    ["Offset of field: MTLogRecord::source"][::std::mem::offset_of!(MTLogRecord, source) - 20usize];
    ["Offset of field: MTLogRecord::message"]
        [::std::mem::offset_of!(MTLogRecord, message) - 148usize];
    ["Offset of field: MTLogRecord::datetime_msc"]
        [::std::mem::offset_of!(MTLogRecord, datetime_msc) - 1172usize];
    ["Offset of field: MTLogRecord::reserved"]
        [::std::mem::offset_of!(MTLogRecord, reserved) - 1180usize];
};
#[repr(C)]
pub struct IMTServerSink__bindgen_vtable {
    pub IMTServerSink_OnServerLog: unsafe extern "C" fn(
        this: *mut IMTServerSink,
        code: INT,
        t: UINT,
        datetime_msc: INT64,
        source: LPCWSTR,
        message: LPCWSTR,
    ),
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMTServerSink {
    pub vtable_: *const IMTServerSink__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTServerSink"][::std::mem::size_of::<IMTServerSink>() - 8usize];
    ["Alignment of IMTServerSink"][::std::mem::align_of::<IMTServerSink>() - 8usize];
};
#[repr(C)]
pub struct IMTConPlugin__bindgen_vtable {
    pub IMTConPlugin_Release: unsafe extern "C" fn(this: *mut IMTConPlugin),
    pub IMTConPlugin_Assign:
        unsafe extern "C" fn(this: *mut IMTConPlugin, param: *const IMTConPlugin) -> MTAPIRES,
    pub IMTConPlugin_Clear: unsafe extern "C" fn(this: *mut IMTConPlugin) -> MTAPIRES,
    pub IMTConPlugin_Name1:
        unsafe extern "C" fn(this: *mut IMTConPlugin, name: LPCWSTR) -> MTAPIRES,
    pub IMTConPlugin_Name: unsafe extern "C" fn(this: *const IMTConPlugin) -> LPCWSTR,
    pub IMTConPlugin_Server1:
        unsafe extern "C" fn(this: *mut IMTConPlugin, server: UINT64) -> MTAPIRES,
    pub IMTConPlugin_Server: unsafe extern "C" fn(this: *const IMTConPlugin) -> UINT64,
    pub IMTConPlugin_Module1:
        unsafe extern "C" fn(this: *mut IMTConPlugin, name: LPCWSTR) -> MTAPIRES,
    pub IMTConPlugin_Module: unsafe extern "C" fn(this: *const IMTConPlugin) -> LPCWSTR,
    pub IMTConPlugin_Mode1: unsafe extern "C" fn(this: *mut IMTConPlugin, mode: UINT) -> MTAPIRES,
    pub IMTConPlugin_Mode: unsafe extern "C" fn(this: *const IMTConPlugin) -> UINT,
    pub IMTConPlugin_ParameterAdd:
        unsafe extern "C" fn(this: *mut IMTConPlugin, param: *mut IMTConParam) -> MTAPIRES,
    pub IMTConPlugin_ParameterUpdate: unsafe extern "C" fn(
        this: *mut IMTConPlugin,
        pos: UINT,
        param: *const IMTConParam,
    ) -> MTAPIRES,
    pub IMTConPlugin_ParameterDelete:
        unsafe extern "C" fn(this: *mut IMTConPlugin, pos: UINT) -> MTAPIRES,
    pub IMTConPlugin_ParameterClear: unsafe extern "C" fn(this: *mut IMTConPlugin) -> MTAPIRES,
    pub IMTConPlugin_ParameterShift: unsafe extern "C" fn(
        this: *mut IMTConPlugin,
        pos: UINT,
        shift: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTConPlugin_ParameterTotal: unsafe extern "C" fn(this: *const IMTConPlugin) -> UINT,
    pub IMTConPlugin_ParameterNext: unsafe extern "C" fn(
        this: *const IMTConPlugin,
        pos: UINT,
        param: *mut IMTConParam,
    ) -> MTAPIRES,
    pub IMTConPlugin_ParameterGet: unsafe extern "C" fn(
        this: *const IMTConPlugin,
        name: LPCWSTR,
        param: *mut IMTConParam,
    ) -> MTAPIRES,
    pub IMTConPlugin_Flags1: unsafe extern "C" fn(this: *mut IMTConPlugin, flags: UINT) -> MTAPIRES,
    pub IMTConPlugin_Flags: unsafe extern "C" fn(this: *const IMTConPlugin) -> UINT,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConPlugin {
    pub vtable_: *const IMTConPlugin__bindgen_vtable,
    pub impl_ptr: *mut dyn crate::interfaces::con_plugin::MT5ConPlugin,
}
pub const IMTConPlugin_EnPluginFlags_PLUGIN_FLAG_MAN_CONFIG: IMTConPlugin_EnPluginFlags = 1;
pub const IMTConPlugin_EnPluginFlags_PLUGIN_FLAG_PROFILING: IMTConPlugin_EnPluginFlags = 2;
pub const IMTConPlugin_EnPluginFlags_PLUGIN_FLAG_NONE: IMTConPlugin_EnPluginFlags = 0;
pub const IMTConPlugin_EnPluginFlags_PLUGIN_FLAG_ALL: IMTConPlugin_EnPluginFlags = 3;
pub type IMTConPlugin_EnPluginFlags = ::std::os::raw::c_int;
pub const IMTConPlugin_EnPluginMode_PLUGIN_DISABLED: IMTConPlugin_EnPluginMode = 0;
pub const IMTConPlugin_EnPluginMode_PLUGIN_ENABLED: IMTConPlugin_EnPluginMode = 1;
pub const IMTConPlugin_EnPluginMode_PLUGIN_FIRST: IMTConPlugin_EnPluginMode = 0;
pub const IMTConPlugin_EnPluginMode_PLUGIN_LAST: IMTConPlugin_EnPluginMode = 1;
pub type IMTConPlugin_EnPluginMode = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConPlugin"][::std::mem::size_of::<IMTConPlugin>() - 24usize];
    ["Alignment of IMTConPlugin"][::std::mem::align_of::<IMTConPlugin>() - 8usize];
};
#[repr(C)]
pub struct IMTConPluginSink__bindgen_vtable {}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMTConPluginSink {
    pub vtable_: *const IMTConPluginSink__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConPluginSink"][::std::mem::size_of::<IMTConPluginSink>() - 8usize];
    ["Alignment of IMTConPluginSink"][::std::mem::align_of::<IMTConPluginSink>() - 8usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct MTServerInfo {
    pub platform_name: [u16; 64usize],
    pub platform_owner: [u16; 128usize],
    pub server_version: UINT,
    pub server_build: UINT,
    pub server_type: UINT,
    pub server_id: UINT64,
    pub reserved: [UINT; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MTServerInfo"][::std::mem::size_of::<MTServerInfo>() - 532usize];
    ["Alignment of MTServerInfo"][::std::mem::align_of::<MTServerInfo>() - 1usize];
    ["Offset of field: MTServerInfo::platform_name"]
        [::std::mem::offset_of!(MTServerInfo, platform_name) - 0usize];
    ["Offset of field: MTServerInfo::platform_owner"]
        [::std::mem::offset_of!(MTServerInfo, platform_owner) - 128usize];
    ["Offset of field: MTServerInfo::server_version"]
        [::std::mem::offset_of!(MTServerInfo, server_version) - 384usize];
    ["Offset of field: MTServerInfo::server_build"]
        [::std::mem::offset_of!(MTServerInfo, server_build) - 388usize];
    ["Offset of field: MTServerInfo::server_type"]
        [::std::mem::offset_of!(MTServerInfo, server_type) - 392usize];
    ["Offset of field: MTServerInfo::server_id"]
        [::std::mem::offset_of!(MTServerInfo, server_id) - 396usize];
    ["Offset of field: MTServerInfo::reserved"]
        [::std::mem::offset_of!(MTServerInfo, reserved) - 404usize];
};
#[repr(C)]
pub struct IMTConHoliday__bindgen_vtable {
    pub IMTConHoliday_Release: unsafe extern "C" fn(this: *mut IMTConHoliday),
    pub IMTConHoliday_Assign:
        unsafe extern "C" fn(this: *mut IMTConHoliday, holiday: *const IMTConHoliday) -> MTAPIRES,
    pub IMTConHoliday_Clear: unsafe extern "C" fn(this: *mut IMTConHoliday) -> MTAPIRES,
    pub IMTConHoliday_Description1:
        unsafe extern "C" fn(this: *mut IMTConHoliday, descr: LPCWSTR) -> MTAPIRES,
    pub IMTConHoliday_Description: unsafe extern "C" fn(this: *const IMTConHoliday) -> LPCWSTR,
    pub IMTConHoliday_Mode1: unsafe extern "C" fn(this: *mut IMTConHoliday, mode: UINT) -> MTAPIRES,
    pub IMTConHoliday_Mode: unsafe extern "C" fn(this: *const IMTConHoliday) -> UINT,
    pub IMTConHoliday_Year1: unsafe extern "C" fn(this: *mut IMTConHoliday, year: UINT) -> MTAPIRES,
    pub IMTConHoliday_Year: unsafe extern "C" fn(this: *const IMTConHoliday) -> UINT,
    pub IMTConHoliday_Month1:
        unsafe extern "C" fn(this: *mut IMTConHoliday, month: UINT) -> MTAPIRES,
    pub IMTConHoliday_Month: unsafe extern "C" fn(this: *const IMTConHoliday) -> UINT,
    pub IMTConHoliday_Day1: unsafe extern "C" fn(this: *mut IMTConHoliday, day: UINT) -> MTAPIRES,
    pub IMTConHoliday_Day: unsafe extern "C" fn(this: *const IMTConHoliday) -> UINT,
    pub IMTConHoliday_WorkFrom1:
        unsafe extern "C" fn(this: *mut IMTConHoliday, from: UINT) -> MTAPIRES,
    pub IMTConHoliday_WorkFrom: unsafe extern "C" fn(this: *const IMTConHoliday) -> UINT,
    pub IMTConHoliday_WorkFromHours: unsafe extern "C" fn(this: *const IMTConHoliday) -> UINT,
    pub IMTConHoliday_WorkFromMinutes: unsafe extern "C" fn(this: *const IMTConHoliday) -> UINT,
    pub IMTConHoliday_WorkTo1:
        unsafe extern "C" fn(this: *mut IMTConHoliday, from: UINT) -> MTAPIRES,
    pub IMTConHoliday_WorkTo: unsafe extern "C" fn(this: *const IMTConHoliday) -> UINT,
    pub IMTConHoliday_WorkToHours: unsafe extern "C" fn(this: *const IMTConHoliday) -> UINT,
    pub IMTConHoliday_WorkToMinutes: unsafe extern "C" fn(this: *const IMTConHoliday) -> UINT,
    pub IMTConHoliday_SymbolAdd:
        unsafe extern "C" fn(this: *mut IMTConHoliday, path: LPCWSTR) -> MTAPIRES,
    pub IMTConHoliday_SymbolUpdate:
        unsafe extern "C" fn(this: *mut IMTConHoliday, pos: UINT, path: LPCWSTR) -> MTAPIRES,
    pub IMTConHoliday_SymbolDelete:
        unsafe extern "C" fn(this: *mut IMTConHoliday, pos: UINT) -> MTAPIRES,
    pub IMTConHoliday_SymbolClear: unsafe extern "C" fn(this: *mut IMTConHoliday) -> MTAPIRES,
    pub IMTConHoliday_SymbolShift: unsafe extern "C" fn(
        this: *mut IMTConHoliday,
        pos: UINT,
        shift: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTConHoliday_SymbolTotal: unsafe extern "C" fn(this: *const IMTConHoliday) -> UINT,
    pub IMTConHoliday_SymbolNext:
        unsafe extern "C" fn(this: *const IMTConHoliday, pos: UINT) -> LPCWSTR,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConHoliday {
    pub vtable_: *const IMTConHoliday__bindgen_vtable,
}
pub const IMTConHoliday_EnHolidayMode_HOLIDAY_DISABLED: IMTConHoliday_EnHolidayMode = 0;
pub const IMTConHoliday_EnHolidayMode_HOLIDAY_ENABLED: IMTConHoliday_EnHolidayMode = 1;
pub const IMTConHoliday_EnHolidayMode_HOLIDAY_FIRST: IMTConHoliday_EnHolidayMode = 0;
pub const IMTConHoliday_EnHolidayMode_HOLIDAY_LAST: IMTConHoliday_EnHolidayMode = 1;
pub type IMTConHoliday_EnHolidayMode = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConHoliday"][::std::mem::size_of::<IMTConHoliday>() - 8usize];
    ["Alignment of IMTConHoliday"][::std::mem::align_of::<IMTConHoliday>() - 8usize];
};
#[repr(C)]
pub struct IMTConHolidaySink__bindgen_vtable {}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMTConHolidaySink {
    pub vtable_: *const IMTConHolidaySink__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConHolidaySink"][::std::mem::size_of::<IMTConHolidaySink>() - 8usize];
    ["Alignment of IMTConHolidaySink"][::std::mem::align_of::<IMTConHolidaySink>() - 8usize];
};
#[repr(C)]
pub struct IMTConFirewall__bindgen_vtable {
    pub IMTConFirewall_Release: unsafe extern "C" fn(this: *mut IMTConFirewall),
    pub IMTConFirewall_Assign:
        unsafe extern "C" fn(this: *mut IMTConFirewall, param: *const IMTConFirewall) -> MTAPIRES,
    pub IMTConFirewall_Clear: unsafe extern "C" fn(this: *mut IMTConFirewall) -> MTAPIRES,
    pub IMTConFirewall_Action1:
        unsafe extern "C" fn(this: *mut IMTConFirewall, action: UINT) -> MTAPIRES,
    pub IMTConFirewall_Action: unsafe extern "C" fn(this: *const IMTConFirewall) -> UINT,
    pub IMTConFirewall_From1:
        unsafe extern "C" fn(this: *mut IMTConFirewall, name: LPCWSTR) -> MTAPIRES,
    pub IMTConFirewall_From: unsafe extern "C" fn(this: *const IMTConFirewall) -> LPCWSTR,
    pub IMTConFirewall_To1:
        unsafe extern "C" fn(this: *mut IMTConFirewall, value: LPCWSTR) -> MTAPIRES,
    pub IMTConFirewall_To: unsafe extern "C" fn(this: *const IMTConFirewall) -> LPCWSTR,
    pub IMTConFirewall_Comment1:
        unsafe extern "C" fn(this: *mut IMTConFirewall, comment: LPCWSTR) -> MTAPIRES,
    pub IMTConFirewall_Comment: unsafe extern "C" fn(this: *const IMTConFirewall) -> LPCWSTR,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConFirewall {
    pub vtable_: *const IMTConFirewall__bindgen_vtable,
}
pub const IMTConFirewall_EnAction_ACCESS_BLOCK: IMTConFirewall_EnAction = 0;
pub const IMTConFirewall_EnAction_ACCESS_PERMIT: IMTConFirewall_EnAction = 1;
pub const IMTConFirewall_EnAction_ACCESS_WHITELIST: IMTConFirewall_EnAction = 2;
pub const IMTConFirewall_EnAction_ACCESS_FIRST: IMTConFirewall_EnAction = 0;
pub const IMTConFirewall_EnAction_ACCESS_LAST: IMTConFirewall_EnAction = 2;
pub type IMTConFirewall_EnAction = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConFirewall"][::std::mem::size_of::<IMTConFirewall>() - 8usize];
    ["Alignment of IMTConFirewall"][::std::mem::align_of::<IMTConFirewall>() - 8usize];
};
#[repr(C)]
pub struct IMTConFirewallSink__bindgen_vtable {}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMTConFirewallSink {
    pub vtable_: *const IMTConFirewallSink__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConFirewallSink"][::std::mem::size_of::<IMTConFirewallSink>() - 8usize];
    ["Alignment of IMTConFirewallSink"][::std::mem::align_of::<IMTConFirewallSink>() - 8usize];
};
#[repr(C)]
pub struct IMTConSymbolSession__bindgen_vtable {
    pub IMTConSymbolSession_Release: unsafe extern "C" fn(this: *mut IMTConSymbolSession),
    pub IMTConSymbolSession_Assign: unsafe extern "C" fn(
        this: *mut IMTConSymbolSession,
        symbol: *const IMTConSymbolSession,
    ) -> MTAPIRES,
    pub IMTConSymbolSession_Clear: unsafe extern "C" fn(this: *mut IMTConSymbolSession) -> MTAPIRES,
    pub IMTConSymbolSession_Open1:
        unsafe extern "C" fn(this: *mut IMTConSymbolSession, open: UINT) -> MTAPIRES,
    pub IMTConSymbolSession_Open: unsafe extern "C" fn(this: *const IMTConSymbolSession) -> UINT,
    pub IMTConSymbolSession_OpenHours:
        unsafe extern "C" fn(this: *const IMTConSymbolSession) -> UINT,
    pub IMTConSymbolSession_OpenMinutes:
        unsafe extern "C" fn(this: *const IMTConSymbolSession) -> UINT,
    pub IMTConSymbolSession_Close1:
        unsafe extern "C" fn(this: *mut IMTConSymbolSession, close: UINT) -> MTAPIRES,
    pub IMTConSymbolSession_Close: unsafe extern "C" fn(this: *const IMTConSymbolSession) -> UINT,
    pub IMTConSymbolSession_CloseHours:
        unsafe extern "C" fn(this: *const IMTConSymbolSession) -> UINT,
    pub IMTConSymbolSession_CloseMinutes:
        unsafe extern "C" fn(this: *const IMTConSymbolSession) -> UINT,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConSymbolSession {
    pub vtable_: *const IMTConSymbolSession__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConSymbolSession"][::std::mem::size_of::<IMTConSymbolSession>() - 8usize];
    ["Alignment of IMTConSymbolSession"][::std::mem::align_of::<IMTConSymbolSession>() - 8usize];
};
#[repr(C)]
pub struct IMTConSymbol__bindgen_vtable {
    pub IMTConSymbol_Release: unsafe extern "C" fn(this: *mut IMTConSymbol),
    pub IMTConSymbol_Assign:
        unsafe extern "C" fn(this: *mut IMTConSymbol, symbol: *const IMTConSymbol) -> MTAPIRES,
    pub IMTConSymbol_Clear: unsafe extern "C" fn(this: *mut IMTConSymbol) -> MTAPIRES,
    pub IMTConSymbol_Symbol1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, symbol: LPCWSTR) -> MTAPIRES,
    pub IMTConSymbol_Symbol: unsafe extern "C" fn(this: *const IMTConSymbol) -> LPCWSTR,
    pub IMTConSymbol_Path1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, path: LPCWSTR) -> MTAPIRES,
    pub IMTConSymbol_Path: unsafe extern "C" fn(this: *const IMTConSymbol) -> LPCWSTR,
    pub IMTConSymbol_ISIN1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, isin: LPCWSTR) -> MTAPIRES,
    pub IMTConSymbol_ISIN: unsafe extern "C" fn(this: *const IMTConSymbol) -> LPCWSTR,
    pub IMTConSymbol_Description1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, descr: LPCWSTR) -> MTAPIRES,
    pub IMTConSymbol_Description: unsafe extern "C" fn(this: *const IMTConSymbol) -> LPCWSTR,
    pub IMTConSymbol_International1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, intern: LPCWSTR) -> MTAPIRES,
    pub IMTConSymbol_International: unsafe extern "C" fn(this: *const IMTConSymbol) -> LPCWSTR,
    pub IMTConSymbol_Basis1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, basis: LPCWSTR) -> MTAPIRES,
    pub IMTConSymbol_Basis: unsafe extern "C" fn(this: *const IMTConSymbol) -> LPCWSTR,
    pub IMTConSymbol_Source1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, source: LPCWSTR) -> MTAPIRES,
    pub IMTConSymbol_Source: unsafe extern "C" fn(this: *const IMTConSymbol) -> LPCWSTR,
    pub IMTConSymbol_Page1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, page: LPCWSTR) -> MTAPIRES,
    pub IMTConSymbol_Page: unsafe extern "C" fn(this: *const IMTConSymbol) -> LPCWSTR,
    pub IMTConSymbol_CurrencyBase1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, currency: LPCWSTR) -> MTAPIRES,
    pub IMTConSymbol_CurrencyBase: unsafe extern "C" fn(this: *const IMTConSymbol) -> LPCWSTR,
    pub IMTConSymbol_CurrencyBaseDigits: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_CurrencyProfit1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, currency: LPCWSTR) -> MTAPIRES,
    pub IMTConSymbol_CurrencyProfit: unsafe extern "C" fn(this: *const IMTConSymbol) -> LPCWSTR,
    pub IMTConSymbol_CurrencyProfitDigits: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_CurrencyMargin1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, currency: LPCWSTR) -> MTAPIRES,
    pub IMTConSymbol_CurrencyMargin: unsafe extern "C" fn(this: *const IMTConSymbol) -> LPCWSTR,
    pub IMTConSymbol_CurrencyMarginDigits: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_Color1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, color: COLORREF) -> MTAPIRES,
    pub IMTConSymbol_Color: unsafe extern "C" fn(this: *const IMTConSymbol) -> COLORREF,
    pub IMTConSymbol_ColorBackground1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, color: COLORREF) -> MTAPIRES,
    pub IMTConSymbol_ColorBackground: unsafe extern "C" fn(this: *const IMTConSymbol) -> COLORREF,
    pub IMTConSymbol_Digits1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, digits: UINT) -> MTAPIRES,
    pub IMTConSymbol_Digits: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_Point: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_Multiply: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_TickFlags1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, flags: UINT64) -> MTAPIRES,
    pub IMTConSymbol_TickFlags: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT64,
    pub IMTConSymbol_TickBookDepth1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, depth: UINT) -> MTAPIRES,
    pub IMTConSymbol_TickBookDepth: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_FilterSoft1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, filter: UINT) -> MTAPIRES,
    pub IMTConSymbol_FilterSoft: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_FilterSoftTicks1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, ticks: UINT) -> MTAPIRES,
    pub IMTConSymbol_FilterSoftTicks: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_FilterHard1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, filter: UINT) -> MTAPIRES,
    pub IMTConSymbol_FilterHard: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_FilterHardTicks1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, ticks: UINT) -> MTAPIRES,
    pub IMTConSymbol_FilterHardTicks: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_FilterDiscard1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, ticks: UINT) -> MTAPIRES,
    pub IMTConSymbol_FilterDiscard: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_FilterSpreadMax1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, spread: UINT) -> MTAPIRES,
    pub IMTConSymbol_FilterSpreadMax: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_FilterSpreadMin1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, spread: UINT) -> MTAPIRES,
    pub IMTConSymbol_FilterSpreadMin: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_TradeMode1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, mode: UINT) -> MTAPIRES,
    pub IMTConSymbol_TradeMode: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_CalcMode1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, mode: UINT) -> MTAPIRES,
    pub IMTConSymbol_CalcMode: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_ExecMode1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, mode: UINT) -> MTAPIRES,
    pub IMTConSymbol_ExecMode: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_GTCMode1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, mode: UINT) -> MTAPIRES,
    pub IMTConSymbol_GTCMode: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_FillFlags1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, flags: UINT) -> MTAPIRES,
    pub IMTConSymbol_FillFlags: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_ExpirFlags1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, flags: UINT) -> MTAPIRES,
    pub IMTConSymbol_ExpirFlags: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_Spread1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, spread: UINT) -> MTAPIRES,
    pub IMTConSymbol_Spread: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_SpreadBalance1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, spread: INT) -> MTAPIRES,
    pub IMTConSymbol_SpreadBalance: unsafe extern "C" fn(this: *const IMTConSymbol) -> INT,
    pub IMTConSymbol_SpreadDiff1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, diff: INT) -> MTAPIRES,
    pub IMTConSymbol_SpreadDiff: unsafe extern "C" fn(this: *const IMTConSymbol) -> INT,
    pub IMTConSymbol_SpreadDiffBalance1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, spread: INT) -> MTAPIRES,
    pub IMTConSymbol_SpreadDiffBalance: unsafe extern "C" fn(this: *const IMTConSymbol) -> INT,
    pub IMTConSymbol_TickValue1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, value: f64) -> MTAPIRES,
    pub IMTConSymbol_TickValue: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_TickSize1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, size: f64) -> MTAPIRES,
    pub IMTConSymbol_TickSize: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_ContractSize1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, size: f64) -> MTAPIRES,
    pub IMTConSymbol_ContractSize: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_StopsLevel1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, level: INT) -> MTAPIRES,
    pub IMTConSymbol_StopsLevel: unsafe extern "C" fn(this: *const IMTConSymbol) -> INT,
    pub IMTConSymbol_FreezeLevel1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, level: INT) -> MTAPIRES,
    pub IMTConSymbol_FreezeLevel: unsafe extern "C" fn(this: *const IMTConSymbol) -> INT,
    pub IMTConSymbol_QuotesTimeout1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, timeout: UINT) -> MTAPIRES,
    pub IMTConSymbol_QuotesTimeout: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_VolumeMin1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, volume: UINT64) -> MTAPIRES,
    pub IMTConSymbol_VolumeMin: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT64,
    pub IMTConSymbol_VolumeMax1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, volume: UINT64) -> MTAPIRES,
    pub IMTConSymbol_VolumeMax: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT64,
    pub IMTConSymbol_VolumeStep1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, volume: UINT64) -> MTAPIRES,
    pub IMTConSymbol_VolumeStep: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT64,
    pub IMTConSymbol_VolumeLimit1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, volume: UINT64) -> MTAPIRES,
    pub IMTConSymbol_VolumeLimit: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT64,
    pub IMTConSymbol_MarginFlags1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, mode: UINT) -> MTAPIRES,
    pub IMTConSymbol_MarginFlags: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_MarginInitial1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, margin: f64) -> MTAPIRES,
    pub IMTConSymbol_MarginInitial: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_MarginMaintenance1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, margin: f64) -> MTAPIRES,
    pub IMTConSymbol_MarginMaintenance: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_MarginLong1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, margin: f64) -> MTAPIRES,
    pub IMTConSymbol_MarginLong: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_MarginShort1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, margin: f64) -> MTAPIRES,
    pub IMTConSymbol_MarginShort: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_MarginLimit1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, margin: f64) -> MTAPIRES,
    pub IMTConSymbol_MarginLimit: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_MarginStop1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, margin: f64) -> MTAPIRES,
    pub IMTConSymbol_MarginStop: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_MarginStopLimit1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, margin: f64) -> MTAPIRES,
    pub IMTConSymbol_MarginStopLimit: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_SwapMode1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, mode: UINT) -> MTAPIRES,
    pub IMTConSymbol_SwapMode: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_SwapLong1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, swap: f64) -> MTAPIRES,
    pub IMTConSymbol_SwapLong: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_SwapShort1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, swap: f64) -> MTAPIRES,
    pub IMTConSymbol_SwapShort: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_Swap3Day1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, day: UINT) -> MTAPIRES,
    pub IMTConSymbol_Swap3Day: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_TimeStart1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, start: INT64) -> MTAPIRES,
    pub IMTConSymbol_TimeStart: unsafe extern "C" fn(this: *const IMTConSymbol) -> INT64,
    pub IMTConSymbol_TimeExpiration1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, expiration: INT64) -> MTAPIRES,
    pub IMTConSymbol_TimeExpiration: unsafe extern "C" fn(this: *const IMTConSymbol) -> INT64,
    pub IMTConSymbol_SessionQuoteAdd: unsafe extern "C" fn(
        this: *mut IMTConSymbol,
        wday: UINT,
        symbol: *mut IMTConSymbolSession,
    ) -> MTAPIRES,
    pub IMTConSymbol_SessionQuoteUpdate: unsafe extern "C" fn(
        this: *mut IMTConSymbol,
        wday: UINT,
        pos: UINT,
        session: *const IMTConSymbolSession,
    ) -> MTAPIRES,
    pub IMTConSymbol_SessionQuoteDelete:
        unsafe extern "C" fn(this: *mut IMTConSymbol, wday: UINT, pos: UINT) -> MTAPIRES,
    pub IMTConSymbol_SessionQuoteClear:
        unsafe extern "C" fn(this: *mut IMTConSymbol, wday: UINT) -> MTAPIRES,
    pub IMTConSymbol_SessionQuoteShift: unsafe extern "C" fn(
        this: *mut IMTConSymbol,
        wday: UINT,
        pos: UINT,
        shift: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTConSymbol_SessionQuoteTotal:
        unsafe extern "C" fn(this: *const IMTConSymbol, wday: UINT) -> UINT,
    pub IMTConSymbol_SessionQuoteNext: unsafe extern "C" fn(
        this: *const IMTConSymbol,
        wday: UINT,
        pos: UINT,
        session: *mut IMTConSymbolSession,
    ) -> MTAPIRES,
    pub IMTConSymbol_SessionTradeAdd: unsafe extern "C" fn(
        this: *mut IMTConSymbol,
        wday: UINT,
        symbol: *mut IMTConSymbolSession,
    ) -> MTAPIRES,
    pub IMTConSymbol_SessionTradeUpdate: unsafe extern "C" fn(
        this: *mut IMTConSymbol,
        wday: UINT,
        pos: UINT,
        session: *const IMTConSymbolSession,
    ) -> MTAPIRES,
    pub IMTConSymbol_SessionTradeDelete:
        unsafe extern "C" fn(this: *mut IMTConSymbol, wday: UINT, pos: UINT) -> MTAPIRES,
    pub IMTConSymbol_SessionTradeClear:
        unsafe extern "C" fn(this: *mut IMTConSymbol, wday: UINT) -> MTAPIRES,
    pub IMTConSymbol_SessionTradeShift: unsafe extern "C" fn(
        this: *mut IMTConSymbol,
        wday: UINT,
        pos: UINT,
        shift: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTConSymbol_SessionTradeTotal:
        unsafe extern "C" fn(this: *const IMTConSymbol, wday: UINT) -> UINT,
    pub IMTConSymbol_SessionTradeNext: unsafe extern "C" fn(
        this: *const IMTConSymbol,
        wday: UINT,
        pos: UINT,
        session: *mut IMTConSymbolSession,
    ) -> MTAPIRES,
    pub IMTConSymbol_REFlags1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, flags: UINT) -> MTAPIRES,
    pub IMTConSymbol_REFlags: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_RETimeout1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, timeout: UINT) -> MTAPIRES,
    pub IMTConSymbol_RETimeout: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_IECheckMode1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, mode: UINT) -> MTAPIRES,
    pub IMTConSymbol_IECheckMode: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_IETimeout1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, timeout: UINT) -> MTAPIRES,
    pub IMTConSymbol_IETimeout: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_IESlipProfit1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, slippage: UINT) -> MTAPIRES,
    pub IMTConSymbol_IESlipProfit: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_IESlipLosing1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, slippage: UINT) -> MTAPIRES,
    pub IMTConSymbol_IESlipLosing: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_IEVolumeMax1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, volume: UINT64) -> MTAPIRES,
    pub IMTConSymbol_IEVolumeMax: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT64,
    pub IMTConSymbol_PriceSettle1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, price: f64) -> MTAPIRES,
    pub IMTConSymbol_PriceSettle: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_PriceLimitMax1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, price: f64) -> MTAPIRES,
    pub IMTConSymbol_PriceLimitMax: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_PriceLimitMin1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, price: f64) -> MTAPIRES,
    pub IMTConSymbol_PriceLimitMin: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_TradeFlags1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, flags: UINT64) -> MTAPIRES,
    pub IMTConSymbol_TradeFlags: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT64,
    pub IMTConSymbol_OrderFlags1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, flags: UINT) -> MTAPIRES,
    pub IMTConSymbol_OrderFlags: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_MarginRateInitial1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, type_: UINT, margin_rate: f64) -> MTAPIRES,
    pub IMTConSymbol_MarginRateInitial:
        unsafe extern "C" fn(this: *const IMTConSymbol, type_: UINT) -> f64,
    pub IMTConSymbol_MarginRateMaintenance1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, type_: UINT, margin_rate: f64) -> MTAPIRES,
    pub IMTConSymbol_MarginRateMaintenance:
        unsafe extern "C" fn(this: *const IMTConSymbol, type_: UINT) -> f64,
    pub IMTConSymbol_OptionsMode1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, mode: UINT) -> MTAPIRES,
    pub IMTConSymbol_OptionsMode: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_PriceStrike1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, price: f64) -> MTAPIRES,
    pub IMTConSymbol_PriceStrike: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_MarginRateLiquidity1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, margin_rate: f64) -> MTAPIRES,
    pub IMTConSymbol_MarginRateLiquidity: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_FaceValue1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, value: f64) -> MTAPIRES,
    pub IMTConSymbol_FaceValue: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_AccruedInterest1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, interest: f64) -> MTAPIRES,
    pub IMTConSymbol_AccruedInterest: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_SpliceType1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, type_: UINT) -> MTAPIRES,
    pub IMTConSymbol_SpliceType: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_SpliceTimeType1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, time_type: UINT) -> MTAPIRES,
    pub IMTConSymbol_SpliceTimeType: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_SpliceTimeDays1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, days: UINT) -> MTAPIRES,
    pub IMTConSymbol_SpliceTimeDays: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_MarginHedged1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, margin: f64) -> MTAPIRES,
    pub IMTConSymbol_MarginHedged: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_MarginRateCurrency1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, margin_rate: f64) -> MTAPIRES,
    pub IMTConSymbol_MarginRateCurrency: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_FilterGap1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, gap: UINT) -> MTAPIRES,
    pub IMTConSymbol_FilterGap: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_FilterGapTicks1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, ticks: UINT) -> MTAPIRES,
    pub IMTConSymbol_FilterGapTicks: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_ChartMode1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, mode: UINT) -> MTAPIRES,
    pub IMTConSymbol_ChartMode: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_CurrencyBaseDigitsSet:
        unsafe extern "C" fn(this: *mut IMTConSymbol, digits: UINT) -> MTAPIRES,
    pub IMTConSymbol_CurrencyProfitDigitsSet:
        unsafe extern "C" fn(this: *mut IMTConSymbol, digits: UINT) -> MTAPIRES,
    pub IMTConSymbol_CurrencyMarginDigitsSet:
        unsafe extern "C" fn(this: *mut IMTConSymbol, digits: UINT) -> MTAPIRES,
    pub IMTConSymbol_IEFlags1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, flags: UINT) -> MTAPIRES,
    pub IMTConSymbol_IEFlags: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_VolumeMinExt1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, volume: UINT64) -> MTAPIRES,
    pub IMTConSymbol_VolumeMinExt: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT64,
    pub IMTConSymbol_VolumeMaxExt1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, volume: UINT64) -> MTAPIRES,
    pub IMTConSymbol_VolumeMaxExt: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT64,
    pub IMTConSymbol_VolumeStepExt1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, volume: UINT64) -> MTAPIRES,
    pub IMTConSymbol_VolumeStepExt: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT64,
    pub IMTConSymbol_VolumeLimitExt1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, volume: UINT64) -> MTAPIRES,
    pub IMTConSymbol_VolumeLimitExt: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT64,
    pub IMTConSymbol_IEVolumeMaxExt1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, volume: UINT64) -> MTAPIRES,
    pub IMTConSymbol_IEVolumeMaxExt: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT64,
    pub IMTConSymbol_Category1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, category: LPCWSTR) -> MTAPIRES,
    pub IMTConSymbol_Category: unsafe extern "C" fn(this: *const IMTConSymbol) -> LPCWSTR,
    pub IMTConSymbol_Exchange1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, exchange: LPCWSTR) -> MTAPIRES,
    pub IMTConSymbol_Exchange: unsafe extern "C" fn(this: *const IMTConSymbol) -> LPCWSTR,
    pub IMTConSymbol_CFI1: unsafe extern "C" fn(this: *mut IMTConSymbol, cfi: LPCWSTR) -> MTAPIRES,
    pub IMTConSymbol_CFI: unsafe extern "C" fn(this: *const IMTConSymbol) -> LPCWSTR,
    pub IMTConSymbol_Sector1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, sector: UINT) -> MTAPIRES,
    pub IMTConSymbol_Sector: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_Industry1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, industry: UINT) -> MTAPIRES,
    pub IMTConSymbol_Industry: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_Country1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, country: LPCWSTR) -> MTAPIRES,
    pub IMTConSymbol_Country: unsafe extern "C" fn(this: *const IMTConSymbol) -> LPCWSTR,
    pub IMTConSymbol_SubscriptionsDelay1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, delay: UINT) -> MTAPIRES,
    pub IMTConSymbol_SubscriptionsDelay: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_SwapYearDays1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, days: UINT) -> MTAPIRES,
    pub IMTConSymbol_SwapYearDays: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_SwapFlags1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, flags: UINT) -> MTAPIRES,
    pub IMTConSymbol_SwapFlags: unsafe extern "C" fn(this: *const IMTConSymbol) -> UINT,
    pub IMTConSymbol_SwapRateSunday1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, rate: f64) -> MTAPIRES,
    pub IMTConSymbol_SwapRateSunday: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_SwapRateMonday1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, rate: f64) -> MTAPIRES,
    pub IMTConSymbol_SwapRateMonday: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_SwapRateTuesday1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, rate: f64) -> MTAPIRES,
    pub IMTConSymbol_SwapRateTuesday: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_SwapRateWednesday1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, rate: f64) -> MTAPIRES,
    pub IMTConSymbol_SwapRateWednesday: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_SwapRateThursday1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, rate: f64) -> MTAPIRES,
    pub IMTConSymbol_SwapRateThursday: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_SwapRateFriday1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, rate: f64) -> MTAPIRES,
    pub IMTConSymbol_SwapRateFriday: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
    pub IMTConSymbol_SwapRateSaturday1:
        unsafe extern "C" fn(this: *mut IMTConSymbol, rate: f64) -> MTAPIRES,
    pub IMTConSymbol_SwapRateSaturday: unsafe extern "C" fn(this: *const IMTConSymbol) -> f64,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConSymbol {
    pub vtable_: *const IMTConSymbol__bindgen_vtable,
    pub impl_ptr: *mut dyn crate::interfaces::con_symbol::MTConSymbol,
}
pub const IMTConSymbol_EnSectors_SECTOR_UNDEFINED: IMTConSymbol_EnSectors = 0;
pub const IMTConSymbol_EnSectors_SECTOR_BASIC_MATERIALS: IMTConSymbol_EnSectors = 1;
pub const IMTConSymbol_EnSectors_SECTOR_COMMUNICATION_SERVICES: IMTConSymbol_EnSectors = 2;
pub const IMTConSymbol_EnSectors_SECTOR_CONSUMER_CYCLICAL: IMTConSymbol_EnSectors = 3;
pub const IMTConSymbol_EnSectors_SECTOR_CONSUMER_DEFENSIVE: IMTConSymbol_EnSectors = 4;
pub const IMTConSymbol_EnSectors_SECTOR_ENERGY: IMTConSymbol_EnSectors = 5;
pub const IMTConSymbol_EnSectors_SECTOR_FINANCIAL: IMTConSymbol_EnSectors = 6;
pub const IMTConSymbol_EnSectors_SECTOR_HEALTHCARE: IMTConSymbol_EnSectors = 7;
pub const IMTConSymbol_EnSectors_SECTOR_INDUSTRIALS: IMTConSymbol_EnSectors = 8;
pub const IMTConSymbol_EnSectors_SECTOR_REAL_ESTATE: IMTConSymbol_EnSectors = 9;
pub const IMTConSymbol_EnSectors_SECTOR_TECHNOLOGY: IMTConSymbol_EnSectors = 10;
pub const IMTConSymbol_EnSectors_SECTOR_UTILITIES: IMTConSymbol_EnSectors = 11;
pub const IMTConSymbol_EnSectors_SECTOR_CURRENCY: IMTConSymbol_EnSectors = 12;
pub const IMTConSymbol_EnSectors_SECTOR_CURRENCY_CRYPTO: IMTConSymbol_EnSectors = 13;
pub const IMTConSymbol_EnSectors_SECTOR_INDEXES: IMTConSymbol_EnSectors = 14;
pub const IMTConSymbol_EnSectors_SECTOR_COMMODITIES: IMTConSymbol_EnSectors = 15;
pub const IMTConSymbol_EnSectors_SECTOR_FIRST: IMTConSymbol_EnSectors = 0;
pub const IMTConSymbol_EnSectors_SECTOR_LAST: IMTConSymbol_EnSectors = 15;
pub type IMTConSymbol_EnSectors = ::std::os::raw::c_int;
pub const IMTConSymbol_EnIndustries_INDUSTRY_UNDEFINED: IMTConSymbol_EnIndustries = 0;
pub const IMTConSymbol_EnIndustries_INDUSTRY_AGRICULTURAL_INPUTS: IMTConSymbol_EnIndustries = 1;
pub const IMTConSymbol_EnIndustries_INDUSTRY_ALUMINIUM: IMTConSymbol_EnIndustries = 2;
pub const IMTConSymbol_EnIndustries_INDUSTRY_BUILDING_MATERIALS: IMTConSymbol_EnIndustries = 3;
pub const IMTConSymbol_EnIndustries_INDUSTRY_CHEMICALS: IMTConSymbol_EnIndustries = 4;
pub const IMTConSymbol_EnIndustries_INDUSTRY_COKING_COAL: IMTConSymbol_EnIndustries = 5;
pub const IMTConSymbol_EnIndustries_INDUSTRY_COPPER: IMTConSymbol_EnIndustries = 6;
pub const IMTConSymbol_EnIndustries_INDUSTRY_GOLD: IMTConSymbol_EnIndustries = 7;
pub const IMTConSymbol_EnIndustries_INDUSTRY_LUMBER_WOOD: IMTConSymbol_EnIndustries = 8;
pub const IMTConSymbol_EnIndustries_INDUSTRY_INDUSTRIAL_METALS: IMTConSymbol_EnIndustries = 9;
pub const IMTConSymbol_EnIndustries_INDUSTRY_PRECIOUS_METALS: IMTConSymbol_EnIndustries = 10;
pub const IMTConSymbol_EnIndustries_INDUSTRY_PAPER: IMTConSymbol_EnIndustries = 11;
pub const IMTConSymbol_EnIndustries_INDUSTRY_SILVER: IMTConSymbol_EnIndustries = 12;
pub const IMTConSymbol_EnIndustries_INDUSTRY_SPECIALTY_CHEMICALS: IMTConSymbol_EnIndustries = 13;
pub const IMTConSymbol_EnIndustries_INDUSTRY_STEEL: IMTConSymbol_EnIndustries = 14;
pub const IMTConSymbol_EnIndustries_INDUSTRY_BASIC_MATERIALS_FIRST: IMTConSymbol_EnIndustries = 1;
pub const IMTConSymbol_EnIndustries_INDUSTRY_BASIC_MATERIALS_LAST: IMTConSymbol_EnIndustries = 14;
pub const IMTConSymbol_EnIndustries_INDUSTRY_BASIC_MATERIALS_END: IMTConSymbol_EnIndustries = 50;
pub const IMTConSymbol_EnIndustries_INDUSTRY_ADVERTISING: IMTConSymbol_EnIndustries = 51;
pub const IMTConSymbol_EnIndustries_INDUSTRY_BROADCASTING: IMTConSymbol_EnIndustries = 52;
pub const IMTConSymbol_EnIndustries_INDUSTRY_GAMING_MULTIMEDIA: IMTConSymbol_EnIndustries = 53;
pub const IMTConSymbol_EnIndustries_INDUSTRY_ENTERTAINMENT: IMTConSymbol_EnIndustries = 54;
pub const IMTConSymbol_EnIndustries_INDUSTRY_INTERNET_CONTENT: IMTConSymbol_EnIndustries = 55;
pub const IMTConSymbol_EnIndustries_INDUSTRY_PUBLISHING: IMTConSymbol_EnIndustries = 56;
pub const IMTConSymbol_EnIndustries_INDUSTRY_TELECOM: IMTConSymbol_EnIndustries = 57;
pub const IMTConSymbol_EnIndustries_INDUSTRY_COMMUNICATION_FIRST: IMTConSymbol_EnIndustries = 51;
pub const IMTConSymbol_EnIndustries_INDUSTRY_COMMUNICATION_LAST: IMTConSymbol_EnIndustries = 57;
pub const IMTConSymbol_EnIndustries_INDUSTRY_COMMUNICATION_END: IMTConSymbol_EnIndustries = 100;
pub const IMTConSymbol_EnIndustries_INDUSTRY_APPAREL_MANUFACTURING: IMTConSymbol_EnIndustries = 101;
pub const IMTConSymbol_EnIndustries_INDUSTRY_APPAREL_RETAIL: IMTConSymbol_EnIndustries = 102;
pub const IMTConSymbol_EnIndustries_INDUSTRY_AUTO_MANUFACTURERS: IMTConSymbol_EnIndustries = 103;
pub const IMTConSymbol_EnIndustries_INDUSTRY_AUTO_PARTS: IMTConSymbol_EnIndustries = 104;
pub const IMTConSymbol_EnIndustries_INDUSTRY_AUTO_DEALERSHIP: IMTConSymbol_EnIndustries = 105;
pub const IMTConSymbol_EnIndustries_INDUSTRY_DEPARTMENT_STORES: IMTConSymbol_EnIndustries = 106;
pub const IMTConSymbol_EnIndustries_INDUSTRY_FOOTWEAR_ACCESSORIES: IMTConSymbol_EnIndustries = 107;
pub const IMTConSymbol_EnIndustries_INDUSTRY_FURNISHINGS: IMTConSymbol_EnIndustries = 108;
pub const IMTConSymbol_EnIndustries_INDUSTRY_GAMBLING: IMTConSymbol_EnIndustries = 109;
pub const IMTConSymbol_EnIndustries_INDUSTRY_HOME_IMPROV_RETAIL: IMTConSymbol_EnIndustries = 110;
pub const IMTConSymbol_EnIndustries_INDUSTRY_INTERNET_RETAIL: IMTConSymbol_EnIndustries = 111;
pub const IMTConSymbol_EnIndustries_INDUSTRY_LEISURE: IMTConSymbol_EnIndustries = 112;
pub const IMTConSymbol_EnIndustries_INDUSTRY_LODGING: IMTConSymbol_EnIndustries = 113;
pub const IMTConSymbol_EnIndustries_INDUSTRY_LUXURY_GOODS: IMTConSymbol_EnIndustries = 114;
pub const IMTConSymbol_EnIndustries_INDUSTRY_PACKAGING_CONTAINERS: IMTConSymbol_EnIndustries = 115;
pub const IMTConSymbol_EnIndustries_INDUSTRY_PERSONAL_SERVICES: IMTConSymbol_EnIndustries = 116;
pub const IMTConSymbol_EnIndustries_INDUSTRY_RECREATIONAL_VEHICLES: IMTConSymbol_EnIndustries = 117;
pub const IMTConSymbol_EnIndustries_INDUSTRY_RESIDENT_CONSTRUCTION: IMTConSymbol_EnIndustries = 118;
pub const IMTConSymbol_EnIndustries_INDUSTRY_RESORTS_CASINOS: IMTConSymbol_EnIndustries = 119;
pub const IMTConSymbol_EnIndustries_INDUSTRY_RESTAURANTS: IMTConSymbol_EnIndustries = 120;
pub const IMTConSymbol_EnIndustries_INDUSTRY_SPECIALTY_RETAIL: IMTConSymbol_EnIndustries = 121;
pub const IMTConSymbol_EnIndustries_INDUSTRY_TEXTILE_MANUFACTURING: IMTConSymbol_EnIndustries = 122;
pub const IMTConSymbol_EnIndustries_INDUSTRY_TRAVEL_SERVICES: IMTConSymbol_EnIndustries = 123;
pub const IMTConSymbol_EnIndustries_INDUSTRY_CONSUMER_CYCL_FIRST: IMTConSymbol_EnIndustries = 101;
pub const IMTConSymbol_EnIndustries_INDUSTRY_CONSUMER_CYCL_LAST: IMTConSymbol_EnIndustries = 123;
pub const IMTConSymbol_EnIndustries_INDUSTRY_CONSUMER_CYCL_END: IMTConSymbol_EnIndustries = 150;
pub const IMTConSymbol_EnIndustries_INDUSTRY_BEVERAGES_BREWERS: IMTConSymbol_EnIndustries = 151;
pub const IMTConSymbol_EnIndustries_INDUSTRY_BEVERAGES_NON_ALCO: IMTConSymbol_EnIndustries = 152;
pub const IMTConSymbol_EnIndustries_INDUSTRY_BEVERAGES_WINERIES: IMTConSymbol_EnIndustries = 153;
pub const IMTConSymbol_EnIndustries_INDUSTRY_CONFECTIONERS: IMTConSymbol_EnIndustries = 154;
pub const IMTConSymbol_EnIndustries_INDUSTRY_DISCOUNT_STORES: IMTConSymbol_EnIndustries = 155;
pub const IMTConSymbol_EnIndustries_INDUSTRY_EDUCATION_TRAINIG: IMTConSymbol_EnIndustries = 156;
pub const IMTConSymbol_EnIndustries_INDUSTRY_FARM_PRODUCTS: IMTConSymbol_EnIndustries = 157;
pub const IMTConSymbol_EnIndustries_INDUSTRY_FOOD_DISTRIBUTION: IMTConSymbol_EnIndustries = 158;
pub const IMTConSymbol_EnIndustries_INDUSTRY_GROCERY_STORES: IMTConSymbol_EnIndustries = 159;
pub const IMTConSymbol_EnIndustries_INDUSTRY_HOUSEHOLD_PRODUCTS: IMTConSymbol_EnIndustries = 160;
pub const IMTConSymbol_EnIndustries_INDUSTRY_PACKAGED_FOODS: IMTConSymbol_EnIndustries = 161;
pub const IMTConSymbol_EnIndustries_INDUSTRY_TOBACCO: IMTConSymbol_EnIndustries = 162;
pub const IMTConSymbol_EnIndustries_INDUSTRY_CONSUMER_DEF_FIRST: IMTConSymbol_EnIndustries = 151;
pub const IMTConSymbol_EnIndustries_INDUSTRY_CONSUMER_DEF_LAST: IMTConSymbol_EnIndustries = 162;
pub const IMTConSymbol_EnIndustries_INDUSTRY_CONSUMER_DEF_END: IMTConSymbol_EnIndustries = 200;
pub const IMTConSymbol_EnIndustries_INDUSTRY_OIL_GAS_DRILLING: IMTConSymbol_EnIndustries = 201;
pub const IMTConSymbol_EnIndustries_INDUSTRY_OIL_GAS_EP: IMTConSymbol_EnIndustries = 202;
pub const IMTConSymbol_EnIndustries_INDUSTRY_OIL_GAS_EQUIPMENT: IMTConSymbol_EnIndustries = 203;
pub const IMTConSymbol_EnIndustries_INDUSTRY_OIL_GAS_INTEGRATED: IMTConSymbol_EnIndustries = 204;
pub const IMTConSymbol_EnIndustries_INDUSTRY_OIL_GAS_MIDSTREAM: IMTConSymbol_EnIndustries = 205;
pub const IMTConSymbol_EnIndustries_INDUSTRY_OIL_GAS_REFINING: IMTConSymbol_EnIndustries = 206;
pub const IMTConSymbol_EnIndustries_INDUSTRY_THERMAL_COAL: IMTConSymbol_EnIndustries = 207;
pub const IMTConSymbol_EnIndustries_INDUSTRY_URANIUM: IMTConSymbol_EnIndustries = 208;
pub const IMTConSymbol_EnIndustries_INDUSTRY_ENERGY_FIRST: IMTConSymbol_EnIndustries = 201;
pub const IMTConSymbol_EnIndustries_INDUSTRY_ENERGY_LAST: IMTConSymbol_EnIndustries = 208;
pub const IMTConSymbol_EnIndustries_INDUSTRY_ENERGY_END: IMTConSymbol_EnIndustries = 250;
pub const IMTConSymbol_EnIndustries_INDUSTRY_EXCHANGE_TRADED_FUND: IMTConSymbol_EnIndustries = 251;
pub const IMTConSymbol_EnIndustries_INDUSTRY_ASSETS_MANAGEMENT: IMTConSymbol_EnIndustries = 252;
pub const IMTConSymbol_EnIndustries_INDUSTRY_BANKS_DIVERSIFIED: IMTConSymbol_EnIndustries = 253;
pub const IMTConSymbol_EnIndustries_INDUSTRY_BANKS_REGIONAL: IMTConSymbol_EnIndustries = 254;
pub const IMTConSymbol_EnIndustries_INDUSTRY_CAPITAL_MARKETS: IMTConSymbol_EnIndustries = 255;
pub const IMTConSymbol_EnIndustries_INDUSTRY_CLOSE_END_FUND_DEBT: IMTConSymbol_EnIndustries = 256;
pub const IMTConSymbol_EnIndustries_INDUSTRY_CLOSE_END_FUND_EQUITY: IMTConSymbol_EnIndustries = 257;
pub const IMTConSymbol_EnIndustries_INDUSTRY_CLOSE_END_FUND_FOREIGN: IMTConSymbol_EnIndustries =
    258;
pub const IMTConSymbol_EnIndustries_INDUSTRY_CREDIT_SERVICES: IMTConSymbol_EnIndustries = 259;
pub const IMTConSymbol_EnIndustries_INDUSTRY_FINANCIAL_CONGLOMERATE: IMTConSymbol_EnIndustries =
    260;
pub const IMTConSymbol_EnIndustries_INDUSTRY_FINANCIAL_DATA_EXCHANGE: IMTConSymbol_EnIndustries =
    261;
pub const IMTConSymbol_EnIndustries_INDUSTRY_INSURANCE_BROKERS: IMTConSymbol_EnIndustries = 262;
pub const IMTConSymbol_EnIndustries_INDUSTRY_INSURANCE_DIVERSIFIED: IMTConSymbol_EnIndustries = 263;
pub const IMTConSymbol_EnIndustries_INDUSTRY_INSURANCE_LIFE: IMTConSymbol_EnIndustries = 264;
pub const IMTConSymbol_EnIndustries_INDUSTRY_INSURANCE_PROPERTY: IMTConSymbol_EnIndustries = 265;
pub const IMTConSymbol_EnIndustries_INDUSTRY_INSURANCE_REINSURANCE: IMTConSymbol_EnIndustries = 266;
pub const IMTConSymbol_EnIndustries_INDUSTRY_INSURANCE_SPECIALTY: IMTConSymbol_EnIndustries = 267;
pub const IMTConSymbol_EnIndustries_INDUSTRY_MORTGAGE_FINANCE: IMTConSymbol_EnIndustries = 268;
pub const IMTConSymbol_EnIndustries_INDUSTRY_SHELL_COMPANIES: IMTConSymbol_EnIndustries = 269;
pub const IMTConSymbol_EnIndustries_INDUSTRY_FINANCIAL_FIRST: IMTConSymbol_EnIndustries = 251;
pub const IMTConSymbol_EnIndustries_INDUSTRY_FINANCIAL_LAST: IMTConSymbol_EnIndustries = 269;
pub const IMTConSymbol_EnIndustries_INDUSTRY_FINANCIAL_END: IMTConSymbol_EnIndustries = 300;
pub const IMTConSymbol_EnIndustries_INDUSTRY_BIOTECHNOLOGY: IMTConSymbol_EnIndustries = 301;
pub const IMTConSymbol_EnIndustries_INDUSTRY_DIAGNOSTICS_RESEARCH: IMTConSymbol_EnIndustries = 302;
pub const IMTConSymbol_EnIndustries_INDUSTRY_DRUGS_MANUFACTURERS: IMTConSymbol_EnIndustries = 303;
pub const IMTConSymbol_EnIndustries_INDUSTRY_DRUGS_MANUFACTURERS_SPEC: IMTConSymbol_EnIndustries =
    304;
pub const IMTConSymbol_EnIndustries_INDUSTRY_HEALTHCARE_PLANS: IMTConSymbol_EnIndustries = 305;
pub const IMTConSymbol_EnIndustries_INDUSTRY_HEALTH_INFORMATION: IMTConSymbol_EnIndustries = 306;
pub const IMTConSymbol_EnIndustries_INDUSTRY_MEDICAL_FACILITIES: IMTConSymbol_EnIndustries = 307;
pub const IMTConSymbol_EnIndustries_INDUSTRY_MEDICAL_DEVICES: IMTConSymbol_EnIndustries = 308;
pub const IMTConSymbol_EnIndustries_INDUSTRY_MEDICAL_DISTRIBUTION: IMTConSymbol_EnIndustries = 309;
pub const IMTConSymbol_EnIndustries_INDUSTRY_MEDICAL_INSTRUMENTS: IMTConSymbol_EnIndustries = 310;
pub const IMTConSymbol_EnIndustries_INDUSTRY_PHARM_RETAILERS: IMTConSymbol_EnIndustries = 311;
pub const IMTConSymbol_EnIndustries_INDUSTRY_HEALTHCARE_FIRST: IMTConSymbol_EnIndustries = 301;
pub const IMTConSymbol_EnIndustries_INDUSTRY_HEALTHCARE_LAST: IMTConSymbol_EnIndustries = 311;
pub const IMTConSymbol_EnIndustries_INDUSTRY_HEALTHCARE_END: IMTConSymbol_EnIndustries = 350;
pub const IMTConSymbol_EnIndustries_INDUSTRY_AEROSPACE_DEFENSE: IMTConSymbol_EnIndustries = 351;
pub const IMTConSymbol_EnIndustries_INDUSTRY_AIRLINES: IMTConSymbol_EnIndustries = 352;
pub const IMTConSymbol_EnIndustries_INDUSTRY_AIRPORTS_SERVICES: IMTConSymbol_EnIndustries = 353;
pub const IMTConSymbol_EnIndustries_INDUSTRY_BUILDING_PRODUCTS: IMTConSymbol_EnIndustries = 354;
pub const IMTConSymbol_EnIndustries_INDUSTRY_BUSINESS_EQUIPMENT: IMTConSymbol_EnIndustries = 355;
pub const IMTConSymbol_EnIndustries_INDUSTRY_CONGLOMERATES: IMTConSymbol_EnIndustries = 356;
pub const IMTConSymbol_EnIndustries_INDUSTRY_CONSULTING_SERVICES: IMTConSymbol_EnIndustries = 357;
pub const IMTConSymbol_EnIndustries_INDUSTRY_ELECTRICAL_EQUIPMENT: IMTConSymbol_EnIndustries = 358;
pub const IMTConSymbol_EnIndustries_INDUSTRY_ENGINEERING_CONSTRUCTION: IMTConSymbol_EnIndustries =
    359;
pub const IMTConSymbol_EnIndustries_INDUSTRY_FARM_HEAVY_MACHINERY: IMTConSymbol_EnIndustries = 360;
pub const IMTConSymbol_EnIndustries_INDUSTRY_INDUSTRIAL_DISTRIBUTION: IMTConSymbol_EnIndustries =
    361;
pub const IMTConSymbol_EnIndustries_INDUSTRY_INFRASTRUCTURE_OPERATIONS: IMTConSymbol_EnIndustries =
    362;
pub const IMTConSymbol_EnIndustries_INDUSTRY_FREIGHT_LOGISTICS: IMTConSymbol_EnIndustries = 363;
pub const IMTConSymbol_EnIndustries_INDUSTRY_MARINE_SHIPPING: IMTConSymbol_EnIndustries = 364;
pub const IMTConSymbol_EnIndustries_INDUSTRY_METAL_FABRICATION: IMTConSymbol_EnIndustries = 365;
pub const IMTConSymbol_EnIndustries_INDUSTRY_POLLUTION_CONTROL: IMTConSymbol_EnIndustries = 366;
pub const IMTConSymbol_EnIndustries_INDUSTRY_RAILROADS: IMTConSymbol_EnIndustries = 367;
pub const IMTConSymbol_EnIndustries_INDUSTRY_RENTAL_LEASING: IMTConSymbol_EnIndustries = 368;
pub const IMTConSymbol_EnIndustries_INDUSTRY_SECURITY_PROTECTION: IMTConSymbol_EnIndustries = 369;
pub const IMTConSymbol_EnIndustries_INDUSTRY_SPEALITY_BUSINESS_SERVICES: IMTConSymbol_EnIndustries =
    370;
pub const IMTConSymbol_EnIndustries_INDUSTRY_SPEALITY_MACHINERY: IMTConSymbol_EnIndustries = 371;
pub const IMTConSymbol_EnIndustries_INDUSTRY_STUFFING_EMPLOYMENT: IMTConSymbol_EnIndustries = 372;
pub const IMTConSymbol_EnIndustries_INDUSTRY_TOOLS_ACCESSORIES: IMTConSymbol_EnIndustries = 373;
pub const IMTConSymbol_EnIndustries_INDUSTRY_TRUCKING: IMTConSymbol_EnIndustries = 374;
pub const IMTConSymbol_EnIndustries_INDUSTRY_WASTE_MANAGEMENT: IMTConSymbol_EnIndustries = 375;
pub const IMTConSymbol_EnIndustries_INDUSTRY_INDUSTRIALS_FIRST: IMTConSymbol_EnIndustries = 351;
pub const IMTConSymbol_EnIndustries_INDUSTRY_INDUSTRIALS_LAST: IMTConSymbol_EnIndustries = 375;
pub const IMTConSymbol_EnIndustries_INDUSTRY_INDUSTRIALS_END: IMTConSymbol_EnIndustries = 400;
pub const IMTConSymbol_EnIndustries_INDUSTRY_REAL_ESTATE_DEVELOPMENT: IMTConSymbol_EnIndustries =
    401;
pub const IMTConSymbol_EnIndustries_INDUSTRY_REAL_ESTATE_DIVERSIFIED: IMTConSymbol_EnIndustries =
    402;
pub const IMTConSymbol_EnIndustries_INDUSTRY_REAL_ESTATE_SERVICES: IMTConSymbol_EnIndustries = 403;
pub const IMTConSymbol_EnIndustries_INDUSTRY_REIT_DIVERSIFIED: IMTConSymbol_EnIndustries = 404;
pub const IMTConSymbol_EnIndustries_INDUSTRY_REIT_HEALTCARE: IMTConSymbol_EnIndustries = 405;
pub const IMTConSymbol_EnIndustries_INDUSTRY_REIT_HOTEL_MOTEL: IMTConSymbol_EnIndustries = 406;
pub const IMTConSymbol_EnIndustries_INDUSTRY_REIT_INDUSTRIAL: IMTConSymbol_EnIndustries = 407;
pub const IMTConSymbol_EnIndustries_INDUSTRY_REIT_MORTAGE: IMTConSymbol_EnIndustries = 408;
pub const IMTConSymbol_EnIndustries_INDUSTRY_REIT_OFFICE: IMTConSymbol_EnIndustries = 409;
pub const IMTConSymbol_EnIndustries_INDUSTRY_REIT_RESIDENTAL: IMTConSymbol_EnIndustries = 410;
pub const IMTConSymbol_EnIndustries_INDUSTRY_REIT_RETAIL: IMTConSymbol_EnIndustries = 411;
pub const IMTConSymbol_EnIndustries_INDUSTRY_REIT_SPECIALITY: IMTConSymbol_EnIndustries = 412;
pub const IMTConSymbol_EnIndustries_INDUSTRY_REAL_ESTATE_FIRST: IMTConSymbol_EnIndustries = 401;
pub const IMTConSymbol_EnIndustries_INDUSTRY_REAL_ESTATE_LAST: IMTConSymbol_EnIndustries = 412;
pub const IMTConSymbol_EnIndustries_INDUSTRY_REAL_ESTATE_END: IMTConSymbol_EnIndustries = 450;
pub const IMTConSymbol_EnIndustries_INDUSTRY_COMMUNICATION_EQUIPMENT: IMTConSymbol_EnIndustries =
    451;
pub const IMTConSymbol_EnIndustries_INDUSTRY_COMPUTER_HARDWARE: IMTConSymbol_EnIndustries = 452;
pub const IMTConSymbol_EnIndustries_INDUSTRY_CONSUMER_ELECTRONICS: IMTConSymbol_EnIndustries = 453;
pub const IMTConSymbol_EnIndustries_INDUSTRY_ELECTRONIC_COMPONENTS: IMTConSymbol_EnIndustries = 454;
pub const IMTConSymbol_EnIndustries_INDUSTRY_ELECTRONIC_DISTRIBUTION: IMTConSymbol_EnIndustries =
    455;
pub const IMTConSymbol_EnIndustries_INDUSTRY_IT_SERVICES: IMTConSymbol_EnIndustries = 456;
pub const IMTConSymbol_EnIndustries_INDUSTRY_SCIENTIFIC_INSTRUMENTS: IMTConSymbol_EnIndustries =
    457;
pub const IMTConSymbol_EnIndustries_INDUSTRY_SEMICONDUCTOR_EQUIPMENT: IMTConSymbol_EnIndustries =
    458;
pub const IMTConSymbol_EnIndustries_INDUSTRY_SEMICONDUCTORS: IMTConSymbol_EnIndustries = 459;
pub const IMTConSymbol_EnIndustries_INDUSTRY_SOFTWARE_APPLICATION: IMTConSymbol_EnIndustries = 460;
pub const IMTConSymbol_EnIndustries_INDUSTRY_SOFTWARE_INFRASTRUCTURE: IMTConSymbol_EnIndustries =
    461;
pub const IMTConSymbol_EnIndustries_INDUSTRY_SOLAR: IMTConSymbol_EnIndustries = 462;
pub const IMTConSymbol_EnIndustries_INDUSTRY_TECHNOLOGY_FIRST: IMTConSymbol_EnIndustries = 451;
pub const IMTConSymbol_EnIndustries_INDUSTRY_TECHNOLOGY_LAST: IMTConSymbol_EnIndustries = 462;
pub const IMTConSymbol_EnIndustries_INDUSTRY_TECHNOLOGY_END: IMTConSymbol_EnIndustries = 500;
pub const IMTConSymbol_EnIndustries_INDUSTRY_UTILITIES_DIVERSIFIED: IMTConSymbol_EnIndustries = 501;
pub const IMTConSymbol_EnIndustries_INDUSTRY_UTILITIES_POWERPRODUCERS: IMTConSymbol_EnIndustries =
    502;
pub const IMTConSymbol_EnIndustries_INDUSTRY_UTILITIES_RENEWABLE: IMTConSymbol_EnIndustries = 503;
pub const IMTConSymbol_EnIndustries_INDUSTRY_UTILITIES_REGULATED_ELECTRIC:
    IMTConSymbol_EnIndustries = 504;
pub const IMTConSymbol_EnIndustries_INDUSTRY_UTILITIES_REGULATED_GAS: IMTConSymbol_EnIndustries =
    505;
pub const IMTConSymbol_EnIndustries_INDUSTRY_UTILITIES_REGULATED_WATER: IMTConSymbol_EnIndustries =
    506;
pub const IMTConSymbol_EnIndustries_INDUSTRY_UTILITIES_FIRST: IMTConSymbol_EnIndustries = 501;
pub const IMTConSymbol_EnIndustries_INDUSTRY_UTILITIES_LAST: IMTConSymbol_EnIndustries = 506;
pub const IMTConSymbol_EnIndustries_INDUSTRY_UTILITIES_END: IMTConSymbol_EnIndustries = 550;
pub const IMTConSymbol_EnIndustries_INDUSTRY_COMMODITIES_AGRICULTURAL: IMTConSymbol_EnIndustries =
    551;
pub const IMTConSymbol_EnIndustries_INDUSTRY_COMMODITIES_ENERGY: IMTConSymbol_EnIndustries = 552;
pub const IMTConSymbol_EnIndustries_INDUSTRY_COMMODITIES_METALS: IMTConSymbol_EnIndustries = 553;
pub const IMTConSymbol_EnIndustries_INDUSTRY_COMMODITIES_PRECIOUS: IMTConSymbol_EnIndustries = 554;
pub const IMTConSymbol_EnIndustries_INDUSTRY_COMMODITIES_FIRST: IMTConSymbol_EnIndustries = 551;
pub const IMTConSymbol_EnIndustries_INDUSTRY_COMMODITIES_LAST: IMTConSymbol_EnIndustries = 554;
pub const IMTConSymbol_EnIndustries_INDUSTRY_COMMODITIES_END: IMTConSymbol_EnIndustries = 600;
pub const IMTConSymbol_EnIndustries_INDUSTRY_FIRST: IMTConSymbol_EnIndustries = 0;
pub const IMTConSymbol_EnIndustries_INDUSTRY_LAST: IMTConSymbol_EnIndustries = 554;
pub type IMTConSymbol_EnIndustries = ::std::os::raw::c_int;
pub const IMTConSymbol_EnFillingFlags_FILL_FLAGS_NONE: IMTConSymbol_EnFillingFlags = 0;
pub const IMTConSymbol_EnFillingFlags_FILL_FLAGS_FOK: IMTConSymbol_EnFillingFlags = 1;
pub const IMTConSymbol_EnFillingFlags_FILL_FLAGS_IOC: IMTConSymbol_EnFillingFlags = 2;
pub const IMTConSymbol_EnFillingFlags_FILL_FLAGS_FIRST: IMTConSymbol_EnFillingFlags = 1;
pub const IMTConSymbol_EnFillingFlags_FILL_FLAGS_ALL: IMTConSymbol_EnFillingFlags = 3;
pub type IMTConSymbol_EnFillingFlags = ::std::os::raw::c_int;
pub const IMTConSymbol_EnExpirationFlags_TIME_FLAGS_NONE: IMTConSymbol_EnExpirationFlags = 0;
pub const IMTConSymbol_EnExpirationFlags_TIME_FLAGS_GTC: IMTConSymbol_EnExpirationFlags = 1;
pub const IMTConSymbol_EnExpirationFlags_TIME_FLAGS_DAY: IMTConSymbol_EnExpirationFlags = 2;
pub const IMTConSymbol_EnExpirationFlags_TIME_FLAGS_SPECIFIED: IMTConSymbol_EnExpirationFlags = 4;
pub const IMTConSymbol_EnExpirationFlags_TIME_FLAGS_SPECIFIED_DAY: IMTConSymbol_EnExpirationFlags =
    8;
pub const IMTConSymbol_EnExpirationFlags_TIME_FLAGS_FIRST: IMTConSymbol_EnExpirationFlags = 1;
pub const IMTConSymbol_EnExpirationFlags_TIME_FLAGS_ALL: IMTConSymbol_EnExpirationFlags = 15;
pub type IMTConSymbol_EnExpirationFlags = ::std::os::raw::c_int;
pub const IMTConSymbol_EnOrderFlags_ORDER_FLAGS_NONE: IMTConSymbol_EnOrderFlags = 0;
pub const IMTConSymbol_EnOrderFlags_ORDER_FLAGS_MARKET: IMTConSymbol_EnOrderFlags = 1;
pub const IMTConSymbol_EnOrderFlags_ORDER_FLAGS_LIMIT: IMTConSymbol_EnOrderFlags = 2;
pub const IMTConSymbol_EnOrderFlags_ORDER_FLAGS_STOP: IMTConSymbol_EnOrderFlags = 4;
pub const IMTConSymbol_EnOrderFlags_ORDER_FLAGS_STOP_LIMIT: IMTConSymbol_EnOrderFlags = 8;
pub const IMTConSymbol_EnOrderFlags_ORDER_FLAGS_SL: IMTConSymbol_EnOrderFlags = 16;
pub const IMTConSymbol_EnOrderFlags_ORDER_FLAGS_TP: IMTConSymbol_EnOrderFlags = 32;
pub const IMTConSymbol_EnOrderFlags_ORDER_FLAGS_CLOSEBY: IMTConSymbol_EnOrderFlags = 64;
pub const IMTConSymbol_EnOrderFlags_ORDER_FLAGS_FIRST: IMTConSymbol_EnOrderFlags = 1;
pub const IMTConSymbol_EnOrderFlags_ORDER_FLAGS_ALL: IMTConSymbol_EnOrderFlags = 127;
pub type IMTConSymbol_EnOrderFlags = ::std::os::raw::c_int;
pub const IMTConSymbol_EnTradeMode_TRADE_DISABLED: IMTConSymbol_EnTradeMode = 0;
pub const IMTConSymbol_EnTradeMode_TRADE_LONGONLY: IMTConSymbol_EnTradeMode = 1;
pub const IMTConSymbol_EnTradeMode_TRADE_SHORTONLY: IMTConSymbol_EnTradeMode = 2;
pub const IMTConSymbol_EnTradeMode_TRADE_CLOSEONLY: IMTConSymbol_EnTradeMode = 3;
pub const IMTConSymbol_EnTradeMode_TRADE_FULL: IMTConSymbol_EnTradeMode = 4;
pub const IMTConSymbol_EnTradeMode_TRADE_FIRST: IMTConSymbol_EnTradeMode = 0;
pub const IMTConSymbol_EnTradeMode_TRADE_LAST: IMTConSymbol_EnTradeMode = 4;
pub type IMTConSymbol_EnTradeMode = ::std::os::raw::c_int;
pub const IMTConSymbol_EnExecutionMode_EXECUTION_REQUEST: IMTConSymbol_EnExecutionMode = 0;
pub const IMTConSymbol_EnExecutionMode_EXECUTION_INSTANT: IMTConSymbol_EnExecutionMode = 1;
pub const IMTConSymbol_EnExecutionMode_EXECUTION_MARKET: IMTConSymbol_EnExecutionMode = 2;
pub const IMTConSymbol_EnExecutionMode_EXECUTION_EXCHANGE: IMTConSymbol_EnExecutionMode = 3;
pub const IMTConSymbol_EnExecutionMode_EXECUTION_FIRST: IMTConSymbol_EnExecutionMode = 0;
pub const IMTConSymbol_EnExecutionMode_EXECUTION_LAST: IMTConSymbol_EnExecutionMode = 3;
pub type IMTConSymbol_EnExecutionMode = ::std::os::raw::c_int;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_FOREX: IMTConSymbol_EnCalcMode = 0;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_FUTURES: IMTConSymbol_EnCalcMode = 1;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_CFD: IMTConSymbol_EnCalcMode = 2;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_CFDINDEX: IMTConSymbol_EnCalcMode = 3;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_CFDLEVERAGE: IMTConSymbol_EnCalcMode = 4;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_FOREX_NO_LEVERAGE: IMTConSymbol_EnCalcMode = 5;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_MM_FIRST: IMTConSymbol_EnCalcMode = 0;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_MM_LAST: IMTConSymbol_EnCalcMode = 5;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_EXCH_STOCKS: IMTConSymbol_EnCalcMode = 32;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_EXCH_FUTURES: IMTConSymbol_EnCalcMode = 33;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_EXCH_FUTURES_FORTS: IMTConSymbol_EnCalcMode = 34;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_EXCH_OPTIONS: IMTConSymbol_EnCalcMode = 35;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_EXCH_OPTIONS_MARGIN: IMTConSymbol_EnCalcMode = 36;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_EXCH_BONDS: IMTConSymbol_EnCalcMode = 37;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_EXCH_STOCKS_MOEX: IMTConSymbol_EnCalcMode = 38;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_EXCH_BONDS_MOEX: IMTConSymbol_EnCalcMode = 39;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_EXCH_FIRST: IMTConSymbol_EnCalcMode = 32;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_EXCH_LAST: IMTConSymbol_EnCalcMode = 39;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_SERV_COLLATERAL: IMTConSymbol_EnCalcMode = 64;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_SERV_FIRST: IMTConSymbol_EnCalcMode = 64;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_SERV_LAST: IMTConSymbol_EnCalcMode = 64;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_FIRST: IMTConSymbol_EnCalcMode = 0;
pub const IMTConSymbol_EnCalcMode_TRADE_MODE_LAST: IMTConSymbol_EnCalcMode = 64;
pub type IMTConSymbol_EnCalcMode = ::std::os::raw::c_int;
pub const IMTConSymbol_EnGTCMode_ORDERS_GTC: IMTConSymbol_EnGTCMode = 0;
pub const IMTConSymbol_EnGTCMode_ORDERS_DAILY: IMTConSymbol_EnGTCMode = 1;
pub const IMTConSymbol_EnGTCMode_ORDERS_DAILY_NO_STOPS: IMTConSymbol_EnGTCMode = 2;
pub const IMTConSymbol_EnGTCMode_ORDERS_FIRST: IMTConSymbol_EnGTCMode = 0;
pub const IMTConSymbol_EnGTCMode_ORDERS_LAST: IMTConSymbol_EnGTCMode = 2;
pub type IMTConSymbol_EnGTCMode = ::std::os::raw::c_int;
pub const IMTConSymbol_EnTickFlags_TICK_REALTIME: IMTConSymbol_EnTickFlags = 1;
pub const IMTConSymbol_EnTickFlags_TICK_COLLECTRAW: IMTConSymbol_EnTickFlags = 2;
pub const IMTConSymbol_EnTickFlags_TICK_FEED_STATS: IMTConSymbol_EnTickFlags = 4;
pub const IMTConSymbol_EnTickFlags_TICK_NEGATIVE_PRICES: IMTConSymbol_EnTickFlags = 8;
pub const IMTConSymbol_EnTickFlags_TICK_NONE: IMTConSymbol_EnTickFlags = 0;
pub const IMTConSymbol_EnTickFlags_TICK_ALL: IMTConSymbol_EnTickFlags = 15;
pub type IMTConSymbol_EnTickFlags = ::std::os::raw::c_int;
pub const IMTConSymbol_EnChartMode_CHART_MODE_BID_PRICE: IMTConSymbol_EnChartMode = 0;
pub const IMTConSymbol_EnChartMode_CHART_MODE_LAST_PRICE: IMTConSymbol_EnChartMode = 1;
pub const IMTConSymbol_EnChartMode_CHART_MODE_OLD: IMTConSymbol_EnChartMode = 255;
pub const IMTConSymbol_EnChartMode_CHART_MODE_FIRST: IMTConSymbol_EnChartMode = 0;
pub const IMTConSymbol_EnChartMode_CHART_MODE_LAST: IMTConSymbol_EnChartMode = 255;
pub type IMTConSymbol_EnChartMode = ::std::os::raw::c_int;
pub const IMTConSymbol_EnMarginFlags_MARGIN_FLAGS_NONE: IMTConSymbol_EnMarginFlags = 0;
pub const IMTConSymbol_EnMarginFlags_MARGIN_FLAGS_CHECK_PROCESS: IMTConSymbol_EnMarginFlags = 1;
pub const IMTConSymbol_EnMarginFlags_MARGIN_FLAGS_CHECK_SLTP: IMTConSymbol_EnMarginFlags = 2;
pub const IMTConSymbol_EnMarginFlags_MARGIN_FLAGS_HEDGE_LARGE_LEG: IMTConSymbol_EnMarginFlags = 4;
pub const IMTConSymbol_EnMarginFlags_MARGIN_FLAGS_EXCLUDE_PL: IMTConSymbol_EnMarginFlags = 8;
pub const IMTConSymbol_EnMarginFlags_MARGIN_FLAGS_ALL: IMTConSymbol_EnMarginFlags = 15;
pub type IMTConSymbol_EnMarginFlags = ::std::os::raw::c_int;
pub const IMTConSymbol_EnSwapMode_SWAP_DISABLED: IMTConSymbol_EnSwapMode = 0;
pub const IMTConSymbol_EnSwapMode_SWAP_BY_POINTS: IMTConSymbol_EnSwapMode = 1;
pub const IMTConSymbol_EnSwapMode_SWAP_BY_SYMBOL_CURRENCY: IMTConSymbol_EnSwapMode = 2;
pub const IMTConSymbol_EnSwapMode_SWAP_BY_MARGIN_CURRENCY: IMTConSymbol_EnSwapMode = 3;
pub const IMTConSymbol_EnSwapMode_SWAP_BY_GROUP_CURRENCY: IMTConSymbol_EnSwapMode = 4;
pub const IMTConSymbol_EnSwapMode_SWAP_BY_INTEREST_CURRENT: IMTConSymbol_EnSwapMode = 5;
pub const IMTConSymbol_EnSwapMode_SWAP_BY_INTEREST_OPEN: IMTConSymbol_EnSwapMode = 6;
pub const IMTConSymbol_EnSwapMode_SWAP_REOPEN_BY_CLOSE_PRICE: IMTConSymbol_EnSwapMode = 7;
pub const IMTConSymbol_EnSwapMode_SWAP_REOPEN_BY_BID: IMTConSymbol_EnSwapMode = 8;
pub const IMTConSymbol_EnSwapMode_SWAP_BY_PROFIT_CURRENCY: IMTConSymbol_EnSwapMode = 9;
pub const IMTConSymbol_EnSwapMode_SWAP_FIRST: IMTConSymbol_EnSwapMode = 0;
pub const IMTConSymbol_EnSwapMode_SWAP_LAST: IMTConSymbol_EnSwapMode = 9;
pub type IMTConSymbol_EnSwapMode = ::std::os::raw::c_int;
pub const IMTConSymbol_EnSwapDays_SWAP_DAY_SUNDAY: IMTConSymbol_EnSwapDays = 0;
pub const IMTConSymbol_EnSwapDays_SWAP_DAY_MONDAY: IMTConSymbol_EnSwapDays = 1;
pub const IMTConSymbol_EnSwapDays_SWAP_DAY_TUESDAY: IMTConSymbol_EnSwapDays = 2;
pub const IMTConSymbol_EnSwapDays_SWAP_DAY_WEDNESDAY: IMTConSymbol_EnSwapDays = 3;
pub const IMTConSymbol_EnSwapDays_SWAP_DAY_THURSDAY: IMTConSymbol_EnSwapDays = 4;
pub const IMTConSymbol_EnSwapDays_SWAP_DAY_FRIDAY: IMTConSymbol_EnSwapDays = 5;
pub const IMTConSymbol_EnSwapDays_SWAP_DAY_SATURDAY: IMTConSymbol_EnSwapDays = 6;
pub const IMTConSymbol_EnSwapDays_SWAP_DAY_DISABLED: IMTConSymbol_EnSwapDays = 7;
pub const IMTConSymbol_EnSwapDays_SWAP_DAY_FIRST: IMTConSymbol_EnSwapDays = 0;
pub const IMTConSymbol_EnSwapDays_SWAP_DAY_LAST: IMTConSymbol_EnSwapDays = 7;
pub type IMTConSymbol_EnSwapDays = ::std::os::raw::c_int;
pub const IMTConSymbol_EnSwapFlags_SWAP_FLAGS_NONE: IMTConSymbol_EnSwapFlags = 0;
pub const IMTConSymbol_EnSwapFlags_SWAP_FLAGS_CONSIDER_HOLIDAYS: IMTConSymbol_EnSwapFlags = 1;
pub const IMTConSymbol_EnSwapFlags_SWAP_FLAGS_DEFAULT: IMTConSymbol_EnSwapFlags = 0;
pub const IMTConSymbol_EnSwapFlags_SWAP_FLAGS_ALL: IMTConSymbol_EnSwapFlags = 1;
pub type IMTConSymbol_EnSwapFlags = ::std::os::raw::c_int;
pub const IMTConSymbol_EnInstantFlags_INSTANT_FLAGS_NONE: IMTConSymbol_EnInstantFlags = 0;
pub const IMTConSymbol_EnInstantFlags_INSTANT_FLAGS_FAST_CONFIRMATION: IMTConSymbol_EnInstantFlags =
    1;
pub const IMTConSymbol_EnInstantFlags_INSTANT_FLAGS_ALL: IMTConSymbol_EnInstantFlags = 1;
pub type IMTConSymbol_EnInstantFlags = ::std::os::raw::c_int;
pub const IMTConSymbol_EnInstantMode_INSTANT_CHECK_NORMAL: IMTConSymbol_EnInstantMode = 0;
pub const IMTConSymbol_EnInstantMode_INSTANT_CHECK_FIRST: IMTConSymbol_EnInstantMode = 0;
pub const IMTConSymbol_EnInstantMode_INSTANT_CHECK_LAST: IMTConSymbol_EnInstantMode = 0;
pub type IMTConSymbol_EnInstantMode = ::std::os::raw::c_int;
pub const IMTConSymbol_EnRequestFlags_REQUEST_FLAGS_NONE: IMTConSymbol_EnRequestFlags = 0;
pub const IMTConSymbol_EnRequestFlags_REQUEST_FLAGS_ORDER: IMTConSymbol_EnRequestFlags = 1;
pub const IMTConSymbol_EnRequestFlags_REQUEST_FLAGS_ALL: IMTConSymbol_EnRequestFlags = 1;
pub type IMTConSymbol_EnRequestFlags = ::std::os::raw::c_int;
pub const IMTConSymbol_EnTradeFlags_TRADE_FLAGS_NONE: IMTConSymbol_EnTradeFlags = 0;
pub const IMTConSymbol_EnTradeFlags_TRADE_FLAGS_PROFIT_BY_MARKET: IMTConSymbol_EnTradeFlags = 1;
pub const IMTConSymbol_EnTradeFlags_TRADE_FLAGS_ALLOW_SIGNALS: IMTConSymbol_EnTradeFlags = 2;
pub const IMTConSymbol_EnTradeFlags_TRADE_FLAGS_ALL: IMTConSymbol_EnTradeFlags = 3;
pub const IMTConSymbol_EnTradeFlags_TRADE_FLAGS_DEFAULT: IMTConSymbol_EnTradeFlags = 2;
pub type IMTConSymbol_EnTradeFlags = ::std::os::raw::c_int;
pub const IMTConSymbol_EnMarginRateTypes_MARGIN_RATE_BUY: IMTConSymbol_EnMarginRateTypes = 0;
pub const IMTConSymbol_EnMarginRateTypes_MARGIN_RATE_SELL: IMTConSymbol_EnMarginRateTypes = 1;
pub const IMTConSymbol_EnMarginRateTypes_MARGIN_RATE_BUY_LIMIT: IMTConSymbol_EnMarginRateTypes = 2;
pub const IMTConSymbol_EnMarginRateTypes_MARGIN_RATE_SELL_LIMIT: IMTConSymbol_EnMarginRateTypes = 3;
pub const IMTConSymbol_EnMarginRateTypes_MARGIN_RATE_BUY_STOP: IMTConSymbol_EnMarginRateTypes = 4;
pub const IMTConSymbol_EnMarginRateTypes_MARGIN_RATE_SELL_STOP: IMTConSymbol_EnMarginRateTypes = 5;
pub const IMTConSymbol_EnMarginRateTypes_MARGIN_RATE_BUY_STOP_LIMIT:
    IMTConSymbol_EnMarginRateTypes = 6;
pub const IMTConSymbol_EnMarginRateTypes_MARGIN_RATE_SELL_STOP_LIMIT:
    IMTConSymbol_EnMarginRateTypes = 7;
pub const IMTConSymbol_EnMarginRateTypes_MARGIN_RATE_FIRST: IMTConSymbol_EnMarginRateTypes = 0;
pub const IMTConSymbol_EnMarginRateTypes_MARGIN_RATE_LAST: IMTConSymbol_EnMarginRateTypes = 7;
pub type IMTConSymbol_EnMarginRateTypes = ::std::os::raw::c_int;
pub const IMTConSymbol_EnOptionMode_OPTION_MODE_EUROPEAN_CALL: IMTConSymbol_EnOptionMode = 0;
pub const IMTConSymbol_EnOptionMode_OPTION_MODE_EUROPEAN_PUT: IMTConSymbol_EnOptionMode = 1;
pub const IMTConSymbol_EnOptionMode_OPTION_MODE_AMERICAN_CALL: IMTConSymbol_EnOptionMode = 2;
pub const IMTConSymbol_EnOptionMode_OPTION_MODE_AMERICAN_PUT: IMTConSymbol_EnOptionMode = 3;
pub const IMTConSymbol_EnOptionMode_OPTION_MODE_FIRST: IMTConSymbol_EnOptionMode = 0;
pub const IMTConSymbol_EnOptionMode_OPTION_MODE_LAST: IMTConSymbol_EnOptionMode = 3;
pub type IMTConSymbol_EnOptionMode = ::std::os::raw::c_int;
pub const IMTConSymbol_EnSpliceType_SPLICE_NONE: IMTConSymbol_EnSpliceType = 0;
pub const IMTConSymbol_EnSpliceType_SPLICE_UNADJUSTED: IMTConSymbol_EnSpliceType = 1;
pub const IMTConSymbol_EnSpliceType_SPLICE_ADJUSTED: IMTConSymbol_EnSpliceType = 2;
pub const IMTConSymbol_EnSpliceType_SPLICE_FIRST: IMTConSymbol_EnSpliceType = 0;
pub const IMTConSymbol_EnSpliceType_SPLICE_LAST: IMTConSymbol_EnSpliceType = 2;
pub type IMTConSymbol_EnSpliceType = ::std::os::raw::c_int;
pub const IMTConSymbol_EnSpliceTimeType_SPLICE_TIME_EXPIRATION: IMTConSymbol_EnSpliceTimeType = 0;
pub const IMTConSymbol_EnSpliceTimeType_SPLICE_TIME_FIRST: IMTConSymbol_EnSpliceTimeType = 0;
pub const IMTConSymbol_EnSpliceTimeType_SPLICE_TIME_LAST: IMTConSymbol_EnSpliceTimeType = 0;
pub type IMTConSymbol_EnSpliceTimeType = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConSymbol"][::std::mem::size_of::<IMTConSymbol>() - 24usize];
    ["Alignment of IMTConSymbol"][::std::mem::align_of::<IMTConSymbol>() - 8usize];
};
#[repr(C)]
pub struct IMTConSymbolSink__bindgen_vtable {}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMTConSymbolSink {
    pub vtable_: *const IMTConSymbolSink__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConSymbolSink"][::std::mem::size_of::<IMTConSymbolSink>() - 8usize];
    ["Alignment of IMTConSymbolSink"][::std::mem::align_of::<IMTConSymbolSink>() - 8usize];
};
#[repr(C)]
pub struct IMTConGroupSymbol__bindgen_vtable {
    pub IMTConGroupSymbol_Release: unsafe extern "C" fn(this: *mut IMTConGroupSymbol),
    pub IMTConGroupSymbol_Assign: unsafe extern "C" fn(
        this: *mut IMTConGroupSymbol,
        group: *const IMTConGroupSymbol,
    ) -> MTAPIRES,
    pub IMTConGroupSymbol_Clear: unsafe extern "C" fn(this: *mut IMTConGroupSymbol) -> MTAPIRES,
    pub IMTConGroupSymbol_Default: unsafe extern "C" fn(this: *mut IMTConGroupSymbol) -> MTAPIRES,
    pub IMTConGroupSymbol_Path1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, path: LPCWSTR) -> MTAPIRES,
    pub IMTConGroupSymbol_Path: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> LPCWSTR,
    pub IMTConGroupSymbol_TradeMode1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, mode: UINT) -> MTAPIRES,
    pub IMTConGroupSymbol_TradeMode: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_TradeModeDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_ExecMode1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, mode: UINT) -> MTAPIRES,
    pub IMTConGroupSymbol_ExecMode: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_ExecModeDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_FillFlags1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, flags: UINT) -> MTAPIRES,
    pub IMTConGroupSymbol_FillFlags: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_FillFlagsDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_ExpirFlags1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, flags: UINT) -> MTAPIRES,
    pub IMTConGroupSymbol_ExpirFlags: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_ExpirFlagsDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_SpreadDiff1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, spread: INT) -> MTAPIRES,
    pub IMTConGroupSymbol_SpreadDiff: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> INT,
    pub IMTConGroupSymbol_SpreadDiffDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> INT,
    pub IMTConGroupSymbol_SpreadDiffBalance1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, spread: INT) -> MTAPIRES,
    pub IMTConGroupSymbol_SpreadDiffBalance:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> INT,
    pub IMTConGroupSymbol_SpreadDiffBalanceDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> INT,
    pub IMTConGroupSymbol_StopsLevel1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, level: INT) -> MTAPIRES,
    pub IMTConGroupSymbol_StopsLevel: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> INT,
    pub IMTConGroupSymbol_StopsLevelDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> INT,
    pub IMTConGroupSymbol_FreezeLevel1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, level: INT) -> MTAPIRES,
    pub IMTConGroupSymbol_FreezeLevel: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> INT,
    pub IMTConGroupSymbol_FreezeLevelDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> INT,
    pub IMTConGroupSymbol_VolumeMin1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, volume: UINT64) -> MTAPIRES,
    pub IMTConGroupSymbol_VolumeMin: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT64,
    pub IMTConGroupSymbol_VolumeMinDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT64,
    pub IMTConGroupSymbol_VolumeMax1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, volume: UINT64) -> MTAPIRES,
    pub IMTConGroupSymbol_VolumeMax: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT64,
    pub IMTConGroupSymbol_VolumeMaxDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT64,
    pub IMTConGroupSymbol_VolumeStep1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, volume: UINT64) -> MTAPIRES,
    pub IMTConGroupSymbol_VolumeStep:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT64,
    pub IMTConGroupSymbol_VolumeStepDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT64,
    pub IMTConGroupSymbol_VolumeLimit1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, volume: UINT64) -> MTAPIRES,
    pub IMTConGroupSymbol_VolumeLimit:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT64,
    pub IMTConGroupSymbol_VolumeLimitDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT64,
    pub IMTConGroupSymbol_MarginFlags1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, flags: UINT) -> MTAPIRES,
    pub IMTConGroupSymbol_MarginFlags: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_MarginFlagsDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_MarginInitial1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, margin: f64) -> MTAPIRES,
    pub IMTConGroupSymbol_MarginInitial:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_MarginInitialDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_MarginMaintenance1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, margin: f64) -> MTAPIRES,
    pub IMTConGroupSymbol_MarginMaintenance:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_MarginMaintenanceDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_MarginLong1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, margin: f64) -> MTAPIRES,
    pub IMTConGroupSymbol_MarginLong: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_MarginLongDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_MarginShort1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, margin: f64) -> MTAPIRES,
    pub IMTConGroupSymbol_MarginShort: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_MarginShortDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_MarginLimit1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, margin: f64) -> MTAPIRES,
    pub IMTConGroupSymbol_MarginLimit: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_MarginLimitDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_MarginStop1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, margin: f64) -> MTAPIRES,
    pub IMTConGroupSymbol_MarginStop: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_MarginStopDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_MarginStopLimit1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, margin: f64) -> MTAPIRES,
    pub IMTConGroupSymbol_MarginStopLimit:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_MarginStopLimitDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_SwapMode1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, mode: UINT) -> MTAPIRES,
    pub IMTConGroupSymbol_SwapMode: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_SwapModeDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_SwapLong1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, swap: f64) -> MTAPIRES,
    pub IMTConGroupSymbol_SwapLong: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_SwapLongDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_SwapShort1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, swap: f64) -> MTAPIRES,
    pub IMTConGroupSymbol_SwapShort: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_SwapShortDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_Swap3Day1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, day: ::std::os::raw::c_int) -> MTAPIRES,
    pub IMTConGroupSymbol_Swap3Day:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> ::std::os::raw::c_int,
    pub IMTConGroupSymbol_Swap3DayDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> ::std::os::raw::c_int,
    pub IMTConGroupSymbol_RETimeout1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, timeout: UINT) -> MTAPIRES,
    pub IMTConGroupSymbol_RETimeout: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_RETimeoutDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_IECheckMode1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, mode: UINT) -> MTAPIRES,
    pub IMTConGroupSymbol_IECheckMode: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_IECheckModeDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_IETimeout1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, timeout: UINT) -> MTAPIRES,
    pub IMTConGroupSymbol_IETimeout: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_IETimeoutDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_IESlipProfit1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, slippage: UINT) -> MTAPIRES,
    pub IMTConGroupSymbol_IESlipProfit:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_IESlipProfitDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_IESlipLosing1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, slippage: UINT) -> MTAPIRES,
    pub IMTConGroupSymbol_IESlipLosing:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_IESlipLosingDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_IEVolumeMax1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, volume: UINT64) -> MTAPIRES,
    pub IMTConGroupSymbol_IEVolumeMax:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT64,
    pub IMTConGroupSymbol_IEVolumeMaxDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT64,
    pub IMTConGroupSymbol_OrderFlags1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, flags: UINT) -> MTAPIRES,
    pub IMTConGroupSymbol_OrderFlags: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_OrderFlagsDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_MarginRateInitial1: unsafe extern "C" fn(
        this: *mut IMTConGroupSymbol,
        type_: UINT,
        margin_rate: f64,
    ) -> MTAPIRES,
    pub IMTConGroupSymbol_MarginRateInitial:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol, type_: UINT) -> f64,
    pub IMTConGroupSymbol_MarginRateInitialDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_MarginRateMaintenance1: unsafe extern "C" fn(
        this: *mut IMTConGroupSymbol,
        type_: UINT,
        margin_rate: f64,
    ) -> MTAPIRES,
    pub IMTConGroupSymbol_MarginRateMaintenance:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol, type_: UINT) -> f64,
    pub IMTConGroupSymbol_MarginRateMaintenanceDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_MarginRateLiquidity1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, rate: f64) -> MTAPIRES,
    pub IMTConGroupSymbol_MarginRateLiquidity:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_MarginRateLiquidityDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_REFlags1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, flags: UINT) -> MTAPIRES,
    pub IMTConGroupSymbol_REFlags: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_REFlagsDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_MarginHedged1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, margin: f64) -> MTAPIRES,
    pub IMTConGroupSymbol_MarginHedged: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_MarginHedgedDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_PermissionsFlags1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, flags: UINT) -> MTAPIRES,
    pub IMTConGroupSymbol_PermissionsFlags:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_MarginRateCurrency1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, margin_rate: f64) -> MTAPIRES,
    pub IMTConGroupSymbol_MarginRateCurrency:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_MarginRateCurrencyDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_BookDepthLimit1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, depth: UINT) -> MTAPIRES,
    pub IMTConGroupSymbol_BookDepthLimit:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_IEFlags1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, flags: UINT) -> MTAPIRES,
    pub IMTConGroupSymbol_IEFlags: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_IEFlagsDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_VolumeMinExt1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, volume: UINT64) -> MTAPIRES,
    pub IMTConGroupSymbol_VolumeMinExt:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT64,
    pub IMTConGroupSymbol_VolumeMinExtDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT64,
    pub IMTConGroupSymbol_VolumeMaxExt1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, volume: UINT64) -> MTAPIRES,
    pub IMTConGroupSymbol_VolumeMaxExt:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT64,
    pub IMTConGroupSymbol_VolumeMaxExtDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT64,
    pub IMTConGroupSymbol_VolumeStepExt1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, volume: UINT64) -> MTAPIRES,
    pub IMTConGroupSymbol_VolumeStepExt:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT64,
    pub IMTConGroupSymbol_VolumeStepExtDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT64,
    pub IMTConGroupSymbol_VolumeLimitExt1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, volume: UINT64) -> MTAPIRES,
    pub IMTConGroupSymbol_VolumeLimitExt:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT64,
    pub IMTConGroupSymbol_VolumeLimitExtDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT64,
    pub IMTConGroupSymbol_IEVolumeMaxExt1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, volume: UINT64) -> MTAPIRES,
    pub IMTConGroupSymbol_IEVolumeMaxExt:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT64,
    pub IMTConGroupSymbol_IEVolumeMaxExtDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT64,
    pub IMTConGroupSymbol_SwapYearDays1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, days: UINT) -> MTAPIRES,
    pub IMTConGroupSymbol_SwapYearDays:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_SwapYearDaysDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_SwapFlags1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, flags: UINT) -> MTAPIRES,
    pub IMTConGroupSymbol_SwapFlags: unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_SwapFlagsDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> UINT,
    pub IMTConGroupSymbol_SwapRateSunday1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, rate: f64) -> MTAPIRES,
    pub IMTConGroupSymbol_SwapRateSunday:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_SwapRateSundayDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_SwapRateMonday1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, rate: f64) -> MTAPIRES,
    pub IMTConGroupSymbol_SwapRateMonday:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_SwapRateMondayDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_SwapRateTuesday1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, rate: f64) -> MTAPIRES,
    pub IMTConGroupSymbol_SwapRateTuesday:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_SwapRateTuesdayDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_SwapRateWednesday1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, rate: f64) -> MTAPIRES,
    pub IMTConGroupSymbol_SwapRateWednesday:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_SwapRateWednesdayDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_SwapRateThursday1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, rate: f64) -> MTAPIRES,
    pub IMTConGroupSymbol_SwapRateThursday:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_SwapRateThursdayDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_SwapRateFriday1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, rate: f64) -> MTAPIRES,
    pub IMTConGroupSymbol_SwapRateFriday:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_SwapRateFridayDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_SwapRateSaturday1:
        unsafe extern "C" fn(this: *mut IMTConGroupSymbol, rate: f64) -> MTAPIRES,
    pub IMTConGroupSymbol_SwapRateSaturday:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
    pub IMTConGroupSymbol_SwapRateSaturdayDefault:
        unsafe extern "C" fn(this: *const IMTConGroupSymbol) -> f64,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConGroupSymbol {
    pub vtable_: *const IMTConGroupSymbol__bindgen_vtable,
}
pub const IMTConGroupSymbol_EnREFlags_RE_FLAGS_NONE: IMTConGroupSymbol_EnREFlags = 0;
pub const IMTConGroupSymbol_EnREFlags_RE_FLAGS_ORDER: IMTConGroupSymbol_EnREFlags = 1;
pub const IMTConGroupSymbol_EnREFlags_RE_FLAGS_ALL: IMTConGroupSymbol_EnREFlags = 1;
pub type IMTConGroupSymbol_EnREFlags = ::std::os::raw::c_int;
pub const IMTConGroupSymbol_EnPermissionsFlags_PERMISSION_NONE:
    IMTConGroupSymbol_EnPermissionsFlags = 0;
pub const IMTConGroupSymbol_EnPermissionsFlags_PERMISSION_BOOK:
    IMTConGroupSymbol_EnPermissionsFlags = 1;
pub const IMTConGroupSymbol_EnPermissionsFlags_PERMISSION_DEFAULT:
    IMTConGroupSymbol_EnPermissionsFlags = 1;
pub const IMTConGroupSymbol_EnPermissionsFlags_PERMISSION_ALL:
    IMTConGroupSymbol_EnPermissionsFlags = 1;
pub type IMTConGroupSymbol_EnPermissionsFlags = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConGroupSymbol"][::std::mem::size_of::<IMTConGroupSymbol>() - 8usize];
    ["Alignment of IMTConGroupSymbol"][::std::mem::align_of::<IMTConGroupSymbol>() - 8usize];
};
#[repr(C)]
pub struct IMTConCommTier__bindgen_vtable {
    pub IMTConCommTier_Release: unsafe extern "C" fn(this: *mut IMTConCommTier),
    pub IMTConCommTier_Assign:
        unsafe extern "C" fn(this: *mut IMTConCommTier, group: *const IMTConCommTier) -> MTAPIRES,
    pub IMTConCommTier_Clear: unsafe extern "C" fn(this: *mut IMTConCommTier) -> MTAPIRES,
    pub IMTConCommTier_Mode1:
        unsafe extern "C" fn(this: *mut IMTConCommTier, mode: UINT) -> MTAPIRES,
    pub IMTConCommTier_Mode: unsafe extern "C" fn(this: *const IMTConCommTier) -> UINT,
    pub IMTConCommTier_Type1:
        unsafe extern "C" fn(this: *mut IMTConCommTier, type_: UINT) -> MTAPIRES,
    pub IMTConCommTier_Type: unsafe extern "C" fn(this: *const IMTConCommTier) -> UINT,
    pub IMTConCommTier_Value1:
        unsafe extern "C" fn(this: *mut IMTConCommTier, value: f64) -> MTAPIRES,
    pub IMTConCommTier_Value: unsafe extern "C" fn(this: *const IMTConCommTier) -> f64,
    pub IMTConCommTier_Minimal1:
        unsafe extern "C" fn(this: *mut IMTConCommTier, value: f64) -> MTAPIRES,
    pub IMTConCommTier_Minimal: unsafe extern "C" fn(this: *const IMTConCommTier) -> f64,
    pub IMTConCommTier_RangeFrom1:
        unsafe extern "C" fn(this: *mut IMTConCommTier, value: f64) -> MTAPIRES,
    pub IMTConCommTier_RangeFrom: unsafe extern "C" fn(this: *const IMTConCommTier) -> f64,
    pub IMTConCommTier_RangeTo1:
        unsafe extern "C" fn(this: *mut IMTConCommTier, value: f64) -> MTAPIRES,
    pub IMTConCommTier_RangeTo: unsafe extern "C" fn(this: *const IMTConCommTier) -> f64,
    pub IMTConCommTier_Currency1:
        unsafe extern "C" fn(this: *mut IMTConCommTier, currency: LPCWSTR) -> MTAPIRES,
    pub IMTConCommTier_Currency: unsafe extern "C" fn(this: *const IMTConCommTier) -> LPCWSTR,
    pub IMTConCommTier_Maximal1:
        unsafe extern "C" fn(this: *mut IMTConCommTier, value: f64) -> MTAPIRES,
    pub IMTConCommTier_Maximal: unsafe extern "C" fn(this: *const IMTConCommTier) -> f64,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConCommTier {
    pub vtable_: *const IMTConCommTier__bindgen_vtable,
}
pub const IMTConCommTier_EnCommissionMode_COMM_MONEY_DEPOSIT: IMTConCommTier_EnCommissionMode = 0;
pub const IMTConCommTier_EnCommissionMode_COMM_MONEY_SYMBOL_BASE: IMTConCommTier_EnCommissionMode =
    1;
pub const IMTConCommTier_EnCommissionMode_COMM_MONEY_SYMBOL_PROFIT:
    IMTConCommTier_EnCommissionMode = 2;
pub const IMTConCommTier_EnCommissionMode_COMM_MONEY_SYMBOL_MARGIN:
    IMTConCommTier_EnCommissionMode = 3;
pub const IMTConCommTier_EnCommissionMode_COMM_PIPS: IMTConCommTier_EnCommissionMode = 4;
pub const IMTConCommTier_EnCommissionMode_COMM_PERCENT: IMTConCommTier_EnCommissionMode = 5;
pub const IMTConCommTier_EnCommissionMode_COMM_MONEY_SPECIFIED: IMTConCommTier_EnCommissionMode = 6;
pub const IMTConCommTier_EnCommissionMode_COMM_PERCENT_PROFIT: IMTConCommTier_EnCommissionMode = 7;
pub const IMTConCommTier_EnCommissionMode_COMM_FIRST: IMTConCommTier_EnCommissionMode = 0;
pub const IMTConCommTier_EnCommissionMode_COMM_LAST: IMTConCommTier_EnCommissionMode = 7;
pub type IMTConCommTier_EnCommissionMode = ::std::os::raw::c_int;
pub const IMTConCommTier_EnCommissionVolumeType_COMM_TYPE_DEAL:
    IMTConCommTier_EnCommissionVolumeType = 0;
pub const IMTConCommTier_EnCommissionVolumeType_COMM_TYPE_VOLUME:
    IMTConCommTier_EnCommissionVolumeType = 1;
pub const IMTConCommTier_EnCommissionVolumeType_COMM_TYPE_FIRST:
    IMTConCommTier_EnCommissionVolumeType = 0;
pub const IMTConCommTier_EnCommissionVolumeType_COMM_TYPE_LAST:
    IMTConCommTier_EnCommissionVolumeType = 1;
pub type IMTConCommTier_EnCommissionVolumeType = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConCommTier"][::std::mem::size_of::<IMTConCommTier>() - 8usize];
    ["Alignment of IMTConCommTier"][::std::mem::align_of::<IMTConCommTier>() - 8usize];
};
#[repr(C)]
pub struct IMTConCommission__bindgen_vtable {
    pub IMTConCommission_Release: unsafe extern "C" fn(this: *mut IMTConCommission),
    pub IMTConCommission_Assign: unsafe extern "C" fn(
        this: *mut IMTConCommission,
        group: *const IMTConCommission,
    ) -> MTAPIRES,
    pub IMTConCommission_Clear: unsafe extern "C" fn(this: *mut IMTConCommission) -> MTAPIRES,
    pub IMTConCommission_Name1:
        unsafe extern "C" fn(this: *mut IMTConCommission, name: LPCWSTR) -> MTAPIRES,
    pub IMTConCommission_Name: unsafe extern "C" fn(this: *const IMTConCommission) -> LPCWSTR,
    pub IMTConCommission_Description1:
        unsafe extern "C" fn(this: *mut IMTConCommission, descr: LPCWSTR) -> MTAPIRES,
    pub IMTConCommission_Description:
        unsafe extern "C" fn(this: *const IMTConCommission) -> LPCWSTR,
    pub IMTConCommission_Path1:
        unsafe extern "C" fn(this: *mut IMTConCommission, path: LPCWSTR) -> MTAPIRES,
    pub IMTConCommission_Path: unsafe extern "C" fn(this: *const IMTConCommission) -> LPCWSTR,
    pub IMTConCommission_Mode1:
        unsafe extern "C" fn(this: *mut IMTConCommission, mode: UINT) -> MTAPIRES,
    pub IMTConCommission_Mode: unsafe extern "C" fn(this: *const IMTConCommission) -> UINT,
    pub IMTConCommission_RangeMode1:
        unsafe extern "C" fn(this: *mut IMTConCommission, mode: UINT) -> MTAPIRES,
    pub IMTConCommission_RangeMode: unsafe extern "C" fn(this: *const IMTConCommission) -> UINT,
    pub IMTConCommission_ChargeMode1:
        unsafe extern "C" fn(this: *mut IMTConCommission, mode: UINT) -> MTAPIRES,
    pub IMTConCommission_ChargeMode: unsafe extern "C" fn(this: *const IMTConCommission) -> UINT,
    pub IMTConCommission_TierAdd:
        unsafe extern "C" fn(this: *mut IMTConCommission, tier: *mut IMTConCommTier) -> MTAPIRES,
    pub IMTConCommission_TierUpdate: unsafe extern "C" fn(
        this: *mut IMTConCommission,
        pos: UINT,
        tier: *const IMTConCommTier,
    ) -> MTAPIRES,
    pub IMTConCommission_TierDelete:
        unsafe extern "C" fn(this: *mut IMTConCommission, pos: UINT) -> MTAPIRES,
    pub IMTConCommission_TierClear: unsafe extern "C" fn(this: *mut IMTConCommission) -> MTAPIRES,
    pub IMTConCommission_TierShift: unsafe extern "C" fn(
        this: *mut IMTConCommission,
        pos: UINT,
        shift: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTConCommission_TierTotal: unsafe extern "C" fn(this: *const IMTConCommission) -> UINT,
    pub IMTConCommission_TierNext: unsafe extern "C" fn(
        this: *const IMTConCommission,
        pos: UINT,
        tier: *mut IMTConCommTier,
    ) -> MTAPIRES,
    pub IMTConCommission_TurnoverCurrency1:
        unsafe extern "C" fn(this: *mut IMTConCommission, currency: LPCWSTR) -> MTAPIRES,
    pub IMTConCommission_TurnoverCurrency:
        unsafe extern "C" fn(this: *const IMTConCommission) -> LPCWSTR,
    pub IMTConCommission_EntryMode1:
        unsafe extern "C" fn(this: *mut IMTConCommission, mode: UINT) -> MTAPIRES,
    pub IMTConCommission_EntryMode: unsafe extern "C" fn(this: *const IMTConCommission) -> UINT,
    pub IMTConCommission_ActionMode1:
        unsafe extern "C" fn(this: *mut IMTConCommission, mode: UINT) -> MTAPIRES,
    pub IMTConCommission_ActionMode: unsafe extern "C" fn(this: *const IMTConCommission) -> UINT,
    pub IMTConCommission_ProfitMode1:
        unsafe extern "C" fn(this: *mut IMTConCommission, mode: UINT) -> MTAPIRES,
    pub IMTConCommission_ProfitMode: unsafe extern "C" fn(this: *const IMTConCommission) -> UINT,
    pub IMTConCommission_ReasonFlags1:
        unsafe extern "C" fn(this: *mut IMTConCommission, flags: UINT) -> MTAPIRES,
    pub IMTConCommission_ReasonFlags: unsafe extern "C" fn(this: *const IMTConCommission) -> UINT,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConCommission {
    pub vtable_: *const IMTConCommission__bindgen_vtable,
}
pub const IMTConCommission_EnCommMode_COMM_STANDARD: IMTConCommission_EnCommMode = 0;
pub const IMTConCommission_EnCommMode_COMM_AGENT: IMTConCommission_EnCommMode = 1;
pub const IMTConCommission_EnCommMode_COMM_FEE: IMTConCommission_EnCommMode = 2;
pub const IMTConCommission_EnCommMode_COMM_FIRST: IMTConCommission_EnCommMode = 0;
pub const IMTConCommission_EnCommMode_COMM_LAST: IMTConCommission_EnCommMode = 2;
pub type IMTConCommission_EnCommMode = ::std::os::raw::c_int;
pub const IMTConCommission_EnCommRangeMode_COMM_RANGE_VOLUME: IMTConCommission_EnCommRangeMode = 0;
pub const IMTConCommission_EnCommRangeMode_COMM_RANGE_TURNOVER_MONEY:
    IMTConCommission_EnCommRangeMode = 1;
pub const IMTConCommission_EnCommRangeMode_COMM_RANGE_TURNOVER_VOLUME:
    IMTConCommission_EnCommRangeMode = 2;
pub const IMTConCommission_EnCommRangeMode_COMM_RANGE_VALUE: IMTConCommission_EnCommRangeMode = 3;
pub const IMTConCommission_EnCommRangeMode_COMM_RANGE_PROFIT: IMTConCommission_EnCommRangeMode = 4;
pub const IMTConCommission_EnCommRangeMode_COMM_RANGE_FIRST: IMTConCommission_EnCommRangeMode = 0;
pub const IMTConCommission_EnCommRangeMode_COMM_RANGE_LAST: IMTConCommission_EnCommRangeMode = 4;
pub type IMTConCommission_EnCommRangeMode = ::std::os::raw::c_int;
pub const IMTConCommission_EnCommChargeMode_COMM_CHARGE_DAILY: IMTConCommission_EnCommChargeMode =
    0;
pub const IMTConCommission_EnCommChargeMode_COMM_CHARGE_MONTHLY: IMTConCommission_EnCommChargeMode =
    1;
pub const IMTConCommission_EnCommChargeMode_COMM_CHARGE_INSTANT: IMTConCommission_EnCommChargeMode =
    2;
pub const IMTConCommission_EnCommChargeMode_COMM_CHARGE_FIRST: IMTConCommission_EnCommChargeMode =
    0;
pub const IMTConCommission_EnCommChargeMode_COMM_CHARGE_LAST: IMTConCommission_EnCommChargeMode = 2;
pub type IMTConCommission_EnCommChargeMode = ::std::os::raw::c_int;
pub const IMTConCommission_EnCommEntryMode_COMM_ENTRY_ALL: IMTConCommission_EnCommEntryMode = 0;
pub const IMTConCommission_EnCommEntryMode_COMM_ENTRY_IN: IMTConCommission_EnCommEntryMode = 1;
pub const IMTConCommission_EnCommEntryMode_COMM_ENTRY_OUT: IMTConCommission_EnCommEntryMode = 2;
pub const IMTConCommission_EnCommEntryMode_COMM_ENTRY_FIRST: IMTConCommission_EnCommEntryMode = 0;
pub const IMTConCommission_EnCommEntryMode_COMM_ENTRY_LAST: IMTConCommission_EnCommEntryMode = 2;
pub type IMTConCommission_EnCommEntryMode = ::std::os::raw::c_int;
pub const IMTConCommission_EnCommActionMode_COMM_ACTION_ALL: IMTConCommission_EnCommActionMode = 0;
pub const IMTConCommission_EnCommActionMode_COMM_ACTION_BUY: IMTConCommission_EnCommActionMode = 1;
pub const IMTConCommission_EnCommActionMode_COMM_ACTION_SELL: IMTConCommission_EnCommActionMode = 2;
pub const IMTConCommission_EnCommActionMode_COMM_ACTION_FIRST: IMTConCommission_EnCommActionMode =
    0;
pub const IMTConCommission_EnCommActionMode_COMM_ACTION_LAST: IMTConCommission_EnCommActionMode = 2;
pub type IMTConCommission_EnCommActionMode = ::std::os::raw::c_int;
pub const IMTConCommission_EnCommProfitMode_COMM_PROFIT_ALL: IMTConCommission_EnCommProfitMode = 0;
pub const IMTConCommission_EnCommProfitMode_COMM_PROFIT_PROFIT: IMTConCommission_EnCommProfitMode =
    1;
pub const IMTConCommission_EnCommProfitMode_COMM_PROFIT_LOSS: IMTConCommission_EnCommProfitMode = 2;
pub const IMTConCommission_EnCommProfitMode_COMM_PROFIT_FIRST: IMTConCommission_EnCommProfitMode =
    0;
pub const IMTConCommission_EnCommProfitMode_COMM_PROFIT_LAST: IMTConCommission_EnCommProfitMode = 2;
pub type IMTConCommission_EnCommProfitMode = ::std::os::raw::c_int;
pub const IMTConCommission_EnCommReasonFlags_COMM_REASON_FLAG_NONE:
    IMTConCommission_EnCommReasonFlags = 0;
pub const IMTConCommission_EnCommReasonFlags_COMM_REASON_FLAG_CLIENT:
    IMTConCommission_EnCommReasonFlags = 1;
pub const IMTConCommission_EnCommReasonFlags_COMM_REASON_FLAG_EXPERT:
    IMTConCommission_EnCommReasonFlags = 2;
pub const IMTConCommission_EnCommReasonFlags_COMM_REASON_FLAG_DEALER:
    IMTConCommission_EnCommReasonFlags = 4;
pub const IMTConCommission_EnCommReasonFlags_COMM_REASON_FLAG_EXTERNAL_CLIENT:
    IMTConCommission_EnCommReasonFlags = 8;
pub const IMTConCommission_EnCommReasonFlags_COMM_REASON_FLAG_MOBILE:
    IMTConCommission_EnCommReasonFlags = 16;
pub const IMTConCommission_EnCommReasonFlags_COMM_REASON_FLAG_WEB:
    IMTConCommission_EnCommReasonFlags = 32;
pub const IMTConCommission_EnCommReasonFlags_COMM_REASON_FLAG_SIGNAL:
    IMTConCommission_EnCommReasonFlags = 64;
pub const IMTConCommission_EnCommReasonFlags_COMM_REASON_FLAG_ALL:
    IMTConCommission_EnCommReasonFlags = 127;
pub type IMTConCommission_EnCommReasonFlags = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConCommission"][::std::mem::size_of::<IMTConCommission>() - 8usize];
    ["Alignment of IMTConCommission"][::std::mem::align_of::<IMTConCommission>() - 8usize];
};
#[repr(C)]
pub struct IMTConGroup__bindgen_vtable {
    pub IMTConGroup_Release: unsafe extern "C" fn(this: *mut IMTConGroup),
    pub IMTConGroup_Assign:
        unsafe extern "C" fn(this: *mut IMTConGroup, group: *const IMTConGroup) -> MTAPIRES,
    pub IMTConGroup_Clear: unsafe extern "C" fn(this: *mut IMTConGroup) -> MTAPIRES,
    pub IMTConGroup_Group1:
        unsafe extern "C" fn(this: *mut IMTConGroup, group: LPCWSTR) -> MTAPIRES,
    pub IMTConGroup_Group: unsafe extern "C" fn(this: *const IMTConGroup) -> LPCWSTR,
    pub IMTConGroup_Server1:
        unsafe extern "C" fn(this: *mut IMTConGroup, server: UINT64) -> MTAPIRES,
    pub IMTConGroup_Server: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT64,
    pub IMTConGroup_PermissionsFlags1:
        unsafe extern "C" fn(this: *mut IMTConGroup, flags: UINT64) -> MTAPIRES,
    pub IMTConGroup_PermissionsFlags: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT64,
    pub IMTConGroup_AuthMode1: unsafe extern "C" fn(this: *mut IMTConGroup, mode: UINT) -> MTAPIRES,
    pub IMTConGroup_AuthMode: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT,
    pub IMTConGroup_AuthPasswordMin1:
        unsafe extern "C" fn(this: *mut IMTConGroup, mode: UINT) -> MTAPIRES,
    pub IMTConGroup_AuthPasswordMin: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT,
    pub IMTConGroup_Company1:
        unsafe extern "C" fn(this: *mut IMTConGroup, company: LPCWSTR) -> MTAPIRES,
    pub IMTConGroup_Company: unsafe extern "C" fn(this: *const IMTConGroup) -> LPCWSTR,
    pub IMTConGroup_CompanyPage1:
        unsafe extern "C" fn(this: *mut IMTConGroup, page: LPCWSTR) -> MTAPIRES,
    pub IMTConGroup_CompanyPage: unsafe extern "C" fn(this: *const IMTConGroup) -> LPCWSTR,
    pub IMTConGroup_CompanyEmail1:
        unsafe extern "C" fn(this: *mut IMTConGroup, email: LPCWSTR) -> MTAPIRES,
    pub IMTConGroup_CompanyEmail: unsafe extern "C" fn(this: *const IMTConGroup) -> LPCWSTR,
    pub IMTConGroup_CompanySupportPage1:
        unsafe extern "C" fn(this: *mut IMTConGroup, page: LPCWSTR) -> MTAPIRES,
    pub IMTConGroup_CompanySupportPage: unsafe extern "C" fn(this: *const IMTConGroup) -> LPCWSTR,
    pub IMTConGroup_CompanySupportEmail1:
        unsafe extern "C" fn(this: *mut IMTConGroup, email: LPCWSTR) -> MTAPIRES,
    pub IMTConGroup_CompanySupportEmail: unsafe extern "C" fn(this: *const IMTConGroup) -> LPCWSTR,
    pub IMTConGroup_CompanyCatalog1:
        unsafe extern "C" fn(this: *mut IMTConGroup, catalog: LPCWSTR) -> MTAPIRES,
    pub IMTConGroup_CompanyCatalog: unsafe extern "C" fn(this: *const IMTConGroup) -> LPCWSTR,
    pub IMTConGroup_Currency1:
        unsafe extern "C" fn(this: *mut IMTConGroup, currency: LPCWSTR) -> MTAPIRES,
    pub IMTConGroup_Currency: unsafe extern "C" fn(this: *const IMTConGroup) -> LPCWSTR,
    pub IMTConGroup_CurrencyDigits: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT,
    pub IMTConGroup_ReportsMode1:
        unsafe extern "C" fn(this: *mut IMTConGroup, mode: UINT) -> MTAPIRES,
    pub IMTConGroup_ReportsMode: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT,
    pub IMTConGroup_ReportsFlags1:
        unsafe extern "C" fn(this: *mut IMTConGroup, flags: UINT64) -> MTAPIRES,
    pub IMTConGroup_ReportsFlags: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT64,
    pub IMTConGroup_ReportsSMTP1:
        unsafe extern "C" fn(this: *mut IMTConGroup, server: LPCWSTR) -> MTAPIRES,
    pub IMTConGroup_ReportsSMTP: unsafe extern "C" fn(this: *const IMTConGroup) -> LPCWSTR,
    pub IMTConGroup_ReportsSMTPLogin1:
        unsafe extern "C" fn(this: *mut IMTConGroup, login: LPCWSTR) -> MTAPIRES,
    pub IMTConGroup_ReportsSMTPLogin: unsafe extern "C" fn(this: *const IMTConGroup) -> LPCWSTR,
    pub IMTConGroup_ReportsSMTPPass1:
        unsafe extern "C" fn(this: *mut IMTConGroup, password: LPCWSTR) -> MTAPIRES,
    pub IMTConGroup_ReportsSMTPPass: unsafe extern "C" fn(this: *const IMTConGroup) -> LPCWSTR,
    pub IMTConGroup_NewsMode1: unsafe extern "C" fn(this: *mut IMTConGroup, mode: UINT) -> MTAPIRES,
    pub IMTConGroup_NewsMode: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT,
    pub IMTConGroup_NewsCategory1:
        unsafe extern "C" fn(this: *mut IMTConGroup, category: LPCWSTR) -> MTAPIRES,
    pub IMTConGroup_NewsCategory: unsafe extern "C" fn(this: *const IMTConGroup) -> LPCWSTR,
    pub IMTConGroup_NewsLangAdd:
        unsafe extern "C" fn(this: *mut IMTConGroup, language: UINT) -> MTAPIRES,
    pub IMTConGroup_NewsLangUpdate:
        unsafe extern "C" fn(this: *mut IMTConGroup, pos: UINT, language: UINT) -> MTAPIRES,
    pub IMTConGroup_NewsLangDelete:
        unsafe extern "C" fn(this: *mut IMTConGroup, pos: UINT) -> MTAPIRES,
    pub IMTConGroup_NewsLangClear: unsafe extern "C" fn(this: *mut IMTConGroup) -> MTAPIRES,
    pub IMTConGroup_NewsLangTotal: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT,
    pub IMTConGroup_NewsLangNext: unsafe extern "C" fn(this: *const IMTConGroup, pos: UINT) -> UINT,
    pub IMTConGroup_MailMode1: unsafe extern "C" fn(this: *mut IMTConGroup, mode: UINT) -> MTAPIRES,
    pub IMTConGroup_MailMode: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT,
    pub IMTConGroup_TradeFlags1:
        unsafe extern "C" fn(this: *mut IMTConGroup, flags: UINT64) -> MTAPIRES,
    pub IMTConGroup_TradeFlags: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT64,
    pub IMTConGroup_TradeInterestrate1:
        unsafe extern "C" fn(this: *mut IMTConGroup, rate: f64) -> MTAPIRES,
    pub IMTConGroup_TradeInterestrate: unsafe extern "C" fn(this: *const IMTConGroup) -> f64,
    pub IMTConGroup_TradeVirtualCredit1:
        unsafe extern "C" fn(this: *mut IMTConGroup, credit: f64) -> MTAPIRES,
    pub IMTConGroup_TradeVirtualCredit: unsafe extern "C" fn(this: *const IMTConGroup) -> f64,
    pub IMTConGroup_MarginFreeMode1:
        unsafe extern "C" fn(this: *mut IMTConGroup, freemode: UINT) -> MTAPIRES,
    pub IMTConGroup_MarginFreeMode: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT,
    pub IMTConGroup_MarginSOMode1:
        unsafe extern "C" fn(this: *mut IMTConGroup, level: UINT) -> MTAPIRES,
    pub IMTConGroup_MarginSOMode: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT,
    pub IMTConGroup_MarginCall1:
        unsafe extern "C" fn(this: *mut IMTConGroup, level: f64) -> MTAPIRES,
    pub IMTConGroup_MarginCall: unsafe extern "C" fn(this: *const IMTConGroup) -> f64,
    pub IMTConGroup_MarginStopOut1:
        unsafe extern "C" fn(this: *mut IMTConGroup, level: f64) -> MTAPIRES,
    pub IMTConGroup_MarginStopOut: unsafe extern "C" fn(this: *const IMTConGroup) -> f64,
    pub IMTConGroup_DemoLeverage1:
        unsafe extern "C" fn(this: *mut IMTConGroup, leverage: UINT) -> MTAPIRES,
    pub IMTConGroup_DemoLeverage: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT,
    pub IMTConGroup_DemoDeposit1:
        unsafe extern "C" fn(this: *mut IMTConGroup, deposit: f64) -> MTAPIRES,
    pub IMTConGroup_DemoDeposit: unsafe extern "C" fn(this: *const IMTConGroup) -> f64,
    pub IMTConGroup_LimitHistory1:
        unsafe extern "C" fn(this: *mut IMTConGroup, limit: UINT) -> MTAPIRES,
    pub IMTConGroup_LimitHistory: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT,
    pub IMTConGroup_LimitOrders1:
        unsafe extern "C" fn(this: *mut IMTConGroup, limit: UINT) -> MTAPIRES,
    pub IMTConGroup_LimitOrders: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT,
    pub IMTConGroup_LimitSymbols1:
        unsafe extern "C" fn(this: *mut IMTConGroup, limit: UINT) -> MTAPIRES,
    pub IMTConGroup_LimitSymbols: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT,
    pub IMTConGroup_CommissionAdd:
        unsafe extern "C" fn(this: *mut IMTConGroup, commission: *mut IMTConCommission) -> MTAPIRES,
    pub IMTConGroup_CommissionUpdate: unsafe extern "C" fn(
        this: *mut IMTConGroup,
        pos: UINT,
        commission: *const IMTConCommission,
    ) -> MTAPIRES,
    pub IMTConGroup_CommissionDelete:
        unsafe extern "C" fn(this: *mut IMTConGroup, pos: UINT) -> MTAPIRES,
    pub IMTConGroup_CommissionClear: unsafe extern "C" fn(this: *mut IMTConGroup) -> MTAPIRES,
    pub IMTConGroup_CommissionShift: unsafe extern "C" fn(
        this: *mut IMTConGroup,
        pos: UINT,
        shift: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTConGroup_CommissionTotal: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT,
    pub IMTConGroup_CommissionNext: unsafe extern "C" fn(
        this: *const IMTConGroup,
        pos: UINT,
        commission: *mut IMTConCommission,
    ) -> MTAPIRES,
    pub IMTConGroup_CommissionGet: unsafe extern "C" fn(
        this: *const IMTConGroup,
        name: LPCWSTR,
        commission: *mut IMTConCommission,
    ) -> MTAPIRES,
    pub IMTConGroup_SymbolAdd:
        unsafe extern "C" fn(this: *mut IMTConGroup, symbol: *mut IMTConGroupSymbol) -> MTAPIRES,
    pub IMTConGroup_SymbolUpdate: unsafe extern "C" fn(
        this: *mut IMTConGroup,
        pos: UINT,
        symbol: *const IMTConGroupSymbol,
    ) -> MTAPIRES,
    pub IMTConGroup_SymbolDelete:
        unsafe extern "C" fn(this: *mut IMTConGroup, pos: UINT) -> MTAPIRES,
    pub IMTConGroup_SymbolClear: unsafe extern "C" fn(this: *mut IMTConGroup) -> MTAPIRES,
    pub IMTConGroup_SymbolShift: unsafe extern "C" fn(
        this: *mut IMTConGroup,
        pos: UINT,
        shift: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTConGroup_SymbolTotal: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT,
    pub IMTConGroup_SymbolNext: unsafe extern "C" fn(
        this: *const IMTConGroup,
        pos: UINT,
        symbol: *mut IMTConGroupSymbol,
    ) -> MTAPIRES,
    pub IMTConGroup_SymbolGet: unsafe extern "C" fn(
        this: *const IMTConGroup,
        name: LPCWSTR,
        symbol: *mut IMTConGroupSymbol,
    ) -> MTAPIRES,
    pub IMTConGroup_MarginFreeProfitMode1:
        unsafe extern "C" fn(this: *mut IMTConGroup, mode: UINT) -> MTAPIRES,
    pub IMTConGroup_MarginFreeProfitMode: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT,
    pub IMTConGroup_MarginMode1:
        unsafe extern "C" fn(this: *mut IMTConGroup, mode: UINT) -> MTAPIRES,
    pub IMTConGroup_MarginMode: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT,
    pub IMTConGroup_AuthOTPMode1:
        unsafe extern "C" fn(this: *mut IMTConGroup, mode: UINT) -> MTAPIRES,
    pub IMTConGroup_AuthOTPMode: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT,
    pub IMTConGroup_TradeTransferMode1:
        unsafe extern "C" fn(this: *mut IMTConGroup, mode: UINT) -> MTAPIRES,
    pub IMTConGroup_TradeTransferMode: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT,
    pub IMTConGroup_MarginFlags1:
        unsafe extern "C" fn(this: *mut IMTConGroup, flags: UINT64) -> MTAPIRES,
    pub IMTConGroup_MarginFlags: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT64,
    pub IMTConGroup_LimitPositions1:
        unsafe extern "C" fn(this: *mut IMTConGroup, limit: UINT) -> MTAPIRES,
    pub IMTConGroup_LimitPositions: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT,
    pub IMTConGroup_CurrencyDigitsSet:
        unsafe extern "C" fn(this: *mut IMTConGroup, currency_digits: UINT) -> MTAPIRES,
    pub IMTConGroup_ReportsEmail1:
        unsafe extern "C" fn(this: *mut IMTConGroup, email: LPCWSTR) -> MTAPIRES,
    pub IMTConGroup_ReportsEmail: unsafe extern "C" fn(this: *const IMTConGroup) -> LPCWSTR,
    pub IMTConGroup_CompanyDepositPage1:
        unsafe extern "C" fn(this: *mut IMTConGroup, url: LPCWSTR) -> MTAPIRES,
    pub IMTConGroup_CompanyDepositPage: unsafe extern "C" fn(this: *const IMTConGroup) -> LPCWSTR,
    pub IMTConGroup_CompanyWithdrawalPage1:
        unsafe extern "C" fn(this: *mut IMTConGroup, url: LPCWSTR) -> MTAPIRES,
    pub IMTConGroup_CompanyWithdrawalPage:
        unsafe extern "C" fn(this: *const IMTConGroup) -> LPCWSTR,
    pub IMTConGroup_DemoInactivityPeriod1:
        unsafe extern "C" fn(this: *mut IMTConGroup, period: UINT) -> MTAPIRES,
    pub IMTConGroup_DemoInactivityPeriod: unsafe extern "C" fn(this: *const IMTConGroup) -> UINT,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConGroup {
    pub vtable_: *const IMTConGroup__bindgen_vtable,
}
pub const IMTConGroup_EnPermissionsFlags_PERMISSION_NONE: IMTConGroup_EnPermissionsFlags = 0;
pub const IMTConGroup_EnPermissionsFlags_PERMISSION_CERT_CONFIRM: IMTConGroup_EnPermissionsFlags =
    1;
pub const IMTConGroup_EnPermissionsFlags_PERMISSION_ENABLE_CONNECTION:
    IMTConGroup_EnPermissionsFlags = 2;
pub const IMTConGroup_EnPermissionsFlags_PERMISSION_RESET_PASSWORD: IMTConGroup_EnPermissionsFlags =
    4;
pub const IMTConGroup_EnPermissionsFlags_PERMISSION_FORCED_OTP_USAGE:
    IMTConGroup_EnPermissionsFlags = 8;
pub const IMTConGroup_EnPermissionsFlags_PERMISSION_RISK_WARNING: IMTConGroup_EnPermissionsFlags =
    16;
pub const IMTConGroup_EnPermissionsFlags_PERMISSION_REGULATION_PROTECT:
    IMTConGroup_EnPermissionsFlags = 32;
pub const IMTConGroup_EnPermissionsFlags_PERMISSION_NOTIFY_DEALS: IMTConGroup_EnPermissionsFlags =
    64;
pub const IMTConGroup_EnPermissionsFlags_PERMISSION_NOTIFY_ORDERS: IMTConGroup_EnPermissionsFlags =
    128;
pub const IMTConGroup_EnPermissionsFlags_PERMISSION_NOTIFY_BALANCES:
    IMTConGroup_EnPermissionsFlags = 256;
pub const IMTConGroup_EnPermissionsFlags_PERMISSION_NOTIFY_ALL: IMTConGroup_EnPermissionsFlags =
    448;
pub const IMTConGroup_EnPermissionsFlags_PERMISSION_ALL: IMTConGroup_EnPermissionsFlags = 511;
pub type IMTConGroup_EnPermissionsFlags = ::std::os::raw::c_int;
pub const IMTConGroup_EnAuthMode_AUTH_STANDARD: IMTConGroup_EnAuthMode = 0;
pub const IMTConGroup_EnAuthMode_AUTH_RSA1024: IMTConGroup_EnAuthMode = 1;
pub const IMTConGroup_EnAuthMode_AUTH_RSA2048: IMTConGroup_EnAuthMode = 2;
pub const IMTConGroup_EnAuthMode_AUTH_RSA_CUSTOM: IMTConGroup_EnAuthMode = 3;
pub const IMTConGroup_EnAuthMode_AUTH_FIRST: IMTConGroup_EnAuthMode = 0;
pub const IMTConGroup_EnAuthMode_AUTH_LAST: IMTConGroup_EnAuthMode = 2;
pub type IMTConGroup_EnAuthMode = ::std::os::raw::c_int;
pub const IMTConGroup_EnAuthOTPMode_AUTH_OTP_DISABLED: IMTConGroup_EnAuthOTPMode = 0;
pub const IMTConGroup_EnAuthOTPMode_AUTH_OTP_TOTP_SHA256: IMTConGroup_EnAuthOTPMode = 1;
pub const IMTConGroup_EnAuthOTPMode_AUTH_OTP_TOTP_SHA256_WEB: IMTConGroup_EnAuthOTPMode = 2;
pub const IMTConGroup_EnAuthOTPMode_AUTH_OTP_FIRST: IMTConGroup_EnAuthOTPMode = 0;
pub const IMTConGroup_EnAuthOTPMode_AUTH_OTP_LAST: IMTConGroup_EnAuthOTPMode = 2;
pub type IMTConGroup_EnAuthOTPMode = ::std::os::raw::c_int;
pub const IMTConGroup_EnReportsMode_REPORTS_DISABLED: IMTConGroup_EnReportsMode = 0;
pub const IMTConGroup_EnReportsMode_REPORTS_STANDARD: IMTConGroup_EnReportsMode = 1;
pub const IMTConGroup_EnReportsMode_REPORTS_FIRST: IMTConGroup_EnReportsMode = 0;
pub const IMTConGroup_EnReportsMode_REPORTS_LAST: IMTConGroup_EnReportsMode = 1;
pub type IMTConGroup_EnReportsMode = ::std::os::raw::c_int;
pub const IMTConGroup_EnReportsFlags_REPORTSFLAGS_NONE: IMTConGroup_EnReportsFlags = 0;
pub const IMTConGroup_EnReportsFlags_REPORTSFLAGS_EMAIL: IMTConGroup_EnReportsFlags = 1;
pub const IMTConGroup_EnReportsFlags_REPORTSFLAGS_SUPPORT: IMTConGroup_EnReportsFlags = 2;
pub const IMTConGroup_EnReportsFlags_REPORTSFLAGS_STATEMENTS: IMTConGroup_EnReportsFlags = 4;
pub const IMTConGroup_EnReportsFlags_REPORTSFLAGS_ALL: IMTConGroup_EnReportsFlags = 5;
pub type IMTConGroup_EnReportsFlags = ::std::os::raw::c_int;
pub const IMTConGroup_EnNewsMode_NEWS_MODE_DISABLED: IMTConGroup_EnNewsMode = 0;
pub const IMTConGroup_EnNewsMode_NEWS_MODE_HEADERS: IMTConGroup_EnNewsMode = 1;
pub const IMTConGroup_EnNewsMode_NEWS_MODE_FULL: IMTConGroup_EnNewsMode = 2;
pub const IMTConGroup_EnNewsMode_NEWS_MODE_FIRST: IMTConGroup_EnNewsMode = 0;
pub const IMTConGroup_EnNewsMode_NEWS_MODE_LAST: IMTConGroup_EnNewsMode = 2;
pub type IMTConGroup_EnNewsMode = ::std::os::raw::c_int;
pub const IMTConGroup_EnMailMode_MAIL_MODE_DISABLED: IMTConGroup_EnMailMode = 0;
pub const IMTConGroup_EnMailMode_MAIL_MODE_FULL: IMTConGroup_EnMailMode = 1;
pub const IMTConGroup_EnMailMode_MAIL_MODE_FIRST: IMTConGroup_EnMailMode = 0;
pub const IMTConGroup_EnMailMode_MAIL_MODE_LAST: IMTConGroup_EnMailMode = 1;
pub type IMTConGroup_EnMailMode = ::std::os::raw::c_int;
pub const IMTConGroup_EnHistoryLimit_TRADE_HISTORY_ALL: IMTConGroup_EnHistoryLimit = 0;
pub const IMTConGroup_EnHistoryLimit_TRADE_HISTORY_MONTHS_1: IMTConGroup_EnHistoryLimit = 1;
pub const IMTConGroup_EnHistoryLimit_TRADE_HISTORY_MONTHS_3: IMTConGroup_EnHistoryLimit = 2;
pub const IMTConGroup_EnHistoryLimit_TRADE_HISTORY_MONTHS_6: IMTConGroup_EnHistoryLimit = 3;
pub const IMTConGroup_EnHistoryLimit_TRADE_HISTORY_YEAR_1: IMTConGroup_EnHistoryLimit = 4;
pub const IMTConGroup_EnHistoryLimit_TRADE_HISTORY_YEAR_2: IMTConGroup_EnHistoryLimit = 5;
pub const IMTConGroup_EnHistoryLimit_TRADE_HISTORY_YEAR_3: IMTConGroup_EnHistoryLimit = 6;
pub const IMTConGroup_EnHistoryLimit_TRADE_HISTORY_FIRST: IMTConGroup_EnHistoryLimit = 0;
pub const IMTConGroup_EnHistoryLimit_TRADE_HISTORY_LAST: IMTConGroup_EnHistoryLimit = 6;
pub type IMTConGroup_EnHistoryLimit = ::std::os::raw::c_int;
pub const IMTConGroup_EnFreeMarginMode_FREE_MARGIN_NOT_USE_PL: IMTConGroup_EnFreeMarginMode = 0;
pub const IMTConGroup_EnFreeMarginMode_FREE_MARGIN_USE_PL: IMTConGroup_EnFreeMarginMode = 1;
pub const IMTConGroup_EnFreeMarginMode_FREE_MARGIN_PROFIT: IMTConGroup_EnFreeMarginMode = 2;
pub const IMTConGroup_EnFreeMarginMode_FREE_MARGIN_LOSS: IMTConGroup_EnFreeMarginMode = 3;
pub const IMTConGroup_EnFreeMarginMode_FREE_MARGIN_FIRST: IMTConGroup_EnFreeMarginMode = 0;
pub const IMTConGroup_EnFreeMarginMode_FREE_MARGIN_LAST: IMTConGroup_EnFreeMarginMode = 3;
pub type IMTConGroup_EnFreeMarginMode = ::std::os::raw::c_int;
pub const IMTConGroup_EnTransferMode_TRANSFER_MODE_DISABLED: IMTConGroup_EnTransferMode = 0;
pub const IMTConGroup_EnTransferMode_TRANSFER_MODE_NAME: IMTConGroup_EnTransferMode = 1;
pub const IMTConGroup_EnTransferMode_TRANSFER_MODE_GROUP: IMTConGroup_EnTransferMode = 2;
pub const IMTConGroup_EnTransferMode_TRANSFER_MODE_NAME_GROUP: IMTConGroup_EnTransferMode = 3;
pub const IMTConGroup_EnTransferMode_TRANSFER_MODE_FIRST: IMTConGroup_EnTransferMode = 0;
pub const IMTConGroup_EnTransferMode_TRANSFER_MODE_LAST: IMTConGroup_EnTransferMode = 3;
pub type IMTConGroup_EnTransferMode = ::std::os::raw::c_int;
pub const IMTConGroup_EnStopOutMode_STOPOUT_PERCENT: IMTConGroup_EnStopOutMode = 0;
pub const IMTConGroup_EnStopOutMode_STOPOUT_MONEY: IMTConGroup_EnStopOutMode = 1;
pub const IMTConGroup_EnStopOutMode_STOPOUT_FIRST: IMTConGroup_EnStopOutMode = 0;
pub const IMTConGroup_EnStopOutMode_STOPOUT_LAST: IMTConGroup_EnStopOutMode = 1;
pub type IMTConGroup_EnStopOutMode = ::std::os::raw::c_int;
pub const IMTConGroup_EnMarginFreeProfitMode_FREE_MARGIN_PROFIT_PL:
    IMTConGroup_EnMarginFreeProfitMode = 0;
pub const IMTConGroup_EnMarginFreeProfitMode_FREE_MARGIN_PROFIT_LOSS:
    IMTConGroup_EnMarginFreeProfitMode = 1;
pub const IMTConGroup_EnMarginFreeProfitMode_FREE_MARGIN_PROFIT_FIRST:
    IMTConGroup_EnMarginFreeProfitMode = 0;
pub const IMTConGroup_EnMarginFreeProfitMode_FREE_MARGIN_PROFIT_LAST:
    IMTConGroup_EnMarginFreeProfitMode = 1;
pub type IMTConGroup_EnMarginFreeProfitMode = ::std::os::raw::c_int;
pub const IMTConGroup_EnMarginMode_MARGIN_MODE_RETAIL: IMTConGroup_EnMarginMode = 0;
pub const IMTConGroup_EnMarginMode_MARGIN_MODE_EXCHANGE_DISCOUNT: IMTConGroup_EnMarginMode = 1;
pub const IMTConGroup_EnMarginMode_MARGIN_MODE_RETAIL_HEDGED: IMTConGroup_EnMarginMode = 2;
pub const IMTConGroup_EnMarginMode_MARGIN_MODE_FIRST: IMTConGroup_EnMarginMode = 0;
pub const IMTConGroup_EnMarginMode_MARGIN_MODE_LAST: IMTConGroup_EnMarginMode = 2;
pub type IMTConGroup_EnMarginMode = ::std::os::raw::c_int;
pub const IMTConGroup_EnMarginFlags_MARGIN_FLAGS_NONE: IMTConGroup_EnMarginFlags = 0;
pub const IMTConGroup_EnMarginFlags_MARGIN_FLAGS_CLEAR_ACC: IMTConGroup_EnMarginFlags = 1;
pub const IMTConGroup_EnMarginFlags_MARGIN_FLAGS_ALL: IMTConGroup_EnMarginFlags = 1;
pub type IMTConGroup_EnMarginFlags = ::std::os::raw::c_int;
pub const IMTConGroup_EnTradeFlags_TRADEFLAGS_NONE: IMTConGroup_EnTradeFlags = 0;
pub const IMTConGroup_EnTradeFlags_TRADEFLAGS_SWAPS: IMTConGroup_EnTradeFlags = 1;
pub const IMTConGroup_EnTradeFlags_TRADEFLAGS_TRAILING: IMTConGroup_EnTradeFlags = 2;
pub const IMTConGroup_EnTradeFlags_TRADEFLAGS_EXPERTS: IMTConGroup_EnTradeFlags = 4;
pub const IMTConGroup_EnTradeFlags_TRADEFLAGS_EXPIRATION: IMTConGroup_EnTradeFlags = 8;
pub const IMTConGroup_EnTradeFlags_TRADEFLAGS_SIGNALS_ALL: IMTConGroup_EnTradeFlags = 16;
pub const IMTConGroup_EnTradeFlags_TRADEFLAGS_SIGNALS_OWN: IMTConGroup_EnTradeFlags = 32;
pub const IMTConGroup_EnTradeFlags_TRADEFLAGS_SO_COMPENSATION: IMTConGroup_EnTradeFlags = 64;
pub const IMTConGroup_EnTradeFlags_TRADEFLAGS_SO_FULLY_HEDGED: IMTConGroup_EnTradeFlags = 128;
pub const IMTConGroup_EnTradeFlags_TRADEFLAGS_FIFO_CLOSE: IMTConGroup_EnTradeFlags = 256;
pub const IMTConGroup_EnTradeFlags_TRADEFLAGS_HEDGE_PROHIBIT: IMTConGroup_EnTradeFlags = 512;
pub const IMTConGroup_EnTradeFlags_TRADEFLAGS_DEAL_COST: IMTConGroup_EnTradeFlags = 1024;
pub const IMTConGroup_EnTradeFlags_TRADEFLAGS_SO_COMPENSATION_CREDIT: IMTConGroup_EnTradeFlags =
    2048;
pub const IMTConGroup_EnTradeFlags_TRADEFLAGS_DEFAULT: IMTConGroup_EnTradeFlags = 31;
pub const IMTConGroup_EnTradeFlags_TRADEFLAGS_ALL: IMTConGroup_EnTradeFlags = 4095;
pub type IMTConGroup_EnTradeFlags = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConGroup"][::std::mem::size_of::<IMTConGroup>() - 8usize];
    ["Alignment of IMTConGroup"][::std::mem::align_of::<IMTConGroup>() - 8usize];
};
#[repr(C)]
pub struct IMTConGroupSink__bindgen_vtable {}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMTConGroupSink {
    pub vtable_: *const IMTConGroupSink__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConGroupSink"][::std::mem::size_of::<IMTConGroupSink>() - 8usize];
    ["Alignment of IMTConGroupSink"][::std::mem::align_of::<IMTConGroupSink>() - 8usize];
};
#[repr(C)]
pub struct IMTConManagerAccess__bindgen_vtable {
    pub IMTConManagerAccess_Release: unsafe extern "C" fn(this: *mut IMTConManagerAccess),
    pub IMTConManagerAccess_Assign: unsafe extern "C" fn(
        this: *mut IMTConManagerAccess,
        access: *const IMTConManagerAccess,
    ) -> MTAPIRES,
    pub IMTConManagerAccess_Clear: unsafe extern "C" fn(this: *mut IMTConManagerAccess) -> MTAPIRES,
    pub IMTConManagerAccess_From1:
        unsafe extern "C" fn(this: *mut IMTConManagerAccess, name: LPCWSTR) -> MTAPIRES,
    pub IMTConManagerAccess_From: unsafe extern "C" fn(this: *const IMTConManagerAccess) -> LPCWSTR,
    pub IMTConManagerAccess_To1:
        unsafe extern "C" fn(this: *mut IMTConManagerAccess, value: LPCWSTR) -> MTAPIRES,
    pub IMTConManagerAccess_To: unsafe extern "C" fn(this: *const IMTConManagerAccess) -> LPCWSTR,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConManagerAccess {
    pub vtable_: *const IMTConManagerAccess__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConManagerAccess"][::std::mem::size_of::<IMTConManagerAccess>() - 8usize];
    ["Alignment of IMTConManagerAccess"][::std::mem::align_of::<IMTConManagerAccess>() - 8usize];
};
#[repr(C)]
pub struct IMTConManager__bindgen_vtable {
    pub IMTConManager_Release: unsafe extern "C" fn(this: *mut IMTConManager),
    pub IMTConManager_Assign:
        unsafe extern "C" fn(this: *mut IMTConManager, manager: *const IMTConManager) -> MTAPIRES,
    pub IMTConManager_Clear: unsafe extern "C" fn(this: *mut IMTConManager) -> MTAPIRES,
    pub IMTConManager_Login1:
        unsafe extern "C" fn(this: *mut IMTConManager, login: UINT64) -> MTAPIRES,
    pub IMTConManager_Login: unsafe extern "C" fn(this: *const IMTConManager) -> UINT64,
    pub IMTConManager_Mailbox1:
        unsafe extern "C" fn(this: *mut IMTConManager, mailbox: LPCWSTR) -> MTAPIRES,
    pub IMTConManager_Mailbox: unsafe extern "C" fn(this: *const IMTConManager) -> LPCWSTR,
    pub IMTConManager_Server: unsafe extern "C" fn(this: *const IMTConManager) -> UINT64,
    pub IMTConManager_LimitLogs1:
        unsafe extern "C" fn(this: *mut IMTConManager, limit: UINT) -> MTAPIRES,
    pub IMTConManager_LimitLogs: unsafe extern "C" fn(this: *const IMTConManager) -> UINT,
    pub IMTConManager_LimitReports1:
        unsafe extern "C" fn(this: *mut IMTConManager, limit: UINT) -> MTAPIRES,
    pub IMTConManager_LimitReports: unsafe extern "C" fn(this: *const IMTConManager) -> UINT,
    pub IMTConManager_Right1:
        unsafe extern "C" fn(this: *mut IMTConManager, right: UINT, flags: UINT) -> MTAPIRES,
    pub IMTConManager_Right: unsafe extern "C" fn(this: *const IMTConManager, right: UINT) -> UINT,
    pub IMTConManager_GroupAdd:
        unsafe extern "C" fn(this: *mut IMTConManager, path: LPCWSTR) -> MTAPIRES,
    pub IMTConManager_GroupUpdate:
        unsafe extern "C" fn(this: *mut IMTConManager, pos: UINT, path: LPCWSTR) -> MTAPIRES,
    pub IMTConManager_GroupShift: unsafe extern "C" fn(
        this: *mut IMTConManager,
        pos: UINT,
        shift: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTConManager_GroupDelete:
        unsafe extern "C" fn(this: *mut IMTConManager, pos: UINT) -> MTAPIRES,
    pub IMTConManager_GroupTotal: unsafe extern "C" fn(this: *const IMTConManager) -> UINT,
    pub IMTConManager_GroupNext:
        unsafe extern "C" fn(this: *const IMTConManager, pos: UINT) -> LPCWSTR,
    pub IMTConManager_AccessAdd: unsafe extern "C" fn(
        this: *mut IMTConManager,
        access: *mut IMTConManagerAccess,
    ) -> MTAPIRES,
    pub IMTConManager_AccessUpdate: unsafe extern "C" fn(
        this: *mut IMTConManager,
        pos: UINT,
        access: *const IMTConManagerAccess,
    ) -> MTAPIRES,
    pub IMTConManager_AccessDelete:
        unsafe extern "C" fn(this: *mut IMTConManager, pos: UINT) -> MTAPIRES,
    pub IMTConManager_AccessShift: unsafe extern "C" fn(
        this: *mut IMTConManager,
        pos: UINT,
        shift: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTConManager_AccessTotal: unsafe extern "C" fn(this: *const IMTConManager) -> UINT,
    pub IMTConManager_AccessNext: unsafe extern "C" fn(
        this: *const IMTConManager,
        pos: UINT,
        access: *mut IMTConManagerAccess,
    ) -> MTAPIRES,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConManager {
    pub vtable_: *const IMTConManager__bindgen_vtable,
}
pub const IMTConManager_EnManagerRights_RIGHT_ADMIN: IMTConManager_EnManagerRights = 0;
pub const IMTConManager_EnManagerRights_RIGHT_MANAGER: IMTConManager_EnManagerRights = 1;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_SERVERS: IMTConManager_EnManagerRights = 10;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_ACCESS: IMTConManager_EnManagerRights = 11;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_TIME: IMTConManager_EnManagerRights = 12;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_HOLIDAYS: IMTConManager_EnManagerRights = 13;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_HST_SYNC: IMTConManager_EnManagerRights = 14;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_SYMBOLS: IMTConManager_EnManagerRights = 15;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_GROUPS: IMTConManager_EnManagerRights = 16;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_MANAGERS: IMTConManager_EnManagerRights = 17;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_DATAFEEDS: IMTConManager_EnManagerRights = 18;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_REQUESTS: IMTConManager_EnManagerRights = 19;
pub const IMTConManager_EnManagerRights_RIGHT_SRV_JOURNALS: IMTConManager_EnManagerRights = 20;
pub const IMTConManager_EnManagerRights_RIGHT_SRV_REPORTS: IMTConManager_EnManagerRights = 21;
pub const IMTConManager_EnManagerRights_RIGHT_CHARTS: IMTConManager_EnManagerRights = 22;
pub const IMTConManager_EnManagerRights_RIGHT_EMAIL: IMTConManager_EnManagerRights = 23;
pub const IMTConManager_EnManagerRights_RIGHT_ACCOUNTANT: IMTConManager_EnManagerRights = 24;
pub const IMTConManager_EnManagerRights_RIGHT_ACC_READ: IMTConManager_EnManagerRights = 25;
pub const IMTConManager_EnManagerRights_RIGHT_ACC_DETAILS: IMTConManager_EnManagerRights = 26;
pub const IMTConManager_EnManagerRights_RIGHT_ACC_MANAGER: IMTConManager_EnManagerRights = 27;
pub const IMTConManager_EnManagerRights_RIGHT_ACC_ONLINE: IMTConManager_EnManagerRights = 28;
pub const IMTConManager_EnManagerRights_RIGHT_TRADES_READ: IMTConManager_EnManagerRights = 29;
pub const IMTConManager_EnManagerRights_RIGHT_TRADES_MANAGER: IMTConManager_EnManagerRights = 30;
pub const IMTConManager_EnManagerRights_RIGHT_QUOTES: IMTConManager_EnManagerRights = 31;
pub const IMTConManager_EnManagerRights_RIGHT_RISK_MANAGER: IMTConManager_EnManagerRights = 32;
pub const IMTConManager_EnManagerRights_RIGHT_REPORTS: IMTConManager_EnManagerRights = 33;
pub const IMTConManager_EnManagerRights_RIGHT_NEWS: IMTConManager_EnManagerRights = 34;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_GATEWAYS: IMTConManager_EnManagerRights = 35;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_PLUGINS: IMTConManager_EnManagerRights = 36;
pub const IMTConManager_EnManagerRights_RIGHT_TRADES_DEALER: IMTConManager_EnManagerRights = 37;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_REPORTS: IMTConManager_EnManagerRights = 38;
pub const IMTConManager_EnManagerRights_RIGHT_EXPORT: IMTConManager_EnManagerRights = 39;
pub const IMTConManager_EnManagerRights_RIGHT_SYMBOL_DETAILS: IMTConManager_EnManagerRights = 40;
pub const IMTConManager_EnManagerRights_RIGHT_TECHSUPPORT: IMTConManager_EnManagerRights = 41;
pub const IMTConManager_EnManagerRights_RIGHT_TRADES_SUPERVISOR: IMTConManager_EnManagerRights = 42;
pub const IMTConManager_EnManagerRights_RIGHT_QUOTES_RAW: IMTConManager_EnManagerRights = 43;
pub const IMTConManager_EnManagerRights_RIGHT_MARKET: IMTConManager_EnManagerRights = 44;
pub const IMTConManager_EnManagerRights_RIGHT_GRP_DETAILS_MARGIN: IMTConManager_EnManagerRights =
    45;
pub const IMTConManager_EnManagerRights_RIGHT_NOTIFICATIONS: IMTConManager_EnManagerRights = 46;
pub const IMTConManager_EnManagerRights_RIGHT_ACC_DELETE: IMTConManager_EnManagerRights = 47;
pub const IMTConManager_EnManagerRights_RIGHT_TRADES_DELETE: IMTConManager_EnManagerRights = 48;
pub const IMTConManager_EnManagerRights_RIGHT_CONFIRM_ACTIONS: IMTConManager_EnManagerRights = 49;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_ECN: IMTConManager_EnManagerRights = 50;
pub const IMTConManager_EnManagerRights_RIGHT_GRP_DETAILS_COMMISSION:
    IMTConManager_EnManagerRights = 51;
pub const IMTConManager_EnManagerRights_RIGHT_SUBSCRIPTIONS_VIEW: IMTConManager_EnManagerRights =
    52;
pub const IMTConManager_EnManagerRights_RIGHT_SUBSCRIPTIONS_EDIT: IMTConManager_EnManagerRights =
    53;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_FUNDS: IMTConManager_EnManagerRights = 54;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_MAILS: IMTConManager_EnManagerRights = 55;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_MESSENGERS: IMTConManager_EnManagerRights = 56;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_KYC: IMTConManager_EnManagerRights = 57;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_AUTOMATIONS: IMTConManager_EnManagerRights = 58;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_ALLOCATIONS: IMTConManager_EnManagerRights = 59;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_VPS: IMTConManager_EnManagerRights = 60;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_PAYMENTS: IMTConManager_EnManagerRights = 61;
pub const IMTConManager_EnManagerRights_RIGHT_ADMIN_COMPUTER: IMTConManager_EnManagerRights = 62;
pub const IMTConManager_EnManagerRights_RIGHT_CFG_WEB_SERVICES: IMTConManager_EnManagerRights = 63;
pub const IMTConManager_EnManagerRights_RIGHT_FINTEZA_ACCESS: IMTConManager_EnManagerRights = 64;
pub const IMTConManager_EnManagerRights_RIGHT_FINTEZA_WEBSITES: IMTConManager_EnManagerRights = 65;
pub const IMTConManager_EnManagerRights_RIGHT_FINTEZA_CAMPAIGNS: IMTConManager_EnManagerRights = 66;
pub const IMTConManager_EnManagerRights_RIGHT_FINTEZA_REPORTS: IMTConManager_EnManagerRights = 67;
pub const IMTConManager_EnManagerRights_RIGHT_ACC_TECHNICAL: IMTConManager_EnManagerRights = 70;
pub const IMTConManager_EnManagerRights_RIGHT_ACC_TECHNICAL_MODIFY: IMTConManager_EnManagerRights =
    71;
pub const IMTConManager_EnManagerRights_RIGHT_CLIENTS_ACCESS: IMTConManager_EnManagerRights = 96;
pub const IMTConManager_EnManagerRights_RIGHT_CLIENTS_CREATE: IMTConManager_EnManagerRights = 97;
pub const IMTConManager_EnManagerRights_RIGHT_CLIENTS_EDIT: IMTConManager_EnManagerRights = 98;
pub const IMTConManager_EnManagerRights_RIGHT_CLIENTS_DELETE: IMTConManager_EnManagerRights = 99;
pub const IMTConManager_EnManagerRights_RIGHT_DOCUMENTS_ACCESS: IMTConManager_EnManagerRights = 100;
pub const IMTConManager_EnManagerRights_RIGHT_DOCUMENTS_CREATE: IMTConManager_EnManagerRights = 101;
pub const IMTConManager_EnManagerRights_RIGHT_DOCUMENTS_EDIT: IMTConManager_EnManagerRights = 102;
pub const IMTConManager_EnManagerRights_RIGHT_DOCUMENTS_DELETE: IMTConManager_EnManagerRights = 103;
pub const IMTConManager_EnManagerRights_RIGHT_DOCUMENTS_FILES_ADD: IMTConManager_EnManagerRights =
    104;
pub const IMTConManager_EnManagerRights_RIGHT_DOCUMENTS_FILES_DELETE:
    IMTConManager_EnManagerRights = 105;
pub const IMTConManager_EnManagerRights_RIGHT_COMMENTS_ACCESS: IMTConManager_EnManagerRights = 106;
pub const IMTConManager_EnManagerRights_RIGHT_COMMENTS_CREATE: IMTConManager_EnManagerRights = 107;
pub const IMTConManager_EnManagerRights_RIGHT_COMMENTS_DELETE: IMTConManager_EnManagerRights = 108;
pub const IMTConManager_EnManagerRights_RIGHT_CLIENTS_KYC: IMTConManager_EnManagerRights = 109;
pub const IMTConManager_EnManagerRights_RIGHT_FIRST: IMTConManager_EnManagerRights = 0;
pub const IMTConManager_EnManagerRights_RIGHT_LAST: IMTConManager_EnManagerRights = 128;
pub type IMTConManager_EnManagerRights = ::std::os::raw::c_int;
pub const IMTConManager_EnManagerRightFlags_RIGHT_FLAGS_DENIED: IMTConManager_EnManagerRightFlags =
    0;
pub const IMTConManager_EnManagerRightFlags_RIGHT_FLAGS_GRANTED: IMTConManager_EnManagerRightFlags =
    1;
pub const IMTConManager_EnManagerRightFlags_RIGHT_FLAGS_NONE: IMTConManager_EnManagerRightFlags = 0;
pub const IMTConManager_EnManagerRightFlags_RIGHT_FLAGS_ALL: IMTConManager_EnManagerRightFlags = 1;
pub type IMTConManager_EnManagerRightFlags = ::std::os::raw::c_int;
pub const IMTConManager_EnManagerLimit_MANAGER_LIMIT_ALL: IMTConManager_EnManagerLimit = 0;
pub const IMTConManager_EnManagerLimit_MANAGER_LIMIT_MONTHS_1: IMTConManager_EnManagerLimit = 1;
pub const IMTConManager_EnManagerLimit_MANAGER_LIMIT_MONTHS_3: IMTConManager_EnManagerLimit = 2;
pub const IMTConManager_EnManagerLimit_MANAGER_LIMIT_MONTHS_6: IMTConManager_EnManagerLimit = 3;
pub const IMTConManager_EnManagerLimit_MANAGER_LIMIT_YEAR_1: IMTConManager_EnManagerLimit = 4;
pub const IMTConManager_EnManagerLimit_MANAGER_LIMIT_YEAR_2: IMTConManager_EnManagerLimit = 5;
pub const IMTConManager_EnManagerLimit_MANAGER_LIMIT_YEAR_3: IMTConManager_EnManagerLimit = 6;
pub const IMTConManager_EnManagerLimit_MANAGER_LIMIT_FIRST: IMTConManager_EnManagerLimit = 0;
pub const IMTConManager_EnManagerLimit_MANAGER_LIMIT_LAST: IMTConManager_EnManagerLimit = 6;
pub type IMTConManager_EnManagerLimit = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConManager"][::std::mem::size_of::<IMTConManager>() - 8usize];
    ["Alignment of IMTConManager"][::std::mem::align_of::<IMTConManager>() - 8usize];
};
#[repr(C)]
pub struct IMTConManagerSink__bindgen_vtable {}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMTConManagerSink {
    pub vtable_: *const IMTConManagerSink__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConManagerSink"][::std::mem::size_of::<IMTConManagerSink>() - 8usize];
    ["Alignment of IMTConManagerSink"][::std::mem::align_of::<IMTConManagerSink>() - 8usize];
};
#[repr(C)]
pub struct IMTConHistorySync__bindgen_vtable {
    pub IMTConHistorySync_Release: unsafe extern "C" fn(this: *mut IMTConHistorySync),
    pub IMTConHistorySync_Assign: unsafe extern "C" fn(
        this: *mut IMTConHistorySync,
        param: *const IMTConHistorySync,
    ) -> MTAPIRES,
    pub IMTConHistorySync_Clear: unsafe extern "C" fn(this: *mut IMTConHistorySync) -> MTAPIRES,
    pub IMTConHistorySync_Server1:
        unsafe extern "C" fn(this: *mut IMTConHistorySync, server: LPCWSTR) -> MTAPIRES,
    pub IMTConHistorySync_Server: unsafe extern "C" fn(this: *const IMTConHistorySync) -> LPCWSTR,
    pub IMTConHistorySync_ServerType1:
        unsafe extern "C" fn(this: *mut IMTConHistorySync, type_: UINT) -> MTAPIRES,
    pub IMTConHistorySync_ServerType: unsafe extern "C" fn(this: *const IMTConHistorySync) -> UINT,
    pub IMTConHistorySync_Mode1:
        unsafe extern "C" fn(this: *mut IMTConHistorySync, mode: UINT) -> MTAPIRES,
    pub IMTConHistorySync_Mode: unsafe extern "C" fn(this: *const IMTConHistorySync) -> UINT,
    pub IMTConHistorySync_ModeSync1:
        unsafe extern "C" fn(this: *mut IMTConHistorySync, type_: UINT) -> MTAPIRES,
    pub IMTConHistorySync_ModeSync: unsafe extern "C" fn(this: *const IMTConHistorySync) -> UINT,
    pub IMTConHistorySync_TimeCorrection1: unsafe extern "C" fn(
        this: *mut IMTConHistorySync,
        correction: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTConHistorySync_TimeCorrection:
        unsafe extern "C" fn(this: *const IMTConHistorySync) -> ::std::os::raw::c_int,
    pub IMTConHistorySync_From1:
        unsafe extern "C" fn(this: *mut IMTConHistorySync, from: INT64) -> MTAPIRES,
    pub IMTConHistorySync_From: unsafe extern "C" fn(this: *const IMTConHistorySync) -> INT64,
    pub IMTConHistorySync_To1:
        unsafe extern "C" fn(this: *mut IMTConHistorySync, to: INT64) -> MTAPIRES,
    pub IMTConHistorySync_To: unsafe extern "C" fn(this: *const IMTConHistorySync) -> INT64,
    pub IMTConHistorySync_SymbolAdd:
        unsafe extern "C" fn(this: *mut IMTConHistorySync, path: LPCWSTR) -> MTAPIRES,
    pub IMTConHistorySync_SymbolUpdate:
        unsafe extern "C" fn(this: *mut IMTConHistorySync, pos: UINT, path: LPCWSTR) -> MTAPIRES,
    pub IMTConHistorySync_SymbolShift: unsafe extern "C" fn(
        this: *mut IMTConHistorySync,
        pos: UINT,
        shift: ::std::os::raw::c_int,
    ) -> MTAPIRES,
    pub IMTConHistorySync_SymbolDelete:
        unsafe extern "C" fn(this: *mut IMTConHistorySync, pos: UINT) -> MTAPIRES,
    pub IMTConHistorySync_SymbolTotal: unsafe extern "C" fn(this: *const IMTConHistorySync) -> UINT,
    pub IMTConHistorySync_SymbolNext:
        unsafe extern "C" fn(this: *const IMTConHistorySync, pos: UINT) -> LPCWSTR,
    pub IMTConHistorySync_Flags1:
        unsafe extern "C" fn(this: *mut IMTConHistorySync, flags: UINT64) -> MTAPIRES,
    pub IMTConHistorySync_Flags: unsafe extern "C" fn(this: *const IMTConHistorySync) -> UINT64,
    pub IMTConHistorySync_HistoryData1:
        unsafe extern "C" fn(this: *mut IMTConHistorySync, data: UINT) -> MTAPIRES,
    pub IMTConHistorySync_HistoryData: unsafe extern "C" fn(this: *const IMTConHistorySync) -> UINT,
    pub IMTConHistorySync_Login1:
        unsafe extern "C" fn(this: *mut IMTConHistorySync, login: UINT64) -> MTAPIRES,
    pub IMTConHistorySync_Login: unsafe extern "C" fn(this: *const IMTConHistorySync) -> UINT64,
    pub IMTConHistorySync_Password1:
        unsafe extern "C" fn(this: *mut IMTConHistorySync, password: LPCWSTR) -> MTAPIRES,
    pub IMTConHistorySync_Password: unsafe extern "C" fn(this: *const IMTConHistorySync) -> LPCWSTR,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConHistorySync {
    pub vtable_: *const IMTConHistorySync__bindgen_vtable,
}
pub const IMTConHistorySync_EnHistoryMode_HISTORY_DISABLED: IMTConHistorySync_EnHistoryMode = 0;
pub const IMTConHistorySync_EnHistoryMode_HISTORY_ENABLED: IMTConHistorySync_EnHistoryMode = 1;
pub const IMTConHistorySync_EnHistoryMode_HISTORY_FIRST: IMTConHistorySync_EnHistoryMode = 0;
pub const IMTConHistorySync_EnHistoryMode_HISTORY_LAST: IMTConHistorySync_EnHistoryMode = 1;
pub type IMTConHistorySync_EnHistoryMode = ::std::os::raw::c_int;
pub const IMTConHistorySync_EnHistorySyncMode_MODE_REPLACE: IMTConHistorySync_EnHistorySyncMode = 0;
pub const IMTConHistorySync_EnHistorySyncMode_MODE_MERGE: IMTConHistorySync_EnHistorySyncMode = 1;
pub const IMTConHistorySync_EnHistorySyncMode_MODE_FIRST: IMTConHistorySync_EnHistorySyncMode = 0;
pub const IMTConHistorySync_EnHistorySyncMode_MODE_LAST: IMTConHistorySync_EnHistorySyncMode = 1;
pub type IMTConHistorySync_EnHistorySyncMode = ::std::os::raw::c_int;
pub const IMTConHistorySync_EnHistorySyncServer_SERVER_MT4: IMTConHistorySync_EnHistorySyncServer =
    0;
pub const IMTConHistorySync_EnHistorySyncServer_SERVER_MT5: IMTConHistorySync_EnHistorySyncServer =
    1;
pub const IMTConHistorySync_EnHistorySyncServer_SERVER_FIRST:
    IMTConHistorySync_EnHistorySyncServer = 0;
pub const IMTConHistorySync_EnHistorySyncServer_SERVER_LAST: IMTConHistorySync_EnHistorySyncServer =
    1;
pub type IMTConHistorySync_EnHistorySyncServer = ::std::os::raw::c_int;
pub const IMTConHistorySync_EnHistorySyncFlags_FLAG_SESSIONS: IMTConHistorySync_EnHistorySyncFlags =
    1;
pub const IMTConHistorySync_EnHistorySyncFlags_FLAG_SYNONYMS: IMTConHistorySync_EnHistorySyncFlags =
    2;
pub const IMTConHistorySync_EnHistorySyncFlags_FLAG_NONE: IMTConHistorySync_EnHistorySyncFlags = 0;
pub const IMTConHistorySync_EnHistorySyncFlags_FLAG_ALL: IMTConHistorySync_EnHistorySyncFlags = 3;
pub type IMTConHistorySync_EnHistorySyncFlags = ::std::os::raw::c_int;
pub const IMTConHistorySync_EnHistoryData_DATA_HISTORY_CHARTS: IMTConHistorySync_EnHistoryData = 0;
pub const IMTConHistorySync_EnHistoryData_DATA_HISTORY_TICKS: IMTConHistorySync_EnHistoryData = 1;
pub const IMTConHistorySync_EnHistoryData_DATA_HISTORY_ALL: IMTConHistorySync_EnHistoryData = 2;
pub const IMTConHistorySync_EnHistoryData_DATA_HISTORY_FIRST: IMTConHistorySync_EnHistoryData = 0;
pub const IMTConHistorySync_EnHistoryData_DATA_HISTORY_LAST: IMTConHistorySync_EnHistoryData = 2;
pub type IMTConHistorySync_EnHistoryData = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConHistorySync"][::std::mem::size_of::<IMTConHistorySync>() - 8usize];
    ["Alignment of IMTConHistorySync"][::std::mem::align_of::<IMTConHistorySync>() - 8usize];
};
#[repr(C)]
pub struct IMTConHistorySyncSink__bindgen_vtable {}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMTConHistorySyncSink {
    pub vtable_: *const IMTConHistorySyncSink__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConHistorySyncSink"][::std::mem::size_of::<IMTConHistorySyncSink>() - 8usize];
    ["Alignment of IMTConHistorySyncSink"]
        [::std::mem::align_of::<IMTConHistorySyncSink>() - 8usize];
};
#[repr(C)]
pub struct IMTConFeederTranslate__bindgen_vtable {
    pub IMTConFeederTranslate_Release: unsafe extern "C" fn(this: *mut IMTConFeederTranslate),
    pub IMTConFeederTranslate_Assign: unsafe extern "C" fn(
        this: *mut IMTConFeederTranslate,
        param: *const IMTConFeederTranslate,
    ) -> MTAPIRES,
    pub IMTConFeederTranslate_Clear:
        unsafe extern "C" fn(this: *mut IMTConFeederTranslate) -> MTAPIRES,
    pub IMTConFeederTranslate_Source1:
        unsafe extern "C" fn(this: *mut IMTConFeederTranslate, source: LPCWSTR) -> MTAPIRES,
    pub IMTConFeederTranslate_Source:
        unsafe extern "C" fn(this: *const IMTConFeederTranslate) -> LPCWSTR,
    pub IMTConFeederTranslate_Symbol1:
        unsafe extern "C" fn(this: *mut IMTConFeederTranslate, symbol: LPCWSTR) -> MTAPIRES,
    pub IMTConFeederTranslate_Symbol:
        unsafe extern "C" fn(this: *const IMTConFeederTranslate) -> LPCWSTR,
    pub IMTConFeederTranslate_BidMarkup1:
        unsafe extern "C" fn(this: *mut IMTConFeederTranslate, markup: INT) -> MTAPIRES,
    pub IMTConFeederTranslate_BidMarkup:
        unsafe extern "C" fn(this: *const IMTConFeederTranslate) -> INT,
    pub IMTConFeederTranslate_AskMarkup1:
        unsafe extern "C" fn(this: *mut IMTConFeederTranslate, markup: INT) -> MTAPIRES,
    pub IMTConFeederTranslate_AskMarkup:
        unsafe extern "C" fn(this: *const IMTConFeederTranslate) -> INT,
    pub IMTConFeederTranslate_Digits:
        unsafe extern "C" fn(this: *const IMTConFeederTranslate) -> UINT,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConFeederTranslate {
    pub vtable_: *const IMTConFeederTranslate__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConFeederTranslate"][::std::mem::size_of::<IMTConFeederTranslate>() - 8usize];
    ["Alignment of IMTConFeederTranslate"]
        [::std::mem::align_of::<IMTConFeederTranslate>() - 8usize];
};
#[repr(C)]
pub struct IMTConFeederModule__bindgen_vtable {
    pub IMTConFeederModule_Release: unsafe extern "C" fn(this: *mut IMTConFeederModule),
    pub IMTConFeederModule_Assign: unsafe extern "C" fn(
        this: *mut IMTConFeederModule,
        param: *const IMTConFeederModule,
    ) -> MTAPIRES,
    pub IMTConFeederModule_Clear: unsafe extern "C" fn(this: *mut IMTConFeederModule) -> MTAPIRES,
    pub IMTConFeederModule_Name: unsafe extern "C" fn(this: *const IMTConFeederModule) -> LPCWSTR,
    pub IMTConFeederModule_Vendor: unsafe extern "C" fn(this: *const IMTConFeederModule) -> LPCWSTR,
    pub IMTConFeederModule_Description:
        unsafe extern "C" fn(this: *const IMTConFeederModule) -> LPCWSTR,
    pub IMTConFeederModule_Module: unsafe extern "C" fn(this: *const IMTConFeederModule) -> LPCWSTR,
    pub IMTConFeederModule_FeedServer:
        unsafe extern "C" fn(this: *const IMTConFeederModule) -> LPCWSTR,
    pub IMTConFeederModule_FeedLogin:
        unsafe extern "C" fn(this: *const IMTConFeederModule) -> LPCWSTR,
    pub IMTConFeederModule_FeedPassword:
        unsafe extern "C" fn(this: *const IMTConFeederModule) -> LPCWSTR,
    pub IMTConFeederModule_Version: unsafe extern "C" fn(this: *const IMTConFeederModule) -> UINT,
    pub IMTConFeederModule_Modes: unsafe extern "C" fn(this: *const IMTConFeederModule) -> UINT,
    pub IMTConFeederModule_Fields: unsafe extern "C" fn(this: *const IMTConFeederModule) -> UINT,
    pub IMTConFeederModule_ParameterTotal:
        unsafe extern "C" fn(this: *const IMTConFeederModule) -> UINT,
    pub IMTConFeederModule_ParameterNext: unsafe extern "C" fn(
        this: *const IMTConFeederModule,
        pos: UINT,
        param: *mut IMTConParam,
    ) -> MTAPIRES,
    pub IMTConFeederModule_ParameterGet: unsafe extern "C" fn(
        this: *const IMTConFeederModule,
        name: LPCWSTR,
        param: *mut IMTConParam,
    ) -> MTAPIRES,
}
#[repr(C)]
#[derive(Debug)]
pub struct IMTConFeederModule {
    pub vtable_: *const IMTConFeederModule__bindgen_vtable,
}
pub const IMTConFeederModule_EnFeedersFieldFlags_FEED_FIELD_SERVER:
    IMTConFeederModule_EnFeedersFieldFlags = 1;
pub const IMTConFeederModule_EnFeedersFieldFlags_FEED_FIELD_LOGIN:
    IMTConFeederModule_EnFeedersFieldFlags = 2;
pub const IMTConFeederModule_EnFeedersFieldFlags_FEED_FIELD_PASS:
    IMTConFeederModule_EnFeedersFieldFlags = 4;
pub const IMTConFeederModule_EnFeedersFieldFlags_FEED_FIELD_PARAM:
    IMTConFeederModule_EnFeedersFieldFlags = 8;
pub const IMTConFeederModule_EnFeedersFieldFlags_FEED_FIELD_NONE:
    IMTConFeederModule_EnFeedersFieldFlags = 0;
pub const IMTConFeederModule_EnFeedersFieldFlags_FEED_FIELD_ALL:
    IMTConFeederModule_EnFeedersFieldFlags = 15;
pub type IMTConFeederModule_EnFeedersFieldFlags = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMTConFeederModule"][::std::mem::size_of::<IMTConFeederModule>() - 8usize];
    ["Alignment of IMTConFeederModule"][::std::mem::align_of::<IMTConFeederModule>() - 8usize];
};
#[repr(C)]
pub struct IMTConGatewayTranslate__bindgen_vtable {
    pub IMTConGatewayTranslate_Release: unsafe extern "C" fn(this: *mut IMTConGatewayTranslate),
    pub IMTConGatewayTranslate_Assign: unsafe extern "C" fn(
        this: *mut IMTConGatewayTranslate,
        param: *const IMTConGatewayTranslate,
    ) -> MTAPIRES,
    pub IMTConGatewayTranslate_Clear:
        unsafe extern "C" fn(this: *mut IMTConGatewayTranslate) -> MTAPIRES,
    pub IMTConGatewayTranslate_Source1:
        unsafe extern "C" fn(this: *mut IMTConGatewayTranslate, source: LPCWSTR) -> MTAPIRES,
    pub IMTConGatewayTranslate_Source:
        unsafe extern "C" fn(this: *const IMTConGatewayTranslate) -> LPCWSTR,
    pub IMTConGatewayTranslate_Symbol1:
        unsafe extern "C" fn(this: *mut IMTConGatewayTranslate, symbol: LPCWSTR) -> MTAPIRES,
    pub IMTConGatewayTranslate_Symbol:
        unsafe extern "C" fn(this: *const IMTConGatewayTranslate) -> LPCWSTR,
    pub IMTConGatewayTranslate_BidMarkup1:
        unsafe extern "C" fn(this: *mut IMTConGatewayTranslate, markup: INT) -> MTAPIRES,
    pub IMTConGatewayTranslate_BidMarkup:
        unsafe extern "C" fn(this: *const IMTConGatewayTranslate) -> INT,
    pub IMTConGatewayTranslate_AskMarkup1:
        unsafe extern "C" fn(this: *mut IMTConGatewayTranslate, markup: INT) -> MTAPIRES,
    pub IMTConGatewayTranslate_AskMarkup:
